[
    {
        "Title": "FACTBOX-Key facts about UAW wage, benefits",
        "URL": "FACTBOX-Key facts about UAW wage, benefits.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    DETROIT, Dec 12 (Reuters) - The wages and benefits for the  United Auto Workers union are at the center of a debate on a  $14 billion package in emergency loans to U.S. automakers.      Some Republican senators want Detroit autoworkers to have  pay parity with foreign auto manufacturers.      But the UAW has said the wages and benefits of its members  are now competitive with workers employed by Japanese  automakers following landmark labor agreements the union  reached with General Motors Corp <GM.N>, Chrysler and Ford  Motor Co <F.N> in 2007.      The agreement slashed wages for new hires and created a  trust for retiree healthcare called a Voluntary Employee  Beneficiary Association, or VEBA, to shift liabilities to a  union-aligned trust to be established in 2010.      Here are details of the average hourly labor cost of UAW  workers employed at Ford and those employed by non-U.S. based  automakers with plants in the United States. The figures are  similar across the three Detroit automakers.           WAGES: Base wages and cost of living adjustments      UAW: $29      Transplants: $26           WAGE RELATED: Paid vacation, overtime, holidays, night and  weekend pay, break time      UAW: $14      Transplants: $9           BENEFITS: Healthcare, training, etc      UAW: $12      Transplants: $11           LEGACY COSTS (Without VEBA): Pension and healthcare  benefits for retirees      UAW: $16      Transplants: $3           LEGACY COSTS (With VEBA): Pension and healthcare benefits  for retirees      UAW: $3      Transplants: $3      TOTAL LABOR COST:      UAW (without VEBA): $71      UAW (with VEBA): $58      Transplants: $49           Source: Ford.      Note: Average wage assumes 20 percent entry-level  employees.   (Reporting by Poornima Gupta; Editing by Gary Hill)   ((poornima.gupta@reuters.com; 313-967-1901; Reuters Messaging:  poornima.gupta.reuters.com@reuters.net))  Keywords: UAW/TRANSPLANT WAGES        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 17.371871948242188,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it provides factual information about the wages and benefits of the United Auto Workers union and compares them with non-U.S. based automakers. The reporting appears to be objective, presenting data without subjective opinions or misleading information."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Autoworkers Union Keeps _6 Million Golf Course for Members at _33 Million Lakeside Retreat.txt",
        "URL": "Autoworkers Union Keeps _6 Million Golf Course for Members at _33 Million Lakeside Retreat.txt.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Fox_News_Channel_logo.svg/240px-Fox_News_Channel_logo.svg.png",
        "Text": "The United Auto Workers may be out of the hole now that President Bush has approved a $17 billion bailout of the U.S. auto industry, but the union isn't out of the bunker just yet.\n\nEven as the industry struggles with massive losses, the UAW brass continue to own and operate a $33 million lakeside retreat in Michigan, complete with a $6.4 million designer golf course. And it's costing them millions each year.\n\n• Click here to see photos of the UAW's $33 million retreat.\n\nThe UAW, known more for its strikes than its slices, hosts seminars and junkets at the Walter and May Reuther Family Education Center in Onaway, Mich., which is nestled on \"1,000 heavily forested acres\" on Michigan's Black Lake, according to its Web site.\n\nBut the Black Lake club and retreat, which are among the union's biggest fixed assets, have lost $23 million in the past five years alone, a heavy albatross around the union's neck as it tries to manage a multibillion-dollar pension plan crisis.\n\nCritics call it a resort for union leaders that wastes money from union dues.\n\n\"It's their members' money that they're spending on this thing,\" said Justin Wilson, managing director of the Center for Union Facts, a union watchdog group. \"The union has bigger issues at hand than managing a golf course.\"\n\nManaging the course may become a burden for the union. The UAW covers costs for the Reuther Center from the interest it earns on its strike fund, according to tax documents, but massive losses in the past five years have forced the union to make heavy loans to keep the center afloat. Critics call it a poor investment for a group with over $1.25 billion in assets.\n\n\"Unions certainly have had real estate investments in the past, but investments are supposed to make money, not bleed money,\" said Wilson.\n\nThe UAW did not return calls from FOXNews.com, and a spokesman could not be reached for comment.\n\nThe Reuther Center is open 11 months of the year to offer courses on leadership, political action, civil rights and other topics; it hosts nearly 10,000 visitors annually. The UAW says it sends workers there to \"learn, experience unionism (and) commit to labor's cause,\" according to their Web site.\n\nThe center was purchased in 1967 and underwent massive renovations in the '90s under the careful watch of former UAW president Steve Yokich. \"Today's Black Lake might not exist if not for Steve Yokich,\" said union member Bob Reidt, whom Yokich appointed as Black Lake's director. \"Yokich is responsible for rebuilding Black Lake.\"\n\nThe UAW erected a monument to its longtime president Walter Reuther — the center's namesake — which bears an inscription of his words: \"There is no greater calling than to serve your brother. There is no greater satisfaction than to have done it well.\"\n\nBut Reuther, who died in a plane crash en route to the center in 1970, never knew the satisfaction of Black Lake's \"well-groomed fairways,\" a course that Michigan Golf Magazine called a \"stunning visual marvel.\"\n\nUnion members can play golf at discounted rates on one of the country's top 100 courses, designed in 2000 by famed course architect Rees Jones at a cost of $6 million.\n\nThe center has a storied history. Reuther had his ashes scattered at the site, and Lucille Ball and Desi Arnaz honeymooned there in 1940, well before it was bought by the UAW.\n\n\"It's funny that they call it an education center — it's a resort,\" said Wilson. \"If I was a union member, I would prefer that they rented out a room at the Ramada Inn.\"",
        "Histogram": [
            0,
            0,
            0,
            0,
            0.6,
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0,
            0.6,
            0.6
        ],
        "Relevance": 15.051570892333984,
        "BiasReport": {
            "sentences": [
                {
                    "text": "The UAW, known more for its strikes than its slices, hosts seminars and junkets at the Walter and May Reuther Family Education Center in Onaway, Mich., which is nestled on \"1,000 heavily forested acres\" on Michigan's Black Lake, according to its Web site.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'known more for its strikes than its slices' uses a word choice that subtly undermines the UAW's activities by emphasizing negative aspects (strikes) over potentially positive ones (slices, referring to golf). This implies a judgment about the union's priorities."
                },
                {
                    "text": "Critics call it a resort for union leaders that wastes money from union dues.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence presents the opinion of critics as a fact, without providing evidence or a balanced perspective. It implies a negative judgment on the center's purpose and financial management, obscuring the line between fact and opinion."
                },
                {
                    "text": "\"It's their members' money that they're spending on this thing,\" said Justin Wilson, managing director of the Center for Union Facts, a union watchdog group. \"The union has bigger issues at hand than managing a golf course.\"",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Again, this quote presents a subjective opinion about the union's priorities as a definitive truth, suggesting that the union's spending on the center is inherently misplaced without acknowledging potential benefits or counterarguments."
                },
                {
                    "text": "Managing the course may become a burden for the union. The UAW covers costs for the Reuther Center from the interest it earns on its strike fund, according to tax documents, but massive losses in the past five years have forced the union to make heavy loans to keep the center afloat. Critics call it a poor investment for a group with over $1.25 billion in assets.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This paragraph frames the situation in a negative light, using phrases like 'massive losses' and 'forced the union to make heavy loans' to emphasize financial struggle. The use of 'Critics call it a poor investment' further injects opinion into what could be a more balanced discussion of financial strategy."
                },
                {
                    "text": "The center was purchased in 1967 and underwent massive renovations in the '90s under the careful watch of former UAW president Steve Yokich. \"Today's Black Lake might not exist if not for Steve Yokich,\" said union member Bob Reidt, whom Yokich appointed as Black Lake's director. \"Yokich is responsible for rebuilding Black Lake.\"",
                    "bias_type": "Mud Praise Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This passage excessively praises the role of Steve Yokich in the center's history, attributing its existence and success solely to his efforts without a balanced or critical evaluation. This can create a misleadingly positive impression."
                },
                {
                    "text": "The UAW erected a monument to its longtime president Walter Reuther — the center's namesake — which bears an inscription of his words: \"There is no greater calling than to serve your brother. There is no greater satisfaction than to have done it well.\"",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of emotionally charged language, such as 'There is no greater calling than to serve your brother,' can evoke a strong, positive emotional response towards the UAW's leadership and the center's mission, potentially overshadowing a more objective analysis."
                },
                {
                    "text": "But Reuther, who died in a plane crash en route to the center in 1970, never knew the satisfaction of Black Lake's \"well-groomed fairways,\" a course that Michigan Golf Magazine called a \"stunning visual marvel.\"",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence uses a poignant anecdote about Walter Reuther's tragic death to emphasize the significance of the golf course, employing emotional sensationalism to elevate the course's status and importance."
                },
                {
                    "text": "\"It's funny that they call it an education center — it's a resort,\" said Wilson. \"If I was a union member, I would prefer that they rented out a room at the Ramada Inn.\"",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The dismissive tone and comparison to a commercial hotel suggest a strong negative opinion about the center's amenities and the union's priorities, presented without a balanced consideration of the center's educational activities or the potential benefits of such facilities for union members."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the UAW's ownership and management of the Walter and May Reuther Family Education Center, particularly in its portrayal of the center as a wasteful expenditure and a mismanagement of union funds. The biases identified include Word Choice Bias, Opinionated Bias, Mud Praise Bias, Emotional Sensationalism Bias, all of which contribute to a general bias tendency against the UAW's investment in the center."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.5185185185185185,
            "overall_rating": 0.5592592592592592
        },
        "combined_score": 0.0
    },
    {
        "Title": "Reuters Summit-UAW to work hard for Obama, union law",
        "URL": "Reuters Summit-UAW to work hard for Obama, union law.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": " (For other news from the Reuters Autos Summit, click on  http://www.reuters.com/summit/Autos08?pid=500)      DETROIT, Sept 16 (Reuters) - United Auto Workers President  Ron Gettelfinger said on Tuesday that the union will work hard  for the election of Democrat Barack Obama for U.S. president  and push for passage of a key union organizing law.      'I know, based on the number of members that we have  registered, based on our polling ourselves, input that we get,  we're going to come in with a very, very high margin behind our  endorsed candidate,' Gettelfinger told reporters at the Reuters  Auto Summit when asked about the UAW's backing of Obama.      'I don't look for us to be any different than what we have  been. We're very effective, we have a very effective political  action program. We're ready to go,' Gettelfinger said.      Michigan is a key swing state in the U.S. November  election, with polls showing Obama and Republican John McCain  in a tight race despite thousands of job losses in the  struggling U.S. auto industry.      Gettelfinger said the UAW and other unions were working to  focus the election on issues like job, pension and benefit  losses among blue color workers, a struggling U.S. middle  class, rising home foreclosures, soaring energy and health  costs, rising government debt and soaring trade deficits.      'It appears to me that the Republicans are running a  campaign based on distraction and they don't want to talk about  the issues because they can't talk about the issues,' he said.      The market share of U.S. vehicle sales by U.S. automakers  dipped below 50 percent in 2007 for the first time on record.  UAW membership at the end of the year fell to 464,910, down 14  percent in the year and the lowest level since 1941.      Gettelfinger said passage of the Employee Free Choice Act  (EFCA) remained a key objective for the UAW going forward.  Blocked in Congress for years, EFCA legislation would let  workers organize by signing union authorization cards; set a  time line for first contracts between unions and employees; and  impose higher fines for violating employees' rights to  organize.      UAW organizing of U.S. plants owned by foreign automakers  has been hampered by companies seeking to intimidate workers,  Gettlefinger said.      'The way organizing works today would be like you running  for governor of the state of Michigan. The only thing is you  can't come into Michigan, and you couldn't campaign inside  Michigan. And your opponent would be inside Michigan and  running all day long,' Gettlefinger said.      'They intimidate workers, they fire workers. If I come in  here right now and you were running an organizing drive and I  just walked over to you and said, 'You're fired,' that's going  to resonate throughout the building.'      Corporate critics claim union backing of the EFCA amounts  to denial of workers' rights to a secret vote on whether to  join a union. But Gettelfinger said UAW support of EFCA was the  same as with its support of any organized political vote.      'We don't tell anybody how to vote. One thing we don't do  is we don't want to get in the voting booth with anybody. But  what we do want to do is make sure that people are informed  when they go in and cast their vote,' Gettelfinger said.      He said the mayor of a town where one foreign-owned plant  was located had told him that 'pro-union workers will be  branded and that they'll have a difficult time getting a job.  And",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 13.891658782958984,
        "BiasReport": {
            "sentences": [
                {
                    "text": "'It appears to me that the Republicans are running a campaign based on distraction and they don't want to talk about the issues because they can't talk about the issues,' he said.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence presents a subjective opinion about the Republicans' campaign strategy as a fact, implying that they are intentionally avoiding discussing important issues. It obscures the line between fact and personal perspective."
                },
                {
                    "text": "UAW organizing of U.S. plants owned by foreign automakers has been hampered by companies seeking to intimidate workers, Gettlefinger said.",
                    "bias_type": "Unsubstantiated Claims Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence presents a claim of companies intimidating workers as a fact without providing concrete evidence to support the validity of this assertion, thus falling into the category of unsubstantiated claims bias."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding political viewpoints and labor issues, with a general tendency towards opinionated statements and unsubstantiated claims. The biases are primarily directed at the Republican campaign strategy and the actions of companies towards UAW organizing efforts."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.04,
            "overall_rating": 0.32
        },
        "combined_score": 0.0
    },
    {
        "Title": "CAW says autoworkers pensions must be protected",
        "URL": "CAW says autoworkers pensions must be protected.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    CALGARY, Alberta, Feb 20 (Reuters) - The Canadian Auto  Workers Union said on Friday that the pensions of its members  must be protected in any restructuring of the Canadian  operations of General Motors Corp <GM.N> and Chrysler  <CBS.UL>.      Ken Lewenza, president of the union that represents 33,000  autoworkers, said he was happy that the restructuring plans  submitted by the two companies to the Canadian and Ontario  governments did not contain any new bad news for his members.      But he stressed that pensions for CAW members must be  protected and the proportion of the firms' manufacturing  operations in Canada must be maintained.   (Reporting by Scott Haggett; editing by Rob Wilson)   ((scott.haggett@thomsonreuters.com; Reuters Messaging:  scott.haggett.reuters.com@reuters.net; +1 403 531-1622))    Keywords: AUTOS CANADA/CAW        ",
        "Histogram": [
            0,
            0,
            0,
            0
        ],
        "Relevance": 13.740904808044434,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides a straightforward report on the Canadian Auto Workers Union's stance on protecting autoworkers' pensions during the restructuring of General Motors Corp and Chrysler in Canada."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "UAW says recognizes union must make changes",
        "URL": "UAW says recognizes union must make changes.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    DETROIT, Dec 12 (Reuters) - United Auto Workers President  Ron Gettelfinger said on Friday that the union recognizes it  will have to make additional changes but it is premature to lay  out the exact steps.      Gettelfinger said he had discussions with General Motors  Corp <GM.N> Chief Executive Rick Wagoner and Chrysler LLC  President Tom LaSorda on Friday morning and the concern was  that auto suppliers could demand faster payment for goods  supplied.      The union chief said GM would not survive beyond December  without federal aid and Chrysler's financial situation was also  precarious.      'If we work for nothing, it wouldn't help them (GM) limp  into January,' he said.   (Reporting by Kevin Krolicki and David Bailey)   ((poornima.gupta@reuters.com; 313-967-1901; Reuters Messaging:  poornima.gupta.reuters.com@reuters.net))   ((Multimedia versions of Reuters Top News are now available  for: * 3000 Xtra: visit http://topnews.session.rservices.com       * BridgeStation: view story .134  For more information on Top News: http://topnews.reuters.com))  Keywords: UAW BAILOUT           DETROIT, Dec 12 (Reuters) - UAW President Ron Gettelfinger:   * Says appreciates White House statement from this morning   * Says union has recognized industry in restructuring mode for a while   * Says other stakeholders not treated the same as organized labor   * Says union was willing to negotiate changes to bill approved by White House   * Says Senate Republican proposal would have required a large exchange of claims to equity in the companies   * Says agreed to put jobs bank elimination in the bill   * Says Senate proposal would have treated workers differentl than every other stakeholder   * Says 'we are on third base and other stakeholders not even in     the ballpark'   * Says only option is for Paulson to use TARP funds or Federal Reserve to use authority to prevent collapse of industry   * Says automaker bankruptcy not an option, would affect every auto manufacturer in the country   * Says response positive from White House and Treasury, 'a lot of work to be done here'   * Says White House recognizes that organized labor has been responsible   * Says union recognizes that it will have to go with additional     restructuring   * Says premature to say what union would do   * Says has had discussions with GM CEO Wagoner and Chrysler President LaSorda Friday morning, bigger concern is need to satisfy suppliers that there is going to be a tomorrow   * Says needs action sooner rather than later   * Says GM would not get out of December without aid, Chrysler situation 'very close' to GM's   * Says 'if we work for nothing, it wouldn't help them (GM) limp into january'   * Says risk of suppliers demanding faster payment like 'a run on     the bank'   * Says minority in Senate saw opportunity to vote against organized labor and support transplant automakers     (Reporting by Kevin Krolicki and David Bailey)  ((detroit.newsroom@reuters.com; +1 313 967 1900))    ",
        "Histogram": [
            0,
            0,
            0.6,
            0.6,
            0
        ],
        "Relevance": 13.585210800170898,
        "BiasReport": {
            "sentences": [
                {
                    "text": "The union chief said GM would not survive beyond December without federal aid and Chrysler's financial situation was also precarious.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence uses dramatic language to evoke fear and urgency, suggesting a catastrophic outcome for GM and Chrysler without federal aid, which may lead to an overemphasis on the negative aspects of the situation."
                },
                {
                    "text": "'If we work for nothing, it wouldn't help them (GM) limp into January,' he said.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This quote employs a metaphor and a sense of desperation to emphasize the direness of the situation, potentially evoking an emotional response from the reader rather than presenting a balanced view."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the financial situation of GM and Chrysler, particularly through the use of emotional sensationalism in describing the potential outcomes without federal aid. The bias tendency leans towards portraying the situation in a more negative light, potentially influencing the reader's perception with dramatic language and metaphors."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.4,
            "overall_rating": 0.5
        },
        "combined_score": 0.0
    },
    {
        "Title": "BRIEF-General Motors offering retirement incentives to uaw workers companywide - union official",
        "URL": "BRIEF-General Motors offering retirement incentives to uaw workers companywide - union official.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    DETROIT, Feb 2 (Reuters) - General Motors Corp <GM.N>:   * Offering retirement incentives to uaw workers companywide - union official   * GM declines comment    ((Detroit Equities; tel: +1 313 967-1901))    ((For more news about General Motors Corp click here: [GM.N]))  ",
        "Histogram": [
            0
        ],
        "Relevance": 13.510053634643555,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it simply reports on General Motors offering retirement incentives to UAW workers, with no indication of subjective or prejudiced language."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "UPDATE 1-Reuters Summit-UAW to work hard for Obama, union law",
        "URL": "UPDATE 1-Reuters Summit-UAW to work hard for Obama, union law.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": " (For other news from the Reuters Autos Summit, click on  http://www.reuters.com/summit/Autos08?pid=500)   (Adds Toyota comment)      DETROIT, Sept 16 (Reuters) - United Auto Workers President  Ron Gettelfinger said on Tuesday that the union would work hard  for the election of Democrat Barack Obama for U.S. president  and push for passage of a key union organizing law.      'I know, based on the number of members that we have  registered, based on our polling ourselves, input that we get,  we're going to come in with a very, very high margin behind our  endorsed candidate,' Gettelfinger told reporters at the Reuters  Auto Summit when asked about the UAW's backing of Obama.      'I don't look for us to be any different than what we have  been,' Gettelfinger said. 'We're very effective; we have a very  effective political action program. We're ready to go.'      Michigan is a key swing state in the November election,  with polls showing Obama and Republican John McCain in a tight  race despite thousands of job losses in the struggling U.S.  auto industry.      Gettelfinger said the UAW and other unions were working to  focus the election on issues like losses of jobs, pensions and  benefits among blue-color workers; a struggling U.S. middle  class; rising home foreclosures; soaring energy and health  costs; rising government debt and soaring trade deficits.      'It appears to me that the Republicans are running a  campaign based on distraction, and they don't want to talk  about the issues because they can't talk about the issues,'  Gettelfinger said.      In 2007, U.S. automakers saw their share of the domestic  market dip below 50 percent for the first time ever. UAW  membership fell 14 percent last year to 464,910, its lowest  level since 1941.           EMPLOYEE FREE CHOICE ACT      Gettelfinger said passage of the Employee Free Choice Act,  or EFCA, remained a key objective for the UAW.      Blocked in Congress for years, EFCA legislation would let  workers organize by signing union authorization cards, set a  time line for first contracts between unions and employees, and  impose higher fines for violating employee rights to organize.      UAW organizing of U.S. plants owned by foreign automakers  has been hampered by companies seeking to intimidate workers,  Gettelfinger said.      'The way organizing works today would be like you running  for governor of the state of Michigan. The only thing is you  can't come into Michigan, and you couldn't campaign inside  Michigan. And your opponent would be inside Michigan and  running all day long,' Gettelfinger said.      'They intimidate workers, they fire workers. If I come in  here right now and you were running an organizing drive and I  just walked over to you and said, 'You're fired,' that's going  to resonate throughout the building.'      Jim Lentz, president of Toyota's <7203.T> U.S. unit, which  operates several nonunion plants, told the Reuters Summit later  on Tuesday that its U.S. workers did not want unions.      'You'd have to ask our employees but so far they're saying  no,' Lentz said. 'As long as we continue to be true to our  culture of respecting our associates, listening to our  associates, we're in pretty good shape.'      Corporate critics claim union backing of the EFCA amounts  to denial of workers' rights to a secret vote on whether to  join a union. But Gettelfinger said UAW support of EFCA was the  same as with its support of any organized political vote.      '",
        "Histogram": [
            0,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0.8,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 13.249091148376465,
        "BiasReport": {
            "sentences": [
                {
                    "text": "'I know, based on the number of members that we have  registered, based on our polling ourselves, input that we get,  we're going to come in with a very, very high margin behind our  endorsed candidate,' Gettelfinger told reporters at the Reuters  Auto Summit when asked about the UAW's backing of Obama.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence implies a high level of confidence in the UAW's support for Obama without providing concrete evidence, blurring the line between fact and opinion."
                },
                {
                    "text": "'It appears to me that the Republicans are running a  campaign based on distraction, and they don't want to talk  about the issues because they can't talk about the issues,'  Gettelfinger said.",
                    "bias_type": "Political Bias",
                    "bias_strength": 0.8,
                    "bias_description": "This statement shows a clear favoritism towards the Democratic party by discrediting the Republicans' campaign strategies without objective analysis."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding political affiliations, with a tendency to favor the Democratic party's viewpoints over the Republicans'. The biases identified include Opinionated Bias and Political Bias, particularly in the context of the UAW's support for Barack Obama and the discussion of campaign strategies."
            }
        },
        "Scores": {
            "average_bias_strength": 0.7,
            "percentage_of_biased_sentences": 0.08695652173913043,
            "overall_rating": 0.39347826086956517
        },
        "combined_score": 0.0
    },
    {
        "Title": "UAW offers support for Chrysler-Fiat alliance",
        "URL": "UAW offers support for Chrysler-Fiat alliance.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    DETROIT, Jan 20 (Reuters) - The United Auto Workers union  on Tuesday offered its support for the alliance between Fiat  SpA <FIA.MI> and Chrysler LLC, saying the tie-up has the  potential to preserve U.S. manufacturing jobs.      UAW President Ron Gettelfinger said in a statement issued  by the union that the alliance 'offers Chrysler new  opportunities to compete in the U.S. market and the global  marketplace.'      'As the U.S. auto industry undergoes a restructuring  process, this alliance has the potential to preserve a wide  range of choices for U.S. consumers, as well as good-paying  manufacturing jobs for our communities,' said Gettelfinger.      UAW Vice President General Holiefield, who heads the  union's negotiations with Chrysler, said the union would work  with both Chrysler and Fiat in the coming weeks.      'UAW members will have a voice as this new alliance takes  shape,' he said.      Under the deal announced on Tuesday, Fiat would take a 35  percent stake in Chrysler in exchange for sharing its small car  technology with the struggling U.S. automaker.   (Reporting by Kevin Krolicki; editing by Gerald E. McCormick) ((kevin.krolicki@thomsonreuters.com; + 1 313 967 1902; Reuters  Messaging: kevin.krolicki@reuters.com@reuters.net))  Keywords: CHRYSLER/UAW        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 12.79245662689209,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides a straightforward report on the United Auto Workers union's support for the alliance between Fiat SpA and Chrysler LLC, highlighting the potential benefits for U.S. manufacturing jobs without introducing any biased language or perspectives."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "BRIEF-UAW to ask Obama to reverse 'unfair conditions'",
        "URL": "BRIEF-UAW to ask Obama to reverse 'unfair conditions'.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    DETROIT, Dec 19 (Reuters) - United Auto Workers union:   * UAW says pleased with government decision on bridge loans   * UAW says all stakeholders, including management, suppliers, dealers, will     have to sacrifice   * UAW says disappointed President added 'unfair conditions singling out     workers'   * UAW says will work with Obama administration to ensure 'unfair conditions     removed'    ((Reporting by Poornima Gupta; tel: +1 313 967-1901))  ",
        "Histogram": [
            0
        ],
        "Relevance": 12.781265258789062,
        "BiasReport": {
            "sentences": [
                {
                    "text": "UAW says disappointed President added 'unfair conditions singling out workers'",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the phrase 'unfair conditions' and 'singling out workers' implies a judgment and suggests that the actions taken by the President are unjust without providing a balanced perspective."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the actions of the President towards workers, specifically through the use of word choice that implies a negative judgment without presenting a balanced view."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 1.0,
            "overall_rating": 0.8
        },
        "combined_score": 0.0
    },
    {
        "Title": "BRIEF-UAW says has reached tentative agreements with Chrysler, Ford, GM",
        "URL": "BRIEF-UAW says has reached tentative agreements with Chrysler, Ford, GM.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    DETROIT, Feb 17 (Reuters) - UAW:   * UAW says has reached tentative agreements with Chrysler, Ford, GM   * UAW says contract changes will help automakers face diffcult economic climate   * UAW says discussions continuing regarding VEBA at all three companies   * UAW says witholding terms of tentative agreements pending completion of veba     talks   * UAW statement from union president Ron Gettelfinger    ((Detroit Equities; tel: +1 313 967-1901))    ",
        "Histogram": [
            0
        ],
        "Relevance": 12.744359970092773,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides a straightforward report on the UAW's tentative agreements with Chrysler, Ford, and GM, along with the contract changes to help the automakers in a difficult economic climate. The information is presented without any indication of bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "UAW membership lowest since World War Two",
        "URL": "UAW membership lowest since World War Two.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    DETROIT, March 28 (Reuters) - Membership in the United Auto  Workers union has dropped below 500,000, hitting its lowest  level since World War Two in a downturn that reflects the  wrenching restructuring by U.S. automakers.      UAW membership dropped by 14 percent from the prior year to  464,910 in 2007, according to the union's annual report, which  was released on Friday to the U.S. Department of Labor.      Membership in the union peaked at near 1.5 million in 1979  and has been declining since. Since 2001, the union has lost  over a third of its membership.      The last time the UAW had fewer than half a million members  was in 1941, according to labor historian Mike Smith of Wayne  State University's Walter P. Reuther library.      By 1945, the union's ranks had increased to about 1 million  members, Smith said.      The Detroit-based UAW negotiated historic contracts with  General Motors Corp <GM.N>, Ford Motor Co <F.N> and Chrysler  LLC last year that allow the Detroit-based automakers to  replace thousands of current workers with others at sharply  lower wages.      But union officials have said that the number of hourly  workers accepting buyouts and early retirement incentives on  offer at all three companies has been much smaller than in 2006  when some 68,000 UAW workers opted to leave Ford and GM.      U.S. employment in the auto industry peaked at 1.1 million  in 1999 but has since fallen by about 27 percent, according to  the statistics compiled by the Ann Arbor, Michigan-based Center  for Automotive Research.      The center estimates that total employment by the three  Detroit-based automakers will fall another 15 percent from just  over 241,000 at the end of 2007 by 2016.      A spokesman for the UAW could not be immediately reached  for comment.      (Reporting by Kevin Krolicki, editing by Richard Chang)   ((Reporting by Kevin Krolicki; Reuters Messaging:  kevin.krolicki@reuters.com@reuters.net; 1-313-967-1902))  Keywords: UAW/       ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 12.713705062866211,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides factual information about the decline in UAW membership and the context surrounding it without employing any of the typical bias types."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "American Axle, UAW resume contract talks",
        "URL": "American Axle, UAW resume contract talks.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    DETROIT, April 9 (Reuters) - American Axle & Manufacturing  Holdings Inc <AXL.N> and the United Auto Workers resumed full  bargaining on Wednesday to try to reach an agreement to end a  6-week strike at five unionized plants in the United States.      American Axle spokeswoman Renee Rogers said the talks  resumed on Wednesday morning, but said she did not know how  long the meeting was expected to last. A UAW representative  could not be reached immediately for comment on Wednesday's  meeting.      The union and the parts supplier on Monday agreed to resume  full negotiations that were stalled for nearly a month while  the two sides sparred over financial details and American  Axle's demands for steep wage and benefit cuts.      The decision to restart full talks came after a meeting  between American Axle Chief Executive Dick Dauch and UAW  President Ron Gettelfinger, who had not met face-to-face since  negotiations began in December.      About 3,650 UAW-represented workers at American Axle went  on strike Feb. 26. The stoppage has forced General Motors Corp  <GM.N>, American Axle's main customer at about 80 percent of  revenue, to idle production at least partially at 30  facilities.      GM resumed some production of full-sized pickup trucks this  week in Indiana. It expects to resume some pickup production in  Ontario for three weeks later in April, while idling full-sized  SUV production at a Texas plant for the same period.      American Axle has said total wages and benefits run more  than $70 per hour, about three times higher than its rivals,  and it will be forced to close the five striking plants if it  cannot obtain concessions from the union.      During the period when talks stagnated over the past month,  the union had said American Axle failed to provide enough  details to evaluate the cost-cutting demands. The company gave  the UAW more financial information last week at the union's  request.      Separately, GM said on Wednesday it had reached a tentative  agreement with one of five UAW local units at GM plants that  have threatened to strike. The local units have threatened  strikes at the GM plants over slow progress in completing the  local details needed.      The tentative agreement was reached with UAW Local 1005,  which represents more than 1,300 hourly workers at a plant in  Parma, Ohio, that has been partly idled by the American Axle  strike, GM spokesman Dan Flores said.      GM remains in talks with union leaders at four other plants  where it received notices from UAW locals, Flores said. Those  plants are in Warren, Flint and Lansing-Delta Township,  Michigan; and in Arlington, Texas.      GM reached a four-year national contract with the United  Auto Workers union last year, but has yet to reach local  agreements with most of the more than 70 union locals  representing individual facilities on issues such as work  rules.   (Reporting by David Bailey and Soyoung Kim; editing by Carol   Bishopric)   ((david.bailey@reuters.com; +1 313 967 1900; Reuters  Messaging: david.bailey.reuters.com@reuters.net))  Keywords: AMERICANAXLE/       ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 12.713370323181152,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it primarily reports on the resumption of contract talks between American Axle & Manufacturing Holdings Inc and the United Auto Workers, along with related details and developments."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "UPDATE 2-UAW goes on strike against American Axle",
        "URL": "UPDATE 2-UAW goes on strike against American Axle.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": " (Adds details from workers, statements, background, byline)      By Kevin Krolicki      DETROIT, Feb 26 (Reuters) - The United Auto Workers began a  strike against auto parts maker American Axle & Manufacturing  Holdings Inc <AXL.N> shortly after midnight on Tuesday after  failing to reach agreement on a new contract.      The strike encompasses some 3,600 workers at American Axle  plants in Michigan and New York whose four-year contract expired  just before midnight Monday after an impasse over cost-cutting  demands from the auto parts supplier.      American Axle said the union was in effect singling the  company out for demanding wages and benefits about equal to  those that rivals now have under their own UAW agreements.      Workers in Detroit walked off the job shortly after midnight  and quickly formed a picket at a gate trudging through a blanket  of snow and carrying signs that read 'Unfair Labor Practices'  and 'UAW on Strike.'      Analysts have said a prolonged UAW strike against the  Detroit-based company has the potential to disrupt production of  trucks and sport utility vehicles by General Motors Corp <GM.N>,  which ranks as the supplier's largest customer.      American Axle had stockpiled parts for GM with the chance of  a work stoppage looming. GM accounted for nearly four-fifths of  American Axle's revenue last year.      The United Auto Workers said the strike had begun at 12:01  ET on Tuesday. Talks broke off Monday with major issues  unresolved, including demands for wage cuts of up to $14 per  hour, the union said.      Elimination of future retiree health care and defined  benefit pensions were also issues, the UAW said. The union also  said American Axle failed to provide the UAW with information it  needed to evaluate the proposed cuts.      The UAW has a 'proven record' of working with companies,  'but cooperation does not mean capitulation,' UAW President Ron  Gettelfinger said in a statement.      American Axle said its ability to maintain production at  those locations or compete for future business would be in  'immediate jeopardy' without sweeping union concessions.      The UAW contract covers facilities in Detroit and Three  Rivers, Michigan; Tonawanda and Cheektowaga, New York; and a  Buffalo, New York, plant idled in late 2007. The UAW also  represents American Axle workers at other facilities covered  under a different agreement that did not expire.      COMPANY FEELS 'SINGLED OUT'      In a statement, the Detroit-based company said the union had  'singled out' the supplier by refusing to allow it to cut hourly  labor costs that are three times higher than its rivals at over  $70 per hour.      'All of the changes we have proposed have been accepted by  the UAW in agreements with our competitors in the United  States,' Chief Executive Dick Dauch said in a statement.      The union said it had made proposals that would have reduced  American Axle's labor costs significantly and given it  operational flexibility.      The strike marks the third auto industry walkout by the UAW  in recent months in North America. The UAW called brief strikes  against GM and Chrysler LLC last year before reaching historic  agreements that allow the Detroit-based automakers to cut labor  costs as they attempt to return to profitability.      The union has also negotiated buyouts and early retirements  with the automakers intended as a way to move higher-paid  workers out of those jobs, while protecting their pension and",
        "Histogram": [
            0,
            0,
            0.6,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 12.676216125488281,
        "BiasReport": {
            "sentences": [
                {
                    "text": "American Axle said the union was in effect singling the company out for demanding wages and benefits about equal to those that rivals now have under their own UAW agreements.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'singling the company out' implies a negative judgment, suggesting that the union's demands are unjust or unfair compared to industry standards, which could influence the reader's perception negatively towards the union."
                },
                {
                    "text": "Analysts have said a prolonged UAW strike against the Detroit-based company has the potential to disrupt production of trucks and sport utility vehicles by General Motors Corp <GM.N>, which ranks as the supplier's largest customer.",
                    "bias_type": "Speculation Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence speculates on the potential impact of the strike on General Motors without concrete evidence, potentially leading the reader to overestimate the immediate consequences and thus sympathize more with the company's position."
                },
                {
                    "text": "American Axle said its ability to maintain production at those locations or compete for future business would be in 'immediate jeopardy' without sweeping union concessions.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'immediate jeopardy' is a hyperbolic phrase designed to evoke strong emotions, suggesting an extreme and urgent threat to the company's operations without providing a balanced perspective."
                },
                {
                    "text": "In a statement, the Detroit-based company said the union had 'singled out' the supplier by refusing to allow it to cut hourly labor costs that are three times higher than its rivals at over $70 per hour.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Similar to the previous instance, the phrase 'singled out' implies a negative judgment and unfairly frames the union's position as unreasonable, potentially biasing the reader against the union."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias through the use of word choice and speculation, particularly in favor of American Axle & Manufacturing Holdings Inc, by framing the union's actions and demands in a negative light and emphasizing potential negative consequences without a balanced perspective."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.047619047619047616,
            "overall_rating": 0.32380952380952377
        },
        "combined_score": 0.0
    },
    {
        "Title": "CAW vows to stay competitive with U.S. auto union",
        "URL": "CAW vows to stay competitive with U.S. auto union.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    TORONTO, Feb 17 (Reuters) - The Canadian Auto Workers union  said on Tuesday it would find cost cutting measures to remain  competitive with the U.S. arms of General Motors Corp <GM.N> and  Chrysler [CBS.UL] after the companies reached agreements in  principal with the United Autoworkers union.      'We are going to measure what the UAW just recently concluded  in bargaining and then we're going to measure it to what the  Canadian operations are, then we're going to maintain our  competitive advantage,' CAW President Ken Lewenza told reporters.      Lewenza said he did not want to speculate on what the union  might do to save the automakers money. He added that the CAW had  yet to see the terms and conditions the companies need to meet to  qualify for loans from the governments of Canada and the province  of Ontario.      GM and Chrysler are due to present their viability plans to  Ottawa on Friday.      The Detroit-based automakers presented their restructuring  plans to U.S. officials earlier on Tuesday and both asked for more  government funding to stay afloat than originally planned.      For its part, GM said it was looking for up to $30 billion  more in U.S. government aid, while Chrysler was looking for  another $5 billion.      GM said it was working to reach agreements with the UAW and  bondholders to reduce around $47 billion in debt.      GM also said it would cut its U.S. workforce by another 20,000  jobs by 2012, with most of those reductions coming earlier.      Chrysler said it plans to cut its total manpower by 3,000  people in 2009.      Lewenza called for the Canadian government to make sure that  the companies maintain a healthy job count in Canada as a  condition of giving them any loans.      'The only way that you can repay the loans, which we are  committed to do, not just as a company, but as CAW members, is to  have a manufacturing footprint in Canada that is profitable,' he  said.      Chrysler said on Tuesday it planned to start talks with the  CAW next week and GM said it planned to reach a deal on a new  contract with the union by the end of March.   ($1=$1.26 Canadian)   (Reporting by John McCrank)   ((john.mccrank@thomsonreuters.com; +1 416 941 8083; Reuters  Messaging: john.mccrank.reuters.com@reuters.net))  Keywords: AUTOS CANADA/CAW       ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 12.552085876464844,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides factual information about the Canadian Auto Workers union's efforts to remain competitive with U.S. auto unions and the actions of General Motors Corp and Chrysler, without displaying any evident bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "UPDATE 1-UAW goes on strike against American Axle",
        "URL": "UPDATE 1-UAW goes on strike against American Axle.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": " (Adds statement from American Axle, details on union statement,  background)      DETROIT, Feb 26 (Reuters) - The United Auto Workers began a  strike against auto parts maker American Axle & Manufacturing  Holdings Inc <AXL.N> shortly after midnight on Tuesday after  failing to reach agreement on a new contract.      Workers in Detroit walked off the job shortly after midnight  and quickly formed a picket at a gate carrying signs that read  'Unfair Labor Practices' and 'On Strike.'      The UAW contract covering about 3,600 American Axle workers  at plants in Michigan and New York expired late Monday.      Analysts have said a prolonged UAW strike against the  Detroit-based company has the potential to disrupt production of  trucks and sport utility vehicles by General Motors Corp <GM.N>,  which ranks as the supplier's largest customer.      American Axle had stockpiled parts for GM with the chance of  a work stoppage looming. GM accounted for nearly four-fifths of  American Axle's revenue last year.      In a short statement, the United Auto Workers said the  strike had begun at 12:01 ET on Tuesday. Talks broke off Monday  with major issues unresolved, including demands for wage cuts of  up to $14 per hour, the union said.      Elimination of future retiree health care and defined  benefit pensions were also issues, the UAW said. The union also  said American Axle failed to provide the UAW with information it  needed to evaluate the proposed cuts.      The UAW has a 'proven record' of working with companies,  'but cooperation does not mean capitulation,' UAW President Ron  Gettelfinger said in a statement.      American Axle said its ability to maintain U.S. production  would be in 'immediate jeopardy' without sweeping concessions  from the UAW.      In a statement, the Detroit-based company said the union had  'singled out' the supplier by refusing to allow it to cut hourly  labor costs that are three times higher than its rivals at over  $70 per hour.      The union said it had made proposals that would have reduced  American Axle's labor costs significantly and given it  operational flexibility.      'It's hard for everybody, strike issues are no win for  anybody,' said Darek Bazinski, a skilled trades worker, who was  standing outside American Axle's facility in Detroit.   (Reporting by Kevin Krolicki, writing by David Bailey; editing  by Kim Coghill and Erica Billingham)    ((kevin.krolicki@reuters.com; phone: 1-313-300-7276))        Keywords: AMERICANAXLE/UAW        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 12.541659355163574,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides factual information about the UAW strike against American Axle & Manufacturing Holdings Inc, including details on the strike, the company's stockpiling efforts, and statements from both the United Auto Workers and American Axle. The reporting appears to be neutral and does not exhibit any of the common forms of bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "UPDATE 1-UAW membership lowest since World War Two",
        "URL": "UPDATE 1-UAW membership lowest since World War Two.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": " (Adds comment from UAW)      DETROIT, March 28 (Reuters) - Membership in the United Auto  Workers union has dropped below 500,000, hitting its lowest  level since World War Two in a downturn that reflects the  wrenching restructuring by U.S. automakers.      UAW membership dropped by 14 percent from the prior year to  464,910 in 2007, according to the union's annual report, which  was released on Friday to the U.S. Department of Labor.      Membership in the union peaked at near 1.5 million in 1979  and has been declining since. Since 2001, the union has lost  over a third of its membership.      The last time the UAW had fewer than half a million members  was in 1941, according to labor historian Mike Smith of Wayne  State University's Walter P. Reuther library.      By 1945, the union's ranks had increased to about 1 million  members, Smith said.      The Detroit-based UAW negotiated historic contracts with  General Motors Corp <GM.N>, Ford Motor Co <F.N> and Chrysler  LLC last year that allow the Detroit-based automakers to  replace thousands of current workers with others at sharply  lower wages.      But union officials have said that the number of hourly  workers accepting buyouts and early retirement incentives on  offer at all three companies has been much smaller than in 2006  when some 68,000 UAW workers opted to leave Ford and GM.      U.S. employment in the auto industry peaked at 1.1 million  in 1999 but has since fallen by about 27 percent, according to  the statistics compiled by the Ann Arbor, Michigan-based Center  for Automotive Research.      The center estimates that total employment by the three  Detroit-based automakers will fall another 15 percent from just  over 241,000 at the end of 2007 by 2016.      UAW spokesman Roger Kerson said the union preferred to  track its membership using the average number of dues-paying  members over the course of the year since strikes and layoffs  can skew the reported number downward at any given time.      On that basis, the UAW's membership dropped 11 percent from  the year earlier to 512,560 in 2007.   (Reporting by Kevin Krolicki, editing by Richard Chang, Gary  Hill)   ((Reporting by Kevin Krolicki; Reuters Messaging:  kevin.krolicki@reuters.com@reuters.net; 1-313-967-1902))  Keywords: UAW/       ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 12.519415855407715,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to exhibit bias. It provides factual information about the decline in UAW membership and the context surrounding it without employing any of the common bias types."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "About 1,650 Axle workers taking buyouts-UAW",
        "URL": "About 1,650 Axle workers taking buyouts-UAW.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    DETROIT, June 24 (Reuters) - About 45 percent of union  workers at American Axle & Manufacturing Holdings Inc <AXL.N>  have already accepted buyout and retirement offers to leave the  company, a union official told Reuters on Tuesday.      About 1,650 of American Axle's 3,650 hourly workers  represented by the United Auto Workers have taken buyout offers  and early retirement incentives, said Bill Alford, president of  UAW Local 235, which represents about half of the supplier's  U.S. hourly workforce.      American Axle, which reached a cost-saving four-year  contract with the UAW in May, has said it aims to cut more than  2,000 jobs under the new contract.      UAW-represented workers have until mid-July to decide  whether to accept buyout offers and have another week to  reconsider their decisions.      American Axle spokeswoman Renee Rogers declined to  comment.      (Reporting by Soyoung Kim)      ((soyoung.kim@thomsonreuters.com; Reuters Messaging:  soyoung.kim.reuters.com@reuters.net; +1 313 967 1903))  Keywords: AMERICANAXLE/        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 12.474857330322266,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it primarily reports factual information about the buyout and retirement offers at American Axle & Manufacturing Holdings Inc without introducing any subjective or misleading elements."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "BRIEF-Ford says UAW deal will help it operate through downturn",
        "URL": "BRIEF-Ford says UAW deal will help it operate through downturn.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    DETROIT, Feb 17 (Reuters) - Ford Motor Co <F.N>:   * Says UAW deal will help it operate through downturn   * Says UAW agreement covers 42,000 workers   * Says reached agreement with uaw on Sunday afternoon   * Says new agreement contingent on VEBA deal   * Says UAW deal would help it operate without accessing US government bridge     loan   * Says UAW deal must be ratified by union membership   * Says UAW deal allows Ford to reach parity with Japanese automakers on labor     costs    ((Detroit Equities; tel: +1 313 967-1900))    ((For more news about Ford Motor Co click here: [F.N]))  ",
        "Histogram": [
            0
        ],
        "Relevance": 12.469301223754883,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it primarily reports factual information about Ford's UAW deal without using language that implies judgment or promotes a specific viewpoint."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "UAW leaders urge approval of Ford concessions",
        "URL": "UAW leaders urge approval of Ford concessions.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    DETROIT, Feb 24 (Reuters) - Officials from the United Auto  Workers on Tuesday urged hourly workers at Ford Motor Co <F.N>  to approve a set of concessions intended to cut operating costs  and cash outlays for the No. 2 U.S. automaker at time when  global sales are tumbling.      UAW officials representing factory workers from Ford  facilities across the United States met on Tuesday in Detroit  and voted unanimously to recommend ratification of the contract  changes, the union said.      The UAW leadership at Ford also voted to complete  ratification votes on the new contract by March 9.      Ford has said the cost-saving changes negotiated midway  through a four-year contract with the UAW set to run until 2011  were needed to allow it to restructure on its own without  resorting to emergency loans from the U.S. government.      General Motors Corp <GM.N> and Chrysler LLC, which have  been kept afloat by a $17.4-billion federal bailout, also have  reached tentative agreements on new operating concessions with  the UAW.      But GM and Chrysler remain in talks with the union about  how to change funding terms for retiree healthcare.      Ford jumped ahead of its rivals by announcing this week  that it had clinched its own deal with the UAW on the issue of  how to restructure its remaining obligations for retiree  healthcare.      Under the proposed change to the Ford contract, which is  subject to both UAW ratification and court approval, the  automaker has the option of settling up to half of the payments  due to a retiree healthcare trust fund in Ford stock.      Previously, Ford had been obligated to make a $13.2 billion  cash contribution to the fund, known as a Voluntary Employee  Beneficiary Association, or VEBA.      Ford's deal with the UAW on the VEBA would save it almost  $7 billion in cash and could provide the model for concessions  at GM and Chrysler, analysts have said.      Ford and the UAW have not yet detailed the other contract  changes that will be put to unionized hourly workers for a  ratification vote.      But one of those changes will phase out a program of near  total job security for UAW workers even after their positions  have been eliminated, both sides have said.      U.S. automakers and the UAW have also been talking about  contract changes that would make it easier for the companies to  hire in new, lower-cost workers and shut down excess plants,  people familiar with the talks have said.      Ford had just under 53,000 hourly workers in North America  at the end of December, down from over 100,000 at the end of  2005, according to company data.   ((kevin.krolicki@thomsonreuters.com; + 1 313 967 1902; Reuters  Messaging: kevin.krolicki@reuters.com@reuters.net))       Keywords: FORD/UAW        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 12.301623344421387,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to exhibit bias as it primarily focuses on reporting the recommendations and negotiations between the United Auto Workers and Ford Motor Co regarding concessions and cost-cutting measures. The language used is neutral and factual, without displaying any of the typical signs of bias such as emotional sensationalism, word choice bias, or unsubstantiated claims."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "UAW open to Chrysler talks with rivals -official",
        "URL": "UAW open to Chrysler talks with rivals -official.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    DETROIT, Dec 7 (Reuters) - The United Auto Workers is open  to moves by Chrysler LLC to seek an alliance with a rival  automaker provided that it preserves as many jobs as possible,  a senior union official said on Sunday.      General Holifield, a UAW vice president who oversees the  union's relations with Chrysler, also said UAW workers were  prepared to make further sacrifices in a bid to save the  struggling U.S. automakers from bankruptcy.      'They're all willing to do the right thing. Whatever it  takes to secure their future, certainly they're ready to be  cooperative to get the job done,' Holiefield told Reuters after  a service at a Detroit church dedicated to prayers for the auto  industry.   (Reporting by Kevin Krolicki; Editing by Leslie Adler)   ((email: kevin.krolicki@thomsonreuters.com; 1-313-967-1902))      Keywords: CHRYSLER/UAW         (Corrects spelling of first reference to name to Holiefield,  not Holifield)      DETROIT, Dec 7 (Reuters) - The United Auto Workers is open  to moves by Chrysler LLC to seek an alliance with a rival  automaker provided that it preserves as many jobs as possible,  a senior union official said on Sunday.      General Holiefield, a UAW vice president who oversees the  union's relations with Chrysler, also said UAW workers were  prepared to make further sacrifices in a bid to save the  struggling U.S. automakers from bankruptcy.      'They're all willing to do the right thing. Whatever it  takes to secure their future, certainly they're ready to be  cooperative to get the job done,' Holiefield told Reuters after  a service at a Detroit church dedicated to prayers for the auto  industry.   (Reporting by Kevin Krolicki; Editing by Leslie Adler)   ((email: kevin.krolicki@thomsonreuters.com; 1-313-967-1902))      Keywords: CHRYSLER/UAW        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 12.250035285949707,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it primarily reports on the United Auto Workers' openness to Chrysler seeking an alliance with a rival automaker and their willingness to make sacrifices to save the U.S. automakers from bankruptcy. The language used is neutral and does not exhibit any of the typical biases discussed."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    }
]