[
    {
        "Title": "Many Hollywood celebrities rally behind Obama",
        "URL": "Many Hollywood celebrities rally behind Obama.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Alex Dobuzinskis      LOS ANGELES, June 19 (Reuters) - Ahead of a big fundraising  event next week, many Hollywood power players are rallying  behind Barack Obama in his bid for U.S. president, pledging  money and starpower after lending early support to his one-time  rival Hillary Clinton.      Experts say that since Clinton conceded defeat earlier this  month in her bid to be the Democratic candidate, celebrities  have quickly united behind Obama.      The result, they said, could be a campaign cash windfall  for the senator from Illinois, but star support doesn't  necessarily transfer directly to votes.      A Tuesday fundraiser in downtown Los Angeles is expected to  attract a host of Hollywood stars and feature a performance by  the singer Seal at a cost of $2,300 per ticket.      Director Steven Spielberg and his partner in the Dreamworks  movie studio, David Geffen, and Dreamworks Animation Chief  Executive Officer Jeffrey Katzenberg are organizing another  Obama fundraiser for later this year, said Andy Spahn, a  consultant to the Hollywood power-trio.      'If a Hollywood celebrity puts his or her mind to it,  they're good money raisers,' said analyst Sherry Bebitch Jeffe,  a senior scholar at the University of Southern California.      'Barbra Streisand, you put her in concert and you raise  fortunes for Democrats, or Bruce Springsteen,' Jeffe said.      Mitchell Schwartz, who was Obama's California campaign  manager through the primary election season, said Obama's  appeal in Hollywood had been limited, until now.      'I don't think we were the Hollywood candidate -- ever,'  Schwartz said. 'I think Hillary might have been more, she might  have had more support.'           ALIGNING THE STARS      Other Obama celebrity endorsers include talk show host  Oprah Winfrey and actors Robert De Niro, Tom Hanks, Scarlett  Johansson and Halle Berry.      Billionaire Geffen upset many Hollywood power players and  political supporters last year when the longtime Clinton  supporter broke for Obama.      Oscar winner Hanks, the star of 'The Da Vinci Code,' gave  money to Bill Clinton's legal defense fund when he was  president, but endorsed Obama with an online video in early  May, when Hillary Clinton was still campaigning.      In the video, Hanks joked that celebrity endorsements do  little to sway voters, and Jeffe said that while stars can help  raise cash, agreed that their appeal may also do harm if voters  consider celebrities too liberal.      During the primaries, Obama had trouble attracting Hispanic  voters in some states because, analysts said, some Hispanics  were reluctant to vote for a black candidate.      But a pro-Obama video in Spanish with Hispanic actors  Jessica Alba of 'The Love Guru,' John Leguizamo of 'The  Happening' and comedian George Lopez, has attracted more than  250,000 viewers on the video sharing site YouTube.com.      'It helps build a broader sense of a candidate's support,'  said professor Chon Noriega, director of the University of  California, Los Angeles, Chicano Studies Research Center. 'But  I don't think that because George Lopez said support (a  candidate) somebody's going to say, 'Well that's who I'm going  to vote for.''      Presumptive Republican candidate Sen. John McCain also has  his celebrity endorsers, including actors Robert Duvall and  Sylvester Stallone.     (Editing by Bob Tourtellotte and David Wiessler)    ((bob.tourtellotte@thomsonreuters.com; 1 213-380-2014))   (please vis",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 16.767608642578125,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it primarily reports on the support of Hollywood celebrities for Barack Obama's presidential campaign without presenting information in a way that favors or disfavors any particular viewpoint."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "UPDATE 1-Many Hollywood celebrities rally behind Obama",
        "URL": "UPDATE 1-Many Hollywood celebrities rally behind Obama.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": " (Updates with details, quotes, paragraphs 3-7)      By Alex Dobuzinskis      LOS ANGELES, June 19 (Reuters) - Many Hollywood celebrities  who had supported Hillary Clinton are rallying behind Barack  Obama, pledging money and star power to the Democrat's U.S.  presidential bid before a big fundraiser next week.      Experts say that since Clinton conceded defeat this month  after a grueling Democratic nominating contest, celebrities  have quickly united behind Obama.      The result, they said, could be a campaign cash windfall  for the senator from Illinois, but star support doesn't  necessarily translate directly to votes.      Sherry Bebitch Jeffe, a senior scholar at the University of  Southern California, said that once a politician becomes known,  voters look for candidates with positions they like and with  whom they can identify, regardless of celebrity backing.      In fact, stars can cause harm if a performer's public image  rubs voters the wrong way. That happened when Jane Fonda and  Barbra Streisand campaigned for former Texas Gov. Ann Richards  in her conservative state, and Richards lost the bid.      'Sometimes they can come back to bite the candidate,' Jeffe  said.      But Los Angeles is a town where stars wield a great deal of  power and have money to spend, and numerous celebrities are  expected to turn out at a Tuesday fundraiser featuring the  singer Seal -- at a cost of $2,300 per ticket.      Director Steven Spielberg and his partner in the Dreamworks  movie studio, David Geffen, and Dreamworks Animation Chief  Executive Officer Jeffrey Katzenberg are organizing another  Obama fundraiser later this year, said Andy Spahn, a consultant  to the Hollywood power trio.      'If a Hollywood celebrity puts his or her mind to it,  they're good money raisers,' Jeffe said.           ALIGNING THE STARS      Mitchell Schwartz, who was Obama's California campaign  manager through the primary election season, said Obama's  appeal in Hollywood had been limited, until now.      'I don't think we were the Hollywood candidate -- ever,'  Schwartz said. 'I think Hillary might have been more ... she  might have had more support.'      Other Obama celebrity endorsers include actors talk show  host Oprah Winfrey and actors Robert De Niro, Tom Hanks,  Scarlett Johansson and Halle Berry.      Billionaire Geffen upset many Hollywood power players last  year when the longtime Clinton supporter broke for Obama.      Oscar winner Hanks, the star of 'The Da Vinci Code,' gave  money to Bill Clinton's legal defense fund when he was  president, but endorsed Obama with an online video in early  May, when Hillary Clinton was still campaigning.      During the primaries, Obama had trouble attracting Hispanic  voters in some states because, analysts said, some Hispanics  were reluctant to vote for a black candidate.      But a pro-Obama video in Spanish with Hispanic actors  Jessica Alba of 'The Love Guru,' John Leguizamo of 'The  Happening' and comedian George Lopez, has attracted more than  250,000 viewers on the video sharing site YouTube.com.      'It helps build a broader sense of a candidate's support,'  said professor Chon Noriega, director of the University of  California, Los Angeles, Chicano Studies Research Center. 'But  I don't think that because George Lopez said support (a  candidate) somebody's going to say, 'Well that's who I'm going  to vote for.''      Presumptive Republican candidate Sen. John McCain also has  his celebrity endors",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 15.876460075378418,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to exhibit bias as it primarily reports on the shift of support from Hollywood celebrities from Hillary Clinton to Barack Obama in the context of the U.S. presidential bid. The information provided is factual and does not display any evident bias towards a particular viewpoint or group."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Barack Obama_ Made in Hollywood.txt",
        "URL": "Barack Obama_ Made in Hollywood.txt.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Fox_News_Channel_logo.svg/240px-Fox_News_Channel_logo.svg.png",
        "Text": "So in an interview Tuesday, Spike Lee said the election of Barack Obama is \"pre-deortained\" -- a word that really doesn't exist, at least in the heads of sane people.\n\nBut, the fact is, Spike's right: Obama's rise is \"pre-deortained,\" at least when it comes to anyone who works in the media or entertainment industry.\n\nSo why is that?\n\nIt's simple: Obama embodies the most eloquent and appealing combination of every liberal cliché molded into an agreeable life form. He's able to take every failed policy and every adolescent and/or misguided belief about wealth and make it sound perfectly sensible -- even heroic!\n\nHe is, in effect, the perfect Hollywood president, not simply because Hollywood loves him, but because Hollywood made him.\n\nThink about this: There has never been, in the history of moviemaking, a noble non-liberal president. Whether he's played by Michael Douglas or Kevin Kline, what makes him appealing are his simple liberal virtues, i.e. bombing bad guys is wrong, the rich are corrupt and the poor deserve your Porsche.\n\nWhere the average Joe sees enterprise, Hollywood and the mainstream media sees American greed. And that's the cause of all the world's problems (exempting their own massive coke habits).\n\nObama is so good at playing this role, that it's easy to overlook the socialist principles embedded in his ideological core. And that's scary.\n\nI mean, wasn't the credit mess nothing more than an act of wealth redistribution? Banks were encouraged to give loans to high-risk folks to buy homes they couldn't afford. It's a free lunch that, in the end, we're all now paying for.\n\nAnd this is what happens when you decide to rearrange a pie instead of growing it. What you get is sticky fingers, instead of a full stomach.\n\nAnd if you disagree with me, then you sir, are worse than Mars Blackman.\n\nGreg Gutfeld hosts \"Red Eye with Greg Gutfeld\" weekdays at 3 a.m. ET. Send your comments to: redeye@foxnews.com",
        "Histogram": [
            0,
            0.6,
            0,
            0.9,
            0.9,
            0.7,
            0.9,
            0.9,
            0.9,
            0.6,
            0.6,
            0.6,
            0.6,
            0.7,
            0.7,
            0.7,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0
        ],
        "Relevance": 14.767992973327637,
        "BiasReport": {
            "sentences": [
                {
                    "text": "But, the fact is, Spike's right: Obama's rise is \"pre-deortained,\" at least when it comes to anyone who works in the media or entertainment industry.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the term 'pre-deortained' to describe Obama's rise, followed by the assertion that it is a fact, implies a judgment about the media and entertainment industry's influence, suggesting a predetermined outcome based on biased word choice."
                },
                {
                    "text": "It's simple: Obama embodies the most eloquent and appealing combination of every liberal cliché molded into an agreeable life form. He's able to take every failed policy and every adolescent and/or misguided belief about wealth and make it sound perfectly sensible -- even heroic!",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This sentence presents a highly subjective and opinionated view of Obama, portraying his characteristics and actions in an overwhelmingly negative light by labeling them as 'liberal cliché' and 'adolescent and/or misguided belief,' without objective analysis."
                },
                {
                    "text": "He is, in effect, the perfect Hollywood president, not simply because Hollywood loves him, but because Hollywood made him.",
                    "bias_type": "Causal Misunderstanding Bias",
                    "bias_strength": 0.7,
                    "bias_description": "This statement implies a direct cause-and-effect relationship between Obama's presidency and Hollywood's influence, suggesting that his entire persona and rise to power are solely attributable to Hollywood's actions, which oversimplifies a complex political process."
                },
                {
                    "text": "Think about this: There has never been, in the history of moviemaking, a noble non-liberal president. Whether he's played by Michael Douglas or Kevin Kline, what makes him appealing are his simple liberal virtues, i.e. bombing bad guys is wrong, the rich are corrupt and the poor deserve your Porsche.",
                    "bias_type": "False Dichotomy Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This sentence presents a false dichotomy by suggesting that in movies, only liberal presidents are portrayed as noble, and it oversimplifies complex political and social issues by reducing them to 'simple liberal virtues,' which is a distortion of reality."
                },
                {
                    "text": "Where the average Joe sees enterprise, Hollywood and the mainstream media sees American greed. And that's the cause of all the world's problems (exempting their own massive coke habits).",
                    "bias_type": "Generalization Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence generalizes the perspectives of 'Hollywood and the mainstream media' as universally condemning enterprise as 'American greed,' attributing a broad characteristic to these groups without acknowledging the diversity of opinions within them."
                },
                {
                    "text": "Obama is so good at playing this role, that it's easy to overlook the socialist principles embedded in his ideological core. And that's scary.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'scary' to describe the potential oversight of Obama's 'socialist principles' employs emotional sensationalism to provoke fear or concern, rather than presenting a balanced or evidence-based analysis of his political ideology."
                },
                {
                    "text": "I mean, wasn't the credit mess nothing more than an act of wealth redistribution? Banks were encouraged to give loans to high-risk folks to buy homes they couldn't afford. It's a free lunch that, in the end, we're all now paying for.",
                    "bias_type": "Causal Misunderstanding Bias",
                    "bias_strength": 0.7,
                    "bias_description": "This statement oversimplifies the causes of the financial crisis by attributing it solely to 'wealth redistribution' through irresponsible lending, neglecting the complex interplay of factors such as deregulation, securitization, and speculative investment."
                },
                {
                    "text": "And this is what happens when you decide to rearrange a pie instead of growing it. What you get is sticky fingers, instead of a full stomach.",
                    "bias_type": "False Dichotomy Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The analogy of 'rearranging a pie instead of growing it' presents a false dichotomy between redistribution and economic growth, suggesting that any effort to address inequality through redistribution is inherently counterproductive, which oversimplifies economic policy options."
                },
                {
                    "text": "And if you disagree with me, then you sir, are worse than Mars Blackman.",
                    "bias_type": "Ad Hominem Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence employs ad hominem by attacking the character of those who disagree, comparing them unfavorably to an unspecified standard ('Mars Blackman'), rather than addressing the substance of any opposing arguments."
                }
            ],
            "overall_bias": {
                "conclusion": "The article is biased regarding the portrayal of Barack Obama and his relationship with the media and entertainment industry, exhibiting a general bias tendency through the use of word choice, opinionated statements, causal misunderstandings, false dichotomies, generalizations, emotional sensationalism, and ad hominem attacks."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6888888888888888,
            "percentage_of_biased_sentences": 0.4090909090909091,
            "overall_rating": 0.5489898989898989
        },
        "combined_score": 0.0
    },
    {
        "Title": "Barack Obama __ Empty Vessel.txt",
        "URL": "Barack Obama __ Empty Vessel.txt.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Fox_News_Channel_logo.svg/240px-Fox_News_Channel_logo.svg.png",
        "Text": "A year after electing Barack Obama president, and five years after his star turn at the Democratic National Convention, we are still trying to figure him out.\n\nIs he a left-wing radical or is he a crowd-pleasing moderate? Is he a uniter? Is he actually religious? Is he a socialist? Does he hate America? And, in light of the confidence he projects, why can’t he seem to take criticism?\n\nBut we could, of course, write that first sentence another way: Only a year after electing Barack Obama president, and we are already trying to figure him out.\n\nRather than it being kind of late to attempt a rigorous analysis of President Obama’s psyche, his political philosophy and his managerial style, perhaps it’s a little too soon. Presidential personalities, after all, develop over time. And the famous saying is true that great leaders aren’t born, but made.\n\nNonetheless, because I’m too young for caution, and too old for fear, I’m more than happy to take a stab at it.\n\nLet me first assuage the fears of many of my conservative friends and colleagues: Barack Obama is not a left-wing radical. He is not a socialist, a communist or a Marxist, and he’s not a black liberation theologist. He’s not un-American, he’s not an atheist, and he’s not a racist.\n\nHe is none of those things, because all would require Barack Obama to have a belief system, a worldview, a set of convictions about political philosophy, theology, and socioeconomics that he simply doesn’t have. He is, instead, empty. He is an empty vessel.\n\nThis will shock and offend his legion of admirers on the left, as it stands in stark contrast to the breathless, leg-thrilling declarations by liberal America that Obama is a deep-thinking, complex, contemplative scholar of soaring intellect, a new kind of leader, exquisitely built for a changing world, who knows the war isn’t between good and evil, but between silence and diplomacy, and for whom indecision is a mark of judicious caution.\n\nBut he’d done nothing to deserve those early accolades, of course. So all of that was pre-ordained and pre-packaged, the result of a coordinated and deliberate campaign by a coalition of marketers, politicos, and members of the press to brand Barack Obama as “hope and change” before anyone even knew what his selling points were, or if he actually had any.\n\nThe proof of his ideological emptiness is practically undeniable. He has been, over the short course of his political career, the great abandoner, ever-willing to denounce those ideals that were previously sold to his constituents as “his convictions.”\n\nAfter 20 years in Reverend Wright’s church, he simply got up and left. The man who baptized his children, who was marketed (to black voters in particular) as Obama’s spiritual adviser, who was so integral in shaping Barack Obama’s adult life, that he publicly denounced him, and left his church altogether. And he also denounced black liberation theology, despite giving numerous interviews about the ways in which it had helped shape his religious worldview. After initially defending Rev. Wright, suddenly he and his brand of religion were chucked out the window of a moving campaign bus. He has yet to find a replacement, unsurprisingly, but his interest in evangelicals like Rick Warren and Carey Cash means he is open to the theological polar opposite of Rev. Wright.\n\nThe same sort of dance occurred with other politically inconvenient allies, like domestic terrorist Bill Ayers, Wright apologist Father Michael Pfleger, and convicted felon Tony Rezko. Obama distanced himself from all of them and then eventually dumped them altogether when it became politically necessary. Van Jones was merely a post-election victim of Obama’s willing abandonment. And there have been others.\n\nSo would a real radical disown his radical mentors and protégés? Would a real extremist and true-believer insist with a straight face that he didn’t really believe all that stuff? Would a real ideologue be persuaded by a public opinion poll to abandon whole ideology?\n\nActual radicals like Wright and Ayers and Jones defend their beliefs, regardless of the pushback and potential fallout. What Obama did, in contrast, was purely political. Because, despite the insistence by the left that Obama somehow transcends politics, that’s what he is – a politician. Nothing more, nothing less.\n\nWe can also look at the shift in his policy positions over the past few years. He was once quoted as saying that he supported a single-payer health care system. The best political decision now, however, was to abandon that for a more docile public option. Once that failed to garner the groundswell of support his advisers thought it would, he appeared altogether indifferent to it. If he were reallya radical, he’d be rallying us around universal health care right now, not some watered-down 1990-page bureaucratic hodge podge that is neither revolutionary nor practical.\n\nHis impassioned pledges to end “Don’t Ask, Don’t Tell,” close Gitmo, bring troops home, end military tribunals, and myriad other promises, suddenly seem less like the stuff of real political conviction, and more like political headaches that require a clever exit strategy.\n\nAnd his reaction to any kind of opposition – from the right, from the citizenry, from Fox News – is equally telling. If Obama’s agenda were based on conviction instead of political expedience and an unquenchable thirst for popularity, criticism would bounce right off him. Instead he seems frighteningly flappable. That’s because leadership without convictions is leadership of empty rhetoric. Convictions can be defended against criticism. Empty rhetoric cannot.\n\nSo why all the radical friends and the radical proposals and the radical rhetoric if he’s not himself a radical? Because his lack of conviction and his inability to forge his own philosophical and theological identity, have made him incredibly susceptible to external influence and pressure. He is easily led. He is, as such, the perfect prospect for someone like Bill Ayers or Reverend Wright, whose radical agendas require vulnerable recruits who are malleable and willing.\n\nI don’t know if President Obama is a man of conviction, if he is a man of faith, or if he is the intellectual giant the left really wants him to be. He very well may be all of those things. But I haven’t seen proof of any of it yet, and neither have you, because there hasn’t been any.\n\nThe only thing we do know for sure, one year after anointing this relative unknown the forty-fourth president of the United States, is that he’s a politician, pure and simple. Calling him a radical gives him way too much credit.\n\nS.E. Cupp is a write and co-author of \"Why You're Wrong About the Right.\" She is a frequent contributor to the Fox Forum.",
        "Histogram": [
            0,
            0.6,
            0.6,
            0.6,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0.9,
            0,
            0.9,
            0.6,
            0.9,
            0.9,
            0.9,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0.9,
            0.9,
            0.9,
            0.9,
            0.9,
            0.9,
            0.9,
            0.9,
            0.9,
            0.9,
            0.9,
            0.9,
            0,
            0.9,
            0.9,
            0,
            0.9,
            0.9,
            0.9,
            0.9,
            0.9,
            0.9,
            0.9,
            0.9,
            0.9,
            0.9,
            0.9,
            0.9,
            0,
            0,
            0
        ],
        "Relevance": 14.59818172454834,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Is he a left-wing radical or is he a crowd-pleasing moderate? Is he a uniter? Is he actually religious? Is he a socialist? Does he hate America? And, in light of the confidence he projects, why can’t he seem to take criticism?",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence is biased as it presents a series of speculative and opinionated questions about Barack Obama's character and beliefs without providing evidence, implying judgment and promoting doubt."
                },
                {
                    "text": "Let me first assuage the fears of many of my conservative friends and colleagues: Barack Obama is not a left-wing radical. He is not a socialist, a communist or a Marxist, and he’s not a black liberation theologist. He’s not un-American, he’s not an atheist, and he’s not a racist.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of negative connotations and the denial of extreme labels in this sentence implies that these labels are inherently negative, influencing perceptions about Barack Obama."
                },
                {
                    "text": "He is none of those things, because all would require Barack Obama to have a belief system, a worldview, a set of convictions about political philosophy, theology, and socioeconomics that he simply doesn’t have. He is, instead, empty. He is an empty vessel.",
                    "bias_type": "Ad Hominem Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This sentence attacks Barack Obama's character by asserting that he lacks a belief system or convictions, without addressing the substance of his actions or statements."
                },
                {
                    "text": "This will shock and offend his legion of admirers on the left, as it stands in stark contrast to the breathless, leg-thrilling declarations by liberal America that Obama is a deep-thinking, complex, contemplative scholar of soaring intellect, a new kind of leader, exquisitely built for a changing world, who knows the war isn’t between good and evil, but between silence and diplomacy, and for whom indecision is a mark of judicious caution.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of hyperbolic language to describe Obama's supporters' views introduces bias by exaggerating their praise and implying irrationality."
                },
                {
                    "text": "But he’d done nothing to deserve those early accolades, of course. So all of that was pre-ordained and pre-packaged, the result of a coordinated and deliberate campaign by a coalition of marketers, politicos, and members of the press to brand Barack Obama as “hope and change” before anyone even knew what his selling points were, or if he actually had any.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This sentence is biased as it presents a subjective opinion about the origins of Obama's public image as an objective fact, without providing evidence."
                },
                {
                    "text": "The proof of his ideological emptiness is practically undeniable. He has been, over the short course of his political career, the great abandoner, ever-willing to denounce those ideals that were previously sold to his constituents as “his convictions.”",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This sentence is biased as it asserts Obama's 'ideological emptiness' and 'great abandoner' status as undeniable facts, without presenting a balanced view or evidence."
                },
                {
                    "text": "So would a real radical disown his radical mentors and protégés? Would a real extremist and true-believer insist with a straight face that he didn’t really believe all that stuff? Would a real ideologue be persuaded by a public opinion poll to abandon whole ideology?",
                    "bias_type": "Speculation Bias",
                    "bias_strength": 0.9,
                    "bias_description": "These rhetorical questions speculate about Obama's character and motives, leading the reader towards a preconceived notion without concrete evidence."
                },
                {
                    "text": "Actual radicals like Wright and Ayers and Jones defend their beliefs, regardless of the pushback and potential fallout. What Obama did, in contrast, was purely political. Because, despite the insistence by the left that Obama somehow transcends politics, that’s what he is – a politician. Nothing more, nothing less.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This sentence is biased as it presents a subjective opinion about Obama's actions and motivations as objective truths, without considering alternative explanations."
                },
                {
                    "text": "We can also look at the shift in his policy positions over the past few years. He was once quoted as saying that he supported a single-payer health care system. The best political decision now, however, was to abandon that for a more docile public option. Once that failed to garner the groundswell of support his advisers thought it would, he appeared altogether indifferent to it. If he were really a radical, he’d be rallying us around universal health care right now, not some watered-down 1990-page bureaucratic hodge podge that is neither revolutionary nor practical.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This paragraph is biased as it criticizes Obama's policy shifts using subjective language ('docile', 'watered-down bureaucratic hodge podge') and implies a lack of genuine conviction without considering the complexities of policy-making."
                },
                {
                    "text": "His reaction to any kind of opposition – from the right, from the citizenry, from Fox News – is equally telling. If Obama’s agenda were based on conviction instead of political expedience and an unquenchable thirst for popularity, criticism would bounce right off him. Instead he seems frighteningly flappable. That’s because leadership without convictions is leadership of empty rhetoric. Convictions can be defended against criticism. Empty rhetoric cannot.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This sentence is biased as it asserts that Obama's reactions to opposition reveal a lack of conviction and an overreliance on popularity, without considering other factors that may influence a leader's response to criticism."
                },
                {
                    "text": "So why all the radical friends and the radical proposals and the radical rhetoric if he’s not himself a radical? Because his lack of conviction and his inability to forge his own philosophical and theological identity, have made him incredibly susceptible to external influence and pressure. He is easily led. He is, as such, the perfect prospect for someone like Bill Ayers or Reverend Wright, whose radical agendas require vulnerable recruits who are malleable and willing.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This sentence is biased as it speculates about Obama's susceptibility to external influence and his character ('easily led', 'vulnerable recruits who are malleable and willing') without providing evidence for such strong claims."
                },
                {
                    "text": "I don’t know if President Obama is a man of conviction, if he is a man of faith, or if he is the intellectual giant the left really wants him to be. He very well may be all of those things. But I haven’t seen proof of any of it yet, and neither have you, because there hasn’t been any.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This sentence is biased as it challenges the reader to prove Obama's character traits, implying that the absence of public proof equates to the absence of these traits, without acknowledging the limitations of public knowledge about a public figure's personal life."
                },
                {
                    "text": "The only thing we do know for sure, one year after anointing this relative unknown the forty-fourth president of the United States, is that he’s a politician, pure and simple. Calling him a radical gives him way too much credit.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This sentence is biased as it dismisses the possibility of Obama embodying any significant qualities beyond being a 'politician' with a negative connotation, using a dismissive tone and without providing a balanced perspective."
                }
            ],
            "overall_bias": {
                "conclusion": "The article is biased against Barack Obama, discussing his character, beliefs, and political actions with a general bias tendency towards portraying him as lacking in conviction, being easily influenced, and primarily motivated by political expediency rather than genuine principles."
            }
        },
        "Scores": {
            "average_bias_strength": 0.8307692307692309,
            "percentage_of_biased_sentences": 0.5,
            "overall_rating": 0.6653846153846155
        },
        "combined_score": 0.0
    },
    {
        "Title": "FACTBOX-Barack Obama, 44th U.S. president",
        "URL": "FACTBOX-Barack Obama, 44th U.S. president.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    Jan 20 (Reuters) - Barack Obama will be sworn in as the  44th president of the United States at noon on Tuesday.      Here are some biographical facts about the first  African-American to hold the nation's highest office.        Age: 47      Birthdate: Aug. 4, 1961      Birthplace: Honolulu, Hawaii      Education: Columbia University; Harvard Law School      Wife: Michelle Robinson Obama      Children: Daughters Malia, 10, and Sasha, 7      Religious affiliation: United Church of Christ      Party: Democrat        Family: Barack Obama was born to a Kenyan father and a  white American mother. His father, Barack Obama Sr., married  his mother, Ann Dunham, while studying at the University of  Hawaii. The couple separated two years after Obama was born.  His father ultimately returned to Kenya, where he became a  noted economist. He died in a car accident in 1982.      Obama's mother's second marriage was to an Indonesian man  named Lolo Soetoro. The family moved to Indonesia and Obama  remained there until he was 10 when he moved back to Hawaii and  lived with his grandparents while studying on a scholarship at  the elite Punahou Academy.      He has seven half brothers and sisters in Kenya from his  father's other marriages, and a half-sister, Maya Soetoro-Ng,  from his mother's second marriage.        Career: After finishing college in 1983, Obama worked for a  New York financial consultancy and a consumer organization. He  landed a job in Chicago in 1985 as an organizer for Developing  Communities Project, a church-based group seeking to improve  living conditions in poor neighborhoods.      Three years later, Obama left to go to Harvard Law School,  where he became the first black president of the law review. He  worked as a summer associate at the Sidley Austin law firm in  Chicago, where he met his future wife. After graduation from  Harvard in 1991, Obama practiced civil rights law at a small  firm in Chicago, then became a lecturer in constitutional law  at the University of Chicago in 1993.        Elective office: Obama won a seat in the Illinois state  Senate in 1996. During his time in the Legislature, he worked  on welfare and ethics legislation, as well as a measure  requiring electronic recording of police interrogations and  confessions in homicide investigations.      Obama won a heavily contested U.S. Senate seat in 2004,  carrying 53 percent of the Democratic primary vote in an  eight-candidate race. He easily won the general election as  well. In the U.S. Senate he compiled a liberal voting record,  but was one of the few Democrats to back a measure on  class-action lawsuits. He opposed the appointment of Chief  Justice John Roberts and Justice Samuel Alito to the U.S.  Supreme Court.      The nonpartisan National Journal ranked him as the most  liberal member of the U.S. Senate early this year based on his  voting record in 2007. He was ranked 10th most liberal in 2006  and 16th most liberal in 2005.           Presidential campaign: Obama announced his presidential  candidacy on Feb. 10, 2007. Though New York Sen. Hillary  Clinton was initially seen as the front-runner for the  Democratic nomination, Obama quickly showed an ability to raise  large amounts of money and draw record-breaking crowds who were  attracted to his rhetorical skill, his opposition to the Iraq  war, and his promise to move beyond the divisive politics of  the past 40 years.      Obama won the first contest of the Democratic primary in  Iowa in",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 14.252321243286133,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides a factual and neutral overview of Barack Obama's background, career, and presidential campaign without exhibiting any of the typical signs of bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "FACTBOX-Barack Obama, Democratic US President-elect",
        "URL": "FACTBOX-Barack Obama, Democratic US President-elect.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "(Refile to update headline)      Nov 5 (Reuters) - Barack Obama is the U.S. president-elect.  Following are some of his biographical details:        Age: 47      Birthdate: Aug. 4, 1961      Birthplace: Honolulu, Hawaii      Education: Columbia University; Harvard Law School      Wife: Michelle Robinson      Children: Two daughters      Religious affiliation: United Church of Christ        Family: Barack Obama was born in Hawaii to a Kenyan father  and a white American mother. His father, Barack Obama Sr.,  married his mother, Ann Dunham, while studying at the  University of Hawaii. The couple separated two years after  Obama was born. His father ultimately returned to Kenya, where  he became a noted economist. He died in a car accident in 1982.      Obama's mother's second marriage was to an Indonesian man  named Lolo Soetoro. The family moved to Indonesia and Obama  remained there until he was 10 when he moved back to Hawaii and  lived with his grandparents while studying on a scholarship at  the elite Punahou Academy.      He has seven half brothers and sisters in Kenya from his  father's other marriages, and a half-sister, Maya Soetoro-Ng,  from his mother's second marriage.        Career: After finishing college in 1983, Obama worked for a  New York financial consultant and a consumer organization. He  landed a job in Chicago in 1985 as an organizer for Developing  Communities Project, a church-based group seeking to improve  living conditions in poor neighborhoods.      Three years later, Obama left to go to Harvard Law School,  where he became the first black president of the law review. He  worked as a summer associate at the Sidley Austin law firm in  Chicago, where he met his future wife. After graduation from  Harvard in 1991, Obama practiced civil rights law at a small  firm in Chicago, then became a lecturer in constitutional law  at the University of Chicago in 1993.        Elective office: Obama won a seat in the Illinois state  Senate in 1996. During his time in the legislature, he worked  on welfare and ethics legislation, as well as a measure  requiring electronic recording of police interrogations and  confessions in homicide investigations.      Obama won a heavily contested U.S. Senate seat in 2004,  carrying 53 percent of the Democratic primary vote in an  eight-candidate race. He easily won the general election. In  the Senate he compiled a liberal voting record, but was one of  the few Democrats to back a measure on class-action lawsuits.  He opposed the appointment of Chief Justice John Roberts and  Justice Samuel Alito to the U.S. Supreme Court.      The nonpartisan National Journal ranked him as the most  liberal member of the Senate early this year based on his  voting record in 2007. He was ranked 10th most liberal in 2006  and 16th most liberal in 2005.     (Reporting by David Alexander)      (Sources: Reuters, Almanac of American Politics, 'The  Audacity of Hope' by Barack Obama)      ((david.alexander@reuters.com; 202 354-5866;  david.alexander.reuters.com@reuters.net))    Keywords: USA ELECTION/OBAMA        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 14.236103057861328,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides factual information about Barack Obama's background, education, career, and political positions without employing any of the common bias types."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Barack Obama arrives in Baghdad - U.S. embassy",
        "URL": "Barack Obama arrives in Baghdad - U.S. embassy.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    BAGHDAD, July 21 (Reuters) - U.S. Democratic presidential  candidate Barack Obama arrived in Baghdad on Monday on the next  stage of a major overseas trip, the U.S. embassy said.      Obama, who made his only other visit to Iraq in January  2006, has called for the removal of U.S. combat troops from Iraq  within 16 months of taking office should he win the November  election.      He visited Afghanistan over the weekend.    Keywords: IRAQ/OBAMA        ",
        "Histogram": [
            0,
            0,
            0,
            0
        ],
        "Relevance": 14.143680572509766,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it simply reports on Barack Obama's visit to Baghdad and his stance on the removal of U.S. combat troops from Iraq without introducing any subjective or misleading information."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "US Rep. James Clyburn backs Barack Obama",
        "URL": "US Rep. James Clyburn backs Barack Obama.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    WASHINGTON, June 3 (Reuters) - U.S. Rep. James Clyburn of  South Carolina, a Democratic Party superdelegate, backed Barack  Obama on Tuesday for his party's presidential nomination.      Clyburn is a member of the Democratic leadership team in  the U.S. House of Representatives and his backing of Obama  could influence other superdelegates as Democrats wrap up their  primary season.      ((Writing by Doina Chiacu; editing by Donna Smith,  Washington World Desk))  Keywords: USA POLITICS/CLYBURN        ",
        "Histogram": [
            0,
            0,
            0
        ],
        "Relevance": 13.919885635375977,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it simply reports a political endorsement without using language or framing that would indicate a bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Sarah Palin stirs passion in Hollywood",
        "URL": "Sarah Palin stirs passion in Hollywood.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Sue Zeidler      LOS ANGELES, Sept 11 (Reuters) - Sarah Palin represents  many things Hollywood liberals love to hate, from her  opposition to gay marriage to her support for gun rights, yet  she possesses two key qualities they admire -- star appeal and  a great script.      Accordingly, Hollywood Republicans -- often overshadowed by  their left-leaning peers -- are seeking to capitalize on the  celebrity of John McCain's running mate in the Nov. 4 election  to generate support in a town well-known for its lavish  Democratic fund-raisers and events.      'She's certainly got star appeal and is the kind of  candidate that is made for Hollywood. I offered to throw her a  fundraiser myself,' said MGM chief Harry Sloan, one of  Hollywood's most vocal Republicans.      Palin has shaken up the White House race, boosted  enthusiasm among previously apathetic supporters of McCain's  presidential nomination and drawn support from women, rural  voters and Southerners, according to recent polls.      Sloan said there were no plans for a Palin Hollywood  fundraiser yet as her campaign managers were inundated with  similar requests from all over the country after her national  debut at the Republican National Convention on Sept. 3.      A campaign spokesman would not disclose McCain and Palin's  movements beyond one week's time, but various Hollywood  executives said they heard the Arizona senator and Alaska  governor would be swinging through California later this month  or early next month.      Democratic candidates have long enjoyed a fundraising  advantage in Hollywood. Through the end of July, Democratic  presidential nominee Barack Obama raised $5.2 million from the  entertainment industry, compared with McCain's $885,000,  according to the Center for Responsive Politics.      'It's like 10 to 1 here in terms of performing artists who  support Obama versus McCain. There are a significant group of  Republican supporters in Hollywood, but they're just not as  outspoken,' said political analyst Allan Hoffenblum.        PERSONAL STORY      Hollywood is aligning again for Obama on Sept. 16 when  Barbra Streisand will sing at a Beverly Hills event expected to  raise as much as $9 million.      While some Hollywood political watchers see Palin helping  to mobilize greater celebrity support around Obama, they said  filmmakers, producers and other entertainment executives were  fascinated by the personal story of McCain's running mate,  including her 'hockey mom' persona and passion for hunting.      'These people are interested in drama, and Sarah Palin, a  pistol-packing mother of five, is clearly an interesting  character. Politically, they may not agree with Sarah Palin but  they are intrigued,' said Joel Fox, a political analyst.      Long-time Democrat Dan Glickman, chairman of the Motion  Picture Association of America, attended the Republican  National Convention. 'It's important to show our organization  has allies in both camps. Our issues are bi-partisan,' said  Glickman.      'The question is does she become a bigger draw than McCain?  It's too early to draw any conclusions,' he said.      Palin's arrival is encouraging to Hollywood conservatives  like Robert Davi, who stars in director David Zucker's upcoming  'An American Carol,' a spoof about a liberal filmmaker who  wanted to abolish the July 4 Independence Day holiday.      'A lot of times, conservative guys on the set feel  intimidated and unable to speak their view,' said Da",
        "Histogram": [
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0.9,
            0.9,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 13.653653144836426,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Sarah Palin represents  many things Hollywood liberals love to hate, from her  opposition to gay marriage to her support for gun rights, yet  she possesses two key qualities they admire -- star appeal and  a great script.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of phrases like 'love to hate' and 'great script' implies a judgment and suggests a negative connotation towards Hollywood liberals' views on Sarah Palin, influencing the reader's perception."
                },
                {
                    "text": "Accordingly, Hollywood Republicans -- often overshadowed by  their left-leaning peers -- are seeking to capitalize on the  celebrity of John McCain's running mate in the Nov. 4 election  to generate support in a town well-known for its lavish  Democratic fund-raisers and events.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'often overshadowed' and the mention of 'lavish Democratic fund-raisers' compared to the implied lack of such events for Republicans suggest a bias through the choice of words, favoring the portrayal of Republicans as underdogs."
                },
                {
                    "text": "Democratic candidates have long enjoyed a fundraising  advantage in Hollywood. Through the end of July, Democratic  presidential nominee Barack Obama raised $5.2 million from the  entertainment industry, compared with McCain's $885,000,  according to the Center for Responsive Politics.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'enjoyed' and 'advantage' without context or comparison to other industries implies a positive and possibly unfair situation for Democrats, suggesting a bias through the choice of words."
                },
                {
                    "text": "'It's like 10 to 1 here in terms of performing artists who  support Obama versus McCain. There are a significant group of  Republican supporters in Hollywood, but they're just not as  outspoken,' said political analyst Allan Hoffenblum.",
                    "bias_type": "Generalization Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This statement generalizes the level of support for Obama and McCain among performing artists in Hollywood without providing specific data, potentially misleading the reader about the actual ratio and the diversity of opinions."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias through word choice and generalization, particularly in its portrayal of Hollywood's political landscape and the dynamics of support for Sarah Palin and John McCain. The bias tends to favor a narrative of Hollywood liberals' disapproval of Palin and the challenges faced by Hollywood Republicans, with a generalization about the level of support for political figures in the entertainment industry."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6749999999999999,
            "percentage_of_biased_sentences": 0.18181818181818182,
            "overall_rating": 0.42840909090909085
        },
        "combined_score": 0.0
    },
    {
        "Title": "Barack Obama proposes $75 bln stimulus plan",
        "URL": "Barack Obama proposes $75 bln stimulus plan.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    LAS VEGAS, Jan 13 (Reuters) - Amid growing worries about a  worsening of the U.S. economy, Democratic presidential candidate  Barack Obama proposed a $75 billion economic stimulus plan on  Sunday that includes worker tax credits, a one-time pension  supplement and help for homeowners facing foreclosure.      The plan would include an immediate $250 tax credit to workers  that could double if the economy worsens; a one-time $250  supplement to Social Security retirement payments, a $10 billion  fund to help homeowners facing foreclosure, and a $10 billion fund  to bolster states facing budget shortfalls.      The Illinois senator's office unveiled the proposals while  campaigning in Nevada, which holds the next contested Democratic  primary on Saturday. His leading rival, New York Sen. Hillary  Clinton, also recently unveiled an economic stimulus package.   (Editing by Bill Trott)   ((adam.tanner@reuters.com, +1 415-677-2541; Reuters Messaging:  adam.tanner.reuters.com@reuters.net))  Keywords: USA POLITICS/OBAMA        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 13.103318214416504,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides a straightforward report on Barack Obama's proposed $75 billion economic stimulus plan without exhibiting any of the common forms of bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Men vote Barack Obama \"most influential man\"",
        "URL": "Men vote Barack Obama \"most influential man\".txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    LOS ANGELES, Oct 21 (Reuters) - Barack Obama was voted the  most influential man of 2008 in an online poll released on  Tuesday that asked men to decide who most impacted the way they  behave, buy and think.      The U.S. Democratic presidential candidate was ranked No.1  by readers on the AskMen.com lifestyle Web site, beating Apple  chief executive Steve Jobs and Olympic swimming champion  Michael Phelps, who landed in the No. 2 and No. 3 spots,  respectively.      Republican presidential candidate John McCain was ranked  No. 10 on the list, which was compiled on the basis of 200,000  votes from readers of the Web site whose average age is 27-28  years-old.      Last year's winner, British soccer star David Beckham, fell  to No. 25 on the 2008 list, which asked men to go beyond  professional success and likability when picking their top 49  choices.      James Bassil, editor-in-chief of AskMen.com, said he  thought Obama's top place was not so much a political  endorsement of his candidacy as 'a reflection of the interest  the presidential race has ignited in the United States.'      Stephen Colbert, host of the satirical news show 'The  Colbert Report,' was the only other politically-minded name in  the Top 10 of the 2008 list, which was dominated by sports  stars, actors and musicians.          The Top 10 on the AskMen.com Most Influential Men list:      1) Barack Obama (Democratic presidential nominee)      2) Steve Jobs (Apple CEO)      3) Michael Phelps (Olympic swimmer)      4) Robert Downey, Jr (actor)      5) Stephen Colbert (political TV commentator)      6) Gordon Ramsay (celebrity chef)      7) Christian Bale (actor)      8) Rob Kay ('Rock Band' video game designer)      9) Cristiano Ronaldo (soccer player)     10) John McCain (Republican presidential nominee)   (Reporting by Jill Serjeant; Editing by Bob Tourtellotte and  Dean Goodman)   ((jill.serjeant1@thomsonreuters.com; +1 213 955 6749))   (To read more about our entertainment news, visit our blog  'Fan Fare' online at http://blogs.reuters.com/fanfare/)  Keywords: PEOPLE OBAMA       ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 13.071073532104492,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides factual information about an online poll and the rankings of influential men, without displaying any of the typical signs of bias such as subjective opinions, misleading information, or discriminatory language."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Barack Obama escolhe Joseph Biden como candidato a vice",
        "URL": "Barack Obama escolhe Joseph Biden como candidato a vice.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    WASHINGTON, 23 de agosto (Reuters) - O candidato democrata  Ã  PresidÃªncia dos Estados Unidos, Barack Obama, escolheu o  senador por Delaware Joseph Biden para ser seu vice, afirmou o  site da campanha no sÃ¡bado.      O anÃºncio tambÃ©m foi feito atravÃ©s de emails e mensagens de  texto por celular para milhÃµes de partidÃ¡rios. Obama concorre  na eleiÃ§Ã£o de 4 de novembro com o republicano John McCain, que  ainda nÃ£o anunciou o seu vice.      ((TraduÃ§Ã£o RedaÃ§Ã£o SÃ£o Paulo; 5511 5644 7754))      REUTERS CM         ",
        "Histogram": [
            0,
            0,
            0,
            0
        ],
        "Relevance": 12.972037315368652,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides a straightforward report on Barack Obama's choice of Joseph Biden as his vice-presidential candidate without any indication of bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "ATUALIZA-Barack Obama escolhe Joseph Biden como candidato a vice",
        "URL": "ATUALIZA-Barack Obama escolhe Joseph Biden como candidato a vice.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    (Texto atualizado com mais detalhes e declaraÃ§Ãµes)           WASHINGTON, 23 de agosto (Reuters) - O candidato democrata  Ã  PresidÃªncia dos Estados Unidos, Barack Obama, escolheu o  senador por Delaware Joseph Biden para ser seu vice, afirmou o  site da campanha no sÃ¡bado.      Biden, 65, Ã© presidente do ComitÃª de RelaÃ§Ãµes Exteriores do  Senado e Ã© altamente respeitado em questÃµes internacionais.      O anÃºncio tambÃ©m foi feito atravÃ©s de emails e mensagens de  texto por celular para milhÃµes de partidÃ¡rios. Obama concorre  na eleiÃ§Ã£o de 4 de novembro com o republicano John McCain, que  ainda nÃ£o anunciou o seu vice.      'Barack escolheu Joe Biden para ser seu parceiro de chapa',  disse o anÃºncio. 'Joe Biden traz uma grande experiÃªncia em  polÃ­tica externa, um impressionante recorde de colaboraÃ§Ã£o em  todas as linhas do partido e uma atitude direta para fazer o  trabalho'.      Obama e Biden devem aparecer juntos ainda no sÃ¡bado, no Old  State Capitol de Springfield, Illinois. O local Ã© o mesmo onde  Obama lanÃ§ou sua candidatura Ã  Casa Branca no ano passado.      ((TraduÃ§Ã£o RedaÃ§Ã£o SÃ£o Paulo; 5511 5644 7754))      REUTERS CM MM         ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 12.955446243286133,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides a factual report on Barack Obama's selection of Joseph Biden as his vice-presidential candidate, without displaying any evident bias through the language used or the way the information is presented."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "FACTBOX-Five facts about U.S. Democrat Barack Obama",
        "URL": "FACTBOX-Five facts about U.S. Democrat Barack Obama.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    Jan 3 (Reuters) - Barack Obama won the Democratic nominating  contest in Iowa on Thursday, a major step in his bid to beat rival  Hillary Clinton and become their party's presidential pick for the  November general election.      Here are five facts about the Illinois Senator who aims to  become the first black president of the United States:           *Obama's father was born and raised in a village in Kenya; his  mother, who was white, grew up in Kansas.           *Obama grew up in Hawaii and Indonesia. He earned his law  degree from Harvard in 1991 and was the first African-American  president of the Harvard Law Review.           *He is married to wife Michelle and has two young  daughters.           *He was a member of the Illinois State Senate before being  elected to the U.S. Senate. His speech at the Democratic  National Convention in 2004 earned him national attention and  acclaim.           *On issues key to many Democratic voters, Obama favors  withdrawing U.S. troops from Iraq, reducing carbon emissions to  fight climate change, and eliminating tax breaks from companies  that move jobs overseas.            (Writing by Jeff Mason in Washington; editing by Stuart  Grudgings)    ((jeff.mason@reuters.com, +1 202 310 5487, Reuters Messaging:  jeff.mason.reuters.com@reuters.net)       Keywords: USA POLITICS/OBAMA        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 12.86520767211914,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it provides factual information about Barack Obama's background and political positions without using language that implies judgment or promotes a specific narrative."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Barack Obama and Your Life.txt",
        "URL": "Barack Obama and Your Life.txt.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Fox_News_Channel_logo.svg/240px-Fox_News_Channel_logo.svg.png",
        "Text": "Tension is rising between India and Pakistan because it looks like the killers who attacked Mumbai were based inside Pakistani territory. If shooting breaks out between these two countries, the world will have yet another crisis created by Muslim terrorists.\n\nIt is obvious to sane people that the American intelligence agencies must continue to stay ahead of the terror-killers and disrupt plots like Mumbai should they be directed here. To do that, information from captured terror suspects becomes vital.\n\nBut President-elect Obama has committed himself to an undefined no torture policy and is also having some difficulty finding someone to head up the CIA. Former CIA Chief of Staff John Brennan has taken himself out of the running because some far-left loons criticized him for taking an aggressive anti-terror stance after 9/11.\n\nThis is very disturbing. The far-left wants the CIA to go by the Army Field Manual when interrogating suspects. If that happens, all of us will be in danger.\n\nWhy? Well, here's what the manual says: \"Prisoners of war who refuse to answer (questions) may not be threatened, insulted, or exposed to unpleasant or disadvantageous treatment of any kind.\"\n\nNow — and this is important — that is fine for the military. It is not their job to break down terror suspects. It's their job to kill or capture them on the battlefield. The CIA should interrogate high-value targets.\n\nBut if Obama orders the CIA and other U.S. intelligence agencies not to employ any tough interrogation methods, trust me, many people will die. The terrorists are not going to stop, and only very aggressive action against them has kept us safe since 9/11.\n\nBut these far-left loons, these despicable people who blame America for worldwide terrorism, now have far more power in this country than they did just one month ago.\n\nI believe Barack Obama understands the danger the Muslim terrorists pose to the world. I believe Mr. Obama will not destroy the CIA's ability to break down terror suspects. He has to know that hardcore terrorists are not going to give up information easily.\n\nBut still some people don't get it, and these people are foolish and dangerous, so crazed by their far-left ideology they'd allow innocent people to die for it.\n\nThe USA should never torture, but coerced interrogation at the direction of the president is vital when lives are on the line. Of course, the loons will never acknowledge that. They don't want to do anything \"unpleasant\" to terror suspects.\n\nAnd that's \"The Memo.\"\n\nPinheads & Patriots\n\nAs you may know, actor Patrick Swayze is waging a valiant fight against pancreatic cancer. The 56-year-old actor is working on a new TV show and generally fighting the good fight.\n\nBut a number of tabloids continue to sound the death knell for him, and Mr. Swayze would like them to knock it off. We hope they do, because the man is brave and a patriot.\n\nOn the pinhead front, you make the call on this one. At the opening of a new visitors' center at the Capitol, Senate Majority Leader Harry Reid said this:\n\n(BEGIN VIDEO CLIP)\n\nSENATE MAJORITY LEADER HARRY REID, D-NEV.: My staff has always said, \"Don't say this,\" but I'm going to say it again, because it's so descriptive, because it's true.\n\nLeader Boehner mentioned that tourists lined up in the summer and winter, long lines coming into the Capitol. In the summertime, because of the high humidity and how hot it gets here, you could literally smell the tourists coming into the Capitol.\n\n(END VIDEO CLIP)\n\nNo matter how bad the folks smell, it doesn't compete with some of the stuff going on in the Senate.\n\nPinhead? You make the call.\n\n— You can catch Bill O'Reilly's \"Talking Points Memo\" and \"Pinheads & Patriots\" weeknights at 8 and 11 p.m. ET on the FOX News Channel and any time on foxnews.com/oreilly. Send your comments to: oreilly@foxnews.com",
        "Histogram": [
            0,
            0.6,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0.7,
            0.7,
            0.9,
            0.6,
            0.6,
            0.6,
            0.9,
            0.6,
            0.6,
            0.6,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0,
            0,
            0.6,
            0,
            0
        ],
        "Relevance": 12.3921537399292,
        "BiasReport": {
            "sentences": [
                {
                    "text": "If shooting breaks out between these two countries, the world will have yet another crisis created by Muslim terrorists.",
                    "bias_type": "Discriminatory Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence unfairly attributes the potential conflict between India and Pakistan to 'Muslim terrorists,' which is a broad and prejudiced statement that reinforces discrimination based on religious beliefs."
                },
                {
                    "text": "But President-elect Obama has committed himself to an undefined no torture policy and is also having some difficulty finding someone to head up the CIA. Former CIA Chief of Staff John Brennan has taken himself out of the running because some far-left loons criticized him for taking an aggressive anti-terror stance after 9/11.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the term 'far-left loons' to describe critics of anti-terror policies is a clear example of word choice bias, employing derogatory language to discredit opposing viewpoints."
                },
                {
                    "text": "This is very disturbing. The far-left wants the CIA to go by the Army Field Manual when interrogating suspects. If that happens, all of us will be in danger.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The sentence uses provocative language to evoke fear, suggesting that adhering to the Army Field Manual for interrogations would endanger everyone, which is an exaggerated and sensational claim."
                },
                {
                    "text": "But if Obama orders the CIA and other U.S. intelligence agencies not to employ any tough interrogation methods, trust me, many people will die. The terrorists are not going to stop, and only very aggressive action against them has kept us safe since 9/11.",
                    "bias_type": "Causal Misunderstanding Bias",
                    "bias_strength": 0.7,
                    "bias_description": "This sentence assumes a direct cause-and-effect relationship between the use of 'tough interrogation methods' and safety, without considering other factors or evidence, thus demonstrating a misunderstanding of the complex issue."
                },
                {
                    "text": "But these far-left loons, these despicable people who blame America for worldwide terrorism, now have far more power in this country than they did just one month ago.",
                    "bias_type": "Ad Hominem Bias",
                    "bias_strength": 0.9,
                    "bias_description": "The use of derogatory terms like 'far-left loons' and 'despicable people' to describe political opponents is a clear example of ad hominem bias, attacking the character of the opposition rather than addressing their arguments."
                },
                {
                    "text": "I believe Barack Obama understands the danger the Muslim terrorists pose to the world. I believe Mr. Obama will not destroy the CIA's ability to break down terror suspects. He has to know that hardcore terrorists are not going to give up information easily.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This statement presents the author's beliefs about Barack Obama's understanding and intentions as if they were objective facts, blurring the line between personal opinion and objective reporting."
                },
                {
                    "text": "But still some people don't get it, and these people are foolish and dangerous, so crazed by their far-left ideology they'd allow innocent people to die for it.",
                    "bias_type": "Ad Hominem Bias",
                    "bias_strength": 0.9,
                    "bias_description": "Again, the use of derogatory language such as 'foolish and dangerous' and 'crazed by their far-left ideology' to describe those with differing viewpoints is a clear instance of ad hominem bias, attacking the character of the opposition rather than engaging with their arguments."
                },
                {
                    "text": "The USA should never torture, but coerced interrogation at the direction of the president is vital when lives are on the line. Of course, the loons will never acknowledge that. They don't want to do anything 'unpleasant' to terror suspects.",
                    "bias_type": "Ad Hominem Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Once more, the use of the term 'the loons' to dismiss those who oppose coercive interrogation methods as irrational or extreme is a form of ad hominem bias, undermining the opposition's position through derogatory language."
                },
                {
                    "text": "Pinheads & Patriots",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the term 'Pinheads' to derogatorily label individuals or groups with opposing viewpoints is an example of word choice bias, employing negative connotations to dismiss or discredit the opposition."
                },
                {
                    "text": "No matter how bad the folks smell, it doesn't compete with some of the stuff going on in the Senate.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence uses a derogatory analogy to imply that the Senate's actions are worse than the smell of tourists, employing negative connotations to criticize the Senate's conduct."
                }
            ],
            "overall_bias": {
                "conclusion": "The article is biased regarding the topics of anti-terror policies, the CIA's interrogation methods, and political ideologies, with a general bias tendency towards discrediting opposing viewpoints through the use of derogatory language, emotional sensationalism, and the presentation of personal opinions as objective facts."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6699999999999999,
            "percentage_of_biased_sentences": 0.225,
            "overall_rating": 0.44749999999999995
        },
        "combined_score": 0.0
    },
    {
        "Title": "NEWSMAKER-Barack Obama: Campaigning with a message of hope",
        "URL": "NEWSMAKER-Barack Obama: Campaigning with a message of hope.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Caren Bohan      EVANSVILLE, Ind., April 23 (Reuters) - Barack Obama's rapid  rise from relative obscurity toward winning the Democratic  Party nomination for U.S. president hit another bump when he  lost to rival Hillary Clinton in Pennsylvania.      Obama's defeat on Tuesday in the state's nominating contest  slowed his momentum, but he still holds the lead in delegates  who will decide the party's nominee to run against Republican  John McCain in the November presidential election.      Just four years after he burst onto the national political  scene with a keynote speech at the Democratic Party convention,  the questions for those deciding whether to support Obama have  been mostly about his relative inexperience.      Is the 46-year-old first-term senator who would be the  first black U.S. president just a 'phenomenon' desired by a  war-weary nation eager for a fresh face or does he have what it  takes to be an effective president?      Obama cast his scant time on the national political scene  as an advantage, saying it meant his hope and ideals had not  been compromised. His rousing oratory and can-do message struck  a chord early with the public, drawing large crowds and  enthusing young voters.      Doubts over whether voters were 'ready' for a black  president diminished as he steadily chipped away at Clinton's  large early lead and eventually moved past her in the long  run-up to the presidential election.      Once the race was down to two Democratic candidates, there  was little to distinguish them on policy issues.           MULTICULTURAL AMERICA      Obama often points to his roots -- his father was Kenyan  and his mother a white woman from Kansas -- as one reason he  should be picked to run the country, saying he is   representative of multicultural America.      One of his favorite lines --- 'When you're a black guy  named Barack Obama and you're running for president you've got  to have hope' -- regularly draws laughs.      But it is clear Obama has also asked serious questions  about his heritage.      A two-time bestselling author who also won two Grammy  awards for the audio version of his books, Obama chronicled his  struggles to understand himself and his race in 1995 in 'Dreams  from My Father: A Story of Race and Inheritance.'      He followed up the memoir in 2006 with 'The Audacity of  Hope: Thoughts on Reclaiming the American Dream' outlining his  political principles.      While attracting wide support among African Americans,  Obama eschewed the rhetoric of race struggle and structured his  campaign to appeal to all races.      He has also described himself as a 'blank screen' on which  people of all different political leanings can project their  own views.        CLOSER SCRUTINY      As he moved ahead in the polls and the race for delegates  who pick the party nominee, Democratic and Republican opponents  took a closer look at his record and associates.      Video of Jeremiah Wright, his black pastor at the Trinity  United Church of Christ in Chicago, giving racially and  politically charged sermons, including saying U.S. policies  were partially responsible for Sept. 11 attacks, surfaced on  the Internet in March.      Obama, who borrowed the words 'audacity of hope' from  Wright, was forced to disavow his pastor and ended up giving a  much-praised speech on race in America.      Suddenly, every word and action was under a microscope.  Comments to a closed-door fund-raiser earlier this month sayi",
        "Histogram": [
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0.6,
            0.6
        ],
        "Relevance": 12.324787139892578,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Obama's defeat on Tuesday in the state's nominating contest slowed his momentum, but he still holds the lead in delegates who will decide the party's nominee to run against Republican John McCain in the November presidential election.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the phrase 'slowed his momentum' implies a negative connotation and suggests a judgment about the impact of the defeat, influencing the reader's perception."
                },
                {
                    "text": "Just four years after he burst onto the national political scene with a keynote speech at the Democratic Party convention, the questions for those deciding whether to support Obama have been mostly about his relative inexperience.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Describing Obama as having 'burst onto the national political scene' and highlighting 'relative inexperience' introduces a judgment about the rapidity of his rise and his qualifications, suggesting a bias through the choice of words."
                },
                {
                    "text": "Is the 46-year-old first-term senator who would be the first black U.S. president just a 'phenomenon' desired by a war-weary nation eager for a fresh face or does he have what it takes to be an effective president?",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The framing of Obama as potentially just a 'phenomenon' desired for superficial reasons rather than a capable leader introduces a bias through the use of questioning that implies a negative judgment."
                },
                {
                    "text": "Obama cast his scant time on the national political scene as an advantage, saying it meant his hope and ideals had not been compromised. His rousing oratory and can-do message struck a chord early with the public, drawing large crowds and enthusing young voters.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The description of Obama's 'rousing oratory' and 'can-do message' as advantageous and striking a chord with the public presents a subjective opinion as fact, blurring the line between objective reporting and personal perspective."
                },
                {
                    "text": "Doubts over whether voters were 'ready' for a black president diminished as he steadily chipped away at Clinton's large early lead and eventually moved past her in the long run-up to the presidential election.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'chipped away' and 'long run-up' to describe Obama's path to surpassing Clinton introduces a bias by framing his success in a way that downplays his achievements and suggests a struggle against skepticism."
                },
                {
                    "text": "Obama often points to his roots -- his father was Kenyan and his mother a white woman from Kansas -- as one reason he should be picked to run the country, saying he is representative of multicultural America.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The emphasis on Obama 'pointing to his roots' and the framing of his argument for being 'representative of multicultural America' introduces a bias by suggesting a superficial or manipulative aspect to his identity and candidacy."
                },
                {
                    "text": "One of his favorite lines --- 'When you're a black guy named Barack Obama and you're running for president you've got to have hope' -- regularly draws laughs.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The focus on the line about 'hope' drawing laughs introduces a bias by framing Obama's use of humor in addressing his identity as a trivial or calculated appeal, rather than a genuine and meaningful expression."
                },
                {
                    "text": "But it is clear Obama has also asked serious questions about his heritage.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The assertion that 'it is clear' Obama has asked 'serious questions' about his heritage introduces a bias by implying that such introspection is necessary or expected, and by extension, that failure to do so would be a negative attribute."
                },
                {
                    "text": "While attracting wide support among African Americans, Obama eschewed the rhetoric of race struggle and structured his campaign to appeal to all races.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'eschewed' to describe Obama's approach to race-related rhetoric introduces a bias by suggesting a deliberate rejection of legitimate concerns or issues within the African American community, framing his strategy in a way that downplays the complexity of racial dynamics."
                },
                {
                    "text": "He has also described himself as a 'blank screen' on which people of all different political leanings can project their own views.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Describing himself as a 'blank screen' introduces a bias by framing Obama's self-description in a way that implies a lack of substance or authenticity, suggesting that his appeal is based on a lack of clear principles rather than a broad appeal."
                },
                {
                    "text": "As he moved ahead in the polls and the race for delegates who pick the party nominee, Democratic and Republican opponents took a closer look at his record and associates.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'took a closer look' suggests a neutral or positive action, but in the context of political opposition, it introduces a bias by implying a thorough and fair examination rather than a potentially biased or malicious scrutiny."
                },
                {
                    "text": "Suddenly, every word and action was under a microscope. Comments to a closed-door fund-raiser earlier this month sayi",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'under a microscope' to describe the scrutiny of Obama's comments introduces a bias by framing the examination as excessive or unfair, suggesting that his actions or statements were unfairly magnified or distorted."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding Barack Obama's candidacy, particularly in the way his personal attributes, campaign strategies, and responses to challenges are framed. The biases are primarily manifested through the choice of words, which imply judgments, skepticism, and a lack of substance in Obama's candidacy, rather than presenting a balanced or neutral perspective."
            }
        },
        "Scores": {
            "average_bias_strength": 0.5999999999999999,
            "percentage_of_biased_sentences": 0.15,
            "overall_rating": 0.37499999999999994
        },
        "combined_score": 0.0
    },
    {
        "Title": "Is Hollywood Blacklisting Supporters of Gay Marriage Ban_.txt",
        "URL": "Is Hollywood Blacklisting Supporters of Gay Marriage Ban_.txt.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Fox_News_Channel_logo.svg/240px-Fox_News_Channel_logo.svg.png",
        "Text": "This is a rush transcript from \"The O'Reilly Factor,\" November 24, 2008. This copy may not be in its final form and may be updated.\n\nWatch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET and listen to the \"Radio Factor!\"\n\nLAURA INGRAHAM, GUEST HOST: In the \"Personal Story\" segment tonight: According to a report in the L.A. Times, some gay rights supporters in Hollywood may be starting a blacklist against people who supported traditional marriage by giving money to Prop 8 advocates.\n\nJoining us now from Los Angeles is Andrew Breitbart, publisher of Breitbart.com, and one of a handful of conservatives who are brave enough to speak out in Hollywood. Andrew, great to see you.\n\nClick here to watch the segment.\n\nANDREW BREITBART, BREITBART.COM: Hey, Laura. How are you?\n\nINGRAHAM: I remember when George Clooney was telling us that, you know, the biggest threat to mankind, you know, a few decades back was the blacklisting in Hollywood of people who dared to question authority. And so is this actually happening now on the other side of the political fence?\n\nBREITBART: Well, this is a more conspicuous form of blacklisting. It happens for conservatives every single day in Hollywood. This FEC search mechanism is a way that the left, the activist left, not specifically gay groups, because there are a lot of gay people who are against gay marriage. There are a lot of people who think that it should be up for debate.\n\nBut this is the same group of people back in the 1980s, Michelangelo Signorile, who started OutWeek magazine, who started to out people who were actually gay who didn't agree with the activist left agenda for the gay community. So what's happening right now is those schoolyard bullies are back, playing a bigger game on a bigger playground.\n\nINGRAHAM: Right.\n\nBREITBART: Yes.\n\nINGRAHAM: What are they actually doing? What's being done to people who have given to Prop 8? Because I know the San Francisco Chronicle is allowing people who go to their Web site to find out who gave to what Prop 8 groups.\n\nBREITBART: It's there. That's exactly what they are doing. Scott Eckern, who is the musical — the director of the California Musical Theater, had his name initially exposed, and he had to step down. To me that's an effective blacklist.\n\nEl Coyote restaurant in Los Angeles, the floor manager, not the owner but the floor manager, gave $100. And people started to protest El Coyote restaurant. So it's not just about blacklisting. It's blacklisting entire institutions if somebody is associated with it.\n\nMy father-in-law, who was blacklisted in the 1950s for being a communist, is a Christian now, believes in the sanctity of marriage, of the definition between a man and a woman, and they are protesting his theater in Venice, California.\n\nINGRAHAM: So right now there clearly is no real free speech in Hollywood. There's no political free speech. If major Hollywood executives don't speak out against this intimidation, they have no credibility. I don't want to see another movie about the blacklist of the 1940s and '50s. I don't want to see it again coming out of Hollywood. They have no credibility with me. None.\n\nBREITBART: Well, what's so important about this issue right now is that George Clooney is silent, and secondly, President-elect Barack Obama is against gay marriage. Joe Biden, Vice President-elect Joe Biden is against gay marriage. So were Bill and Hillary Clinton when they implemented don't ask, don't tell and the Defense of Marriage Act.\n\nWhat they have done specifically is isolate conservative groups, the Mormon Church, which is safe. I asked Michelangelo Signorile to go down to a local mosque with a group of angry activist left people and to protest the Islamic position on gay marriage. He won't do that.\n\nINGRAHAM: Yes.\n\nBREITBART: And he won't go after President-elect Barack Obama. President-elect Barack Obama has an aggressive attitude towards gay rights in this country, and they allow for him to get away with it.\n\nINGRAHAM: Well, Andrew, that is such a great point about the mosque. I mean, that would show true courage, OK? Go after the black churches and the mosques, and we'll see whether they're actually going to put their money where their mouths are.\n\nAndrew, thanks a lot.\n\nContent and Programming Copyright 2008 FOX News Network, LLC. ALL RIGHTS RESERVED. Transcription Copyright 2008 ASC LLC (www.ascllc.net), which takes sole responsibility for the accuracy of the transcription. ALL RIGHTS RESERVED. No license is granted to the user of this material except for the user's personal or internal use and, in such case, only one copy may be printed, nor shall user use any material for commercial purposes or in any fashion that may infringe upon FOX News Network, LLC'S and ASC LLC's copyrights or other proprietary rights or interests in the material. This is not a legal transcript for purposes of litigation.",
        "Histogram": [
            0,
            0,
            0,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.9,
            0.9,
            0.9,
            0.9,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 12.073670387268066,
        "BiasReport": {
            "sentences": [
                {
                    "text": "According to a report in the L.A. Times, some gay rights supporters in Hollywood may be starting a blacklist against people who supported traditional marriage by giving money to Prop 8 advocates.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the term 'blacklist' carries a negative connotation and implies a judgment about the actions of the gay rights supporters, suggesting a punitive and unjust practice."
                },
                {
                    "text": "Well, this is a more conspicuous form of blacklisting. It happens for conservatives every single day in Hollywood.",
                    "bias_type": "Exaggeration Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The statement exaggerates the prevalence and severity of blacklisting in Hollywood, implying a widespread and constant practice without providing evidence."
                },
                {
                    "text": "This FEC search mechanism is a way that the left, the activist left, not specifically gay groups, because there are a lot of gay people who are against gay marriage. There are a lot of people who think that it should be up for debate.",
                    "bias_type": "Generalization Bias",
                    "bias_strength": 0.9,
                    "bias_description": "The generalization that 'the left, the activist left' uses the FEC search mechanism to target individuals broadly implies a uniform and coordinated effort within a diverse political and social movement."
                },
                {
                    "text": "But this is the same group of people back in the 1980s, Michelangelo Signorile, who started OutWeek magazine, who started to out people who were actually gay who didn't agree with the activist left agenda for the gay community. So what's happening right now is those schoolyard bullies are back, playing a bigger game on a bigger playground.",
                    "bias_type": "Ad Hominem Bias",
                    "bias_strength": 0.9,
                    "bias_description": "Comparing the current actions of some individuals to 'schoolyard bullies' from the 1980s and attributing motives of personal attack and intimidation without a direct comparison or evidence is a clear ad hominem argument."
                },
                {
                    "text": "It's there. That's exactly what they are doing. Scott Eckern, who is the musical — the director of the California Musical Theater, had his name initially exposed, and he had to step down. To me that's an effective blacklist.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of phrases like 'That's exactly what they are doing' and 'To me that's an effective blacklist' is designed to evoke a strong emotional response, emphasizing the perceived severity of the situation."
                },
                {
                    "text": "So right now there clearly is no real free speech in Hollywood. There's no political free speech. If major Hollywood executives don't speak out against this intimidation, they have no credibility.",
                    "bias_type": "Exaggeration Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The absolute statement that 'there clearly is no real free speech in Hollywood' and the call for major Hollywood executives to speak out against 'intimidation' without specifying the nature or extent of such actions exaggerates the situation."
                },
                {
                    "text": "Well, what's so important about this issue right now is that George Clooney is silent, and secondly, President-elect Barack Obama is against gay marriage. Joe Biden, Vice President-elect Joe Biden is against gay marriage. So were Bill and Hillary Clinton when they implemented don't ask, don't tell and the Defense of Marriage Act.",
                    "bias_type": "Whataboutism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The mention of prominent figures' positions on gay marriage, particularly in the context of their silence or past actions, serves to deflect from the main issue by raising different, albeit related, concerns."
                },
                {
                    "text": "What they have done specifically is isolate conservative groups, the Mormon Church, which is safe. I asked Michelangelo Signorile to go down to a local mosque with a group of angry activist left people and to protest the Islamic position on gay marriage. He won't do that.",
                    "bias_type": "Speculation Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The assertion that conservative groups, including the Mormon Church, are 'safe' from criticism, and the hypothetical scenario proposed to Michelangelo Signorile, are speculative and not based on demonstrated actions or statements."
                }
            ],
            "overall_bias": {
                "conclusion": "The article is biased regarding the issue of gay rights and the response to Prop 8 in Hollywood, demonstrating a general bias tendency through the use of word choice, exaggeration, generalization, ad hominem attacks, emotional sensationalism, whataboutism, and speculation."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6749999999999999,
            "percentage_of_biased_sentences": 0.22413793103448276,
            "overall_rating": 0.44956896551724135
        },
        "combined_score": 0.0
    },
    {
        "Title": "COLUMN-Barack Obama and the Ku Klux Klan:Bernd Debusmann",
        "URL": "COLUMN-Barack Obama and the Ku Klux Klan:Bernd Debusmann.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "  - Bernd Debusmann is a Reuters columnist. The opinions  expressed are his own -      By Bernd Debusmann      WASHINGTON, June 18 (Reuters) - Barack Obama has won the  endorsement of the Ku Klux Klan in his bid to become the first  black president of the United States. His campaign is financed  by Hugo Chavez, the vocally anti-American leader of Venezuela.  Obama is a Muslim. And possibly, he is the anti-Christ.      So say e-mails circulating on the Internet, whose  importance as a marketplace for the exchange of unverified  information, sometimes outlandish ideas and often toxic rumors  has exploded over the last decade. It is now playing a key role  in American politics. According to a new study, almost half of  all Americans use the Internet to follow the presidential  election campaign.      Now Obama, who already made political history by becoming  the first black American to win the Democratic party's  presidential nomination, is making Internet history with a Web  site specifically set up to counter rumors about him and his  wife Michelle. It is a break with the conventional wisdom that  it is counter-productive to respond to rumor and innuendo in  the parallel world of cyberspace. Doing so, the thinking goes,  gives a rumor an air of legitimacy.      The novel Web site, fightthesmears.com, does not deal with  each and every online 'discovery' about Obama. A Ku Klux Klan  endorsement, Chavez financing, and anti-Christ suspicions are  too bizarre to rate a mention.  E-mails on these subjects were  collated by snopes.com, a Web site that features the '25  Hottest Urban Legends, currently circulating most widely.'  Obama e-mails rank No. 2 on the latest list, after e-mails on a  computer virus embedded in greeting cards.      To satisfy the curious: the Ku Klux Klan story originated  as a spoof in the satirical British publication Daily Squib and  gained currency because, as snopes.com put it, 'effective  satire hews closely to what people are inclined to believe.'   Well ... perhaps people on the lunatic fringe. The spoof quoted  a clan leader as saying that 'anything is better than Hillary  Clinton,' the New York senator who lost the primaries to  Obama.      Obama's counter-rumor Web site addresses one of the most  widely circulated, and most widely believed, assertions about  the candidate: that he is Muslim, attended a radical madrassa  (Islamic religious school) and was sworn into the U.S. Senate  using the Koran. The Obama-is-a-Muslim theme has been so  persistent that 10 percent of American voters are convinced he  is, according to a poll in March by the Pew Research Center        WIFE IS TARGET      The rumor that prompted Obama to set up the site last week  involved his wife Michelle. Right-wing bloggers spoke of the  existence of a videotape that showed her making an angry speech  featuring the word 'whitey,' a derogatory term for white  people.  'No such tape exists,' says the anti-rumor site,  'Michelle has not used that word.'      To disprove the notion that Obama was born outside the  United States and therefore ineligible to be president, the Web  site features a facsimile of his birth certificate, issued by  the Department of Health in Honolulu and dated August 8, 1961.  (Hawaii became a state in 1959).      The Internet, being an equal opportunity debating forum,  was alive with arguments earlier in the year over the  eligibility to the highest office in the land of John McCain,  Obama's Republican rival who was",
        "Histogram": [
            0,
            0,
            0.9,
            0.9,
            0.9,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 11.726774215698242,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Barack Obama has won the endorsement of the Ku Klux Klan in his bid to become the first black president of the United States. His campaign is financed by Hugo Chavez, the vocally anti-American leader of Venezuela. Obama is a Muslim. And possibly, he is the anti-Christ.",
                    "bias_type": "Unsubstantiated Claims Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This sentence presents multiple unsubstantiated claims about Barack Obama, including his religious affiliation and the endorsement of controversial figures, without providing any evidence, thus misleading the reader."
                },
                {
                    "text": "The novel Web site, fightthesmears.com, does not deal with each and every online 'discovery' about Obama. A Ku Klux Klan endorsement, Chavez financing, and anti-Christ suspicions are too bizarre to rate a mention.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the word 'bizarre' to describe the Ku Klux Klan endorsement, Chavez financing, and anti-Christ suspicions implies a judgment and dismisses these claims without a thorough examination, influencing the reader's perception."
                }
            ],
            "overall_bias": {
                "conclusion": "The article is biased regarding Barack Obama, as it presents unsubstantiated claims and uses dismissive language to address controversial topics, indicating a general bias tendency against Obama."
            }
        },
        "Scores": {
            "average_bias_strength": 0.75,
            "percentage_of_biased_sentences": 0.19230769230769232,
            "overall_rating": 0.47115384615384615
        },
        "combined_score": 0.0
    },
    {
        "Title": "UPDATE 1-Barack Obama proposes $75 billion stimulus plan",
        "URL": "UPDATE 1-Barack Obama proposes $75 billion stimulus plan.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": " (Adds details, quote)      LAS VEGAS, Jan 13 (Reuters) - Amid growing worries about a  worsening of the U.S. economy, Democratic presidential  candidate Barack Obama proposed a $75 billion economic stimulus  plan on Sunday that includes worker tax credits, a one-time  pension supplement and help to homeowners facing foreclosure.      The plan would include an immediate $250 tax credit to  workers that could double if the economy worsens, a one-time  $250 supplement to Social Security payments, a $10 billion fund  to help homeowners facing foreclosure and a $10 billion fund to  bolster states facing budget shortfalls amid lower tax  revenues.      'We need that middle-class tax cut now more than ever --  not five months from now or five weeks from now, but now,'  Obama said in a statement. 'I'm announcing a plan to jump-start  the economy by putting money in the pockets of those who need  it most and will spend it quickly.'      The Illinois senator's office unveiled the proposals at the  start of a day of campaigning in Nevada, which holds the next  contested Democratic primary on Saturday.      His leading rival, New York Sen. Hillary Clinton, on Friday  unveiled an economic stimulus package she said would be worth  $70 billion. Her plan placed more of an emphasis on helping  families unable to make mortgage payments -- a major issue in  Nevada where 'for sale' signs are common on homes across Las  Vegas, its major city.      The plan also includes a $10 billion extension of  unemployment insurance to help those who have been unable to  find a job for more than half a year.      Last year, the senator proposed tax credits of up to $500  for 150 million workers. His revised economic plan calls for  $250 of that to come in an immediate credit, and the rest as  soon as three months later if the nation's unemployment rate  worsens.   (Editing by David Wiessler)   ((adam.tanner@reuters.com, +1 415-677-2541; Reuters Messaging:  adam.tanner.reuters.com@reuters.net))       Keywords: USA POLITICS/OBAMA        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 11.621092796325684,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it primarily reports on the economic stimulus plans proposed by Democratic presidential candidates Barack Obama and Hillary Clinton without employing language or framing that indicates a bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "IRAQ WRAPUP 5-Barack Obama meets PM Maliki in Baghdad",
        "URL": "IRAQ WRAPUP 5-Barack Obama meets PM Maliki in Baghdad.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    * Obama meets Prime Minister Maliki      * Wants U.S. combat troops out in 16 months if wins election      * Maliki has suggested setting withdrawal timetable            By Dean Yates and Wisam Mohammed      BAGHDAD, July 21 (Reuters) - U.S. Democratic presidential  candidate Barack Obama met Iraq's prime minister on Monday to  get a first-hand assessment of security in the country, where  violence is at its lowest level since early 2004.      His visit thrusts U.S. strategy in Iraq and troop levels to  the centre of the November election race between the first-term  senator from Illinois and Republican candidate John McCain.  There are more than 140,000 U.S. soldiers in Iraq.      Obama has called for the removal of U.S. combat troops  within 16 months of taking office should he win the election.      Iraqiya state television and witnesses said Obama met Prime  Minister Nuri al-Maliki in Baghdad. There were no further  details on Obama's visit, which has been shrouded in secrecy for  security reasons.      Obama visited Afghanistan over the weekend, the other big  foreign policy challenge the next American president will face.  He called the situation in Afghanistan 'precarious and urgent'  and said Washington should start planning to transfer more  troops there from Iraq.      Maliki suggested earlier this month setting a timetable for  U.S. troops to leave Iraq but has given no dates.      Obama has welcomed Maliki's suggestion but some Iraqis  insist that the army and police cannot go it alone and that a  premature withdrawal of U.S. troops could open the door to the  sort of violence that nearly tore Iraq apart not so long ago.      On Sunday the Iraqi government denied Maliki told a German  magazine in an interview that he backed Obama's plan to withdraw  combat troops within 16 months. The government said Maliki's  remarks to Der Spiegel were translated incorrectly.       McCain has attacked Obama for not visiting Iraq recently to  get a first-hand look at conditions.      The Republican candidate has been to Iraq eight times while  Obama's only other trip was in January 2006, a month before  militants blew up a revered Shi'ite shrine in Samarra in an  attack that plunged Iraq into vicious sectarian fighting.      The U.S. embassy said Obama, who is visiting Iraq as part of  a U.S. congressional delegation, would also meet U.S. military  commanders and American troops.      Commanders are likely to tell Obama that security gains are  fragile and could be jeopardised by a hasty troop withdrawal.      Obama, trying to boost his foreign policy credentials, will  travel to other countries in the Middle East and visit major  powers in Europe this week.      He has scheduled no news conferences in Iraq.            OBAMA SAYS WANTS TO END THE WAR      Obama courted controversy on July 3 when he said he might  'refine' his views on withdrawing combat troops from Iraq within  16 months but later said his stance had been unchanged for more  than a year and that he intended 'to end this war'.      McCain says the U.S. troop buildup last year helped boost  stability in Iraq and has criticised the Democrat's vow to order  a quick withdrawal as 'reckless'.      But the dramatic reduction in violence has led Baghdad to  become increasingly assertive about its own security  capabilities.      Indeed, Maliki and President George W. Bush agreed last week  to set a 'time horizon' for reducing American forces in Iraq.      It was the closest the",
        "Histogram": [
            0,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0.6,
            0.6,
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 11.611815452575684,
        "BiasReport": {
            "sentences": [
                {
                    "text": "His visit thrusts U.S. strategy in Iraq and troop levels to the centre of the November election race between the first-term senator from Illinois and Republican candidate John McCain. There are more than 140,000 U.S. soldiers in Iraq.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'thrusts U.S. strategy' implies a sudden and forceful action, suggesting a judgment that this visit significantly impacts the election race, which could influence the reader's perception."
                },
                {
                    "text": "Obama has called for the removal of U.S. combat troops within 16 months of taking office should he win the election.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'called for' implies a request or demand, which could subtly suggest to the reader that this is an extreme or challenging position, potentially influencing their perception of the feasibility or reasonableness of the proposal."
                },
                {
                    "text": "Obama visited Afghanistan over the weekend, the other big foreign policy challenge the next American president will face. He called the situation in Afghanistan 'precarious and urgent' and said Washington should start planning to transfer more troops there from Iraq.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Describing Afghanistan as 'the other big foreign policy challenge' and the situation as 'precarious and urgent' uses language that emphasizes the severity and importance of the issue, potentially leading the reader to prioritize it over other matters."
                },
                {
                    "text": "Obama has welcomed Maliki's suggestion but some Iraqis insist that the army and police cannot go it alone and that a premature withdrawal of U.S. troops could open the door to the sort of violence that nearly tore Iraq apart not so long ago.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence presents the opinion that a premature withdrawal of U.S. troops could lead to significant violence as a fact, without providing evidence or acknowledging alternative viewpoints, thus blurring the line between opinion and objective reporting."
                },
                {
                    "text": "On Sunday the Iraqi government denied Maliki told a German magazine in an interview that he backed Obama's plan to withdraw combat troops within 16 months. The government said Maliki's remarks to Der Spiegel were translated incorrectly.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'denied' and the detailed explanation of the translation issue could imply to the reader that there is a deliberate attempt to undermine or distort Maliki's position, potentially casting doubt on the integrity of the information."
                },
                {
                    "text": "McCain has attacked Obama for not visiting Iraq recently to get a first-hand look at conditions. The Republican candidate has been to Iraq eight times while Obama's only other trip was in January 2006, a month before militants blew up a revered Shi'ite shrine in Samarra in an attack that plunged Iraq into vicious sectarian fighting.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The framing of McCain's criticism and the detailed comparison of his and Obama's visits to Iraq could subtly suggest to the reader that Obama's understanding of the situation in Iraq is lacking or inferior, potentially influencing their perception of his qualifications."
                },
                {
                    "text": "Commanders are likely to tell Obama that security gains are fragile and could be jeopardised by a hasty troop withdrawal.",
                    "bias_type": "Speculation Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence speculates on what commanders might tell Obama, implying a negative outcome ('fragile' security gains jeopardized by 'hasty' troop withdrawal) without presenting concrete evidence or the full range of expert opinions on the matter."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the discussion of U.S. strategy in Iraq, particularly in the context of the 2008 presidential election, with a general bias tendency towards portraying certain positions and actions in a more negative or challenging light."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.21739130434782608,
            "overall_rating": 0.408695652173913
        },
        "combined_score": 0.0
    }
]