[
    {
        "Title": "Barack Obama proposes $75 bln stimulus plan",
        "URL": "Barack Obama proposes $75 bln stimulus plan.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    LAS VEGAS, Jan 13 (Reuters) - Amid growing worries about a  worsening of the U.S. economy, Democratic presidential candidate  Barack Obama proposed a $75 billion economic stimulus plan on  Sunday that includes worker tax credits, a one-time pension  supplement and help for homeowners facing foreclosure.      The plan would include an immediate $250 tax credit to workers  that could double if the economy worsens; a one-time $250  supplement to Social Security retirement payments, a $10 billion  fund to help homeowners facing foreclosure, and a $10 billion fund  to bolster states facing budget shortfalls.      The Illinois senator's office unveiled the proposals while  campaigning in Nevada, which holds the next contested Democratic  primary on Saturday. His leading rival, New York Sen. Hillary  Clinton, also recently unveiled an economic stimulus package.   (Editing by Bill Trott)   ((adam.tanner@reuters.com, +1 415-677-2541; Reuters Messaging:  adam.tanner.reuters.com@reuters.net))  Keywords: USA POLITICS/OBAMA        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 19.96845054626465,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides a straightforward report on Barack Obama's proposed $75 billion economic stimulus plan without exhibiting any of the common forms of bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "UPDATE 1-Barack Obama proposes $75 billion stimulus plan",
        "URL": "UPDATE 1-Barack Obama proposes $75 billion stimulus plan.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": " (Adds details, quote)      LAS VEGAS, Jan 13 (Reuters) - Amid growing worries about a  worsening of the U.S. economy, Democratic presidential  candidate Barack Obama proposed a $75 billion economic stimulus  plan on Sunday that includes worker tax credits, a one-time  pension supplement and help to homeowners facing foreclosure.      The plan would include an immediate $250 tax credit to  workers that could double if the economy worsens, a one-time  $250 supplement to Social Security payments, a $10 billion fund  to help homeowners facing foreclosure and a $10 billion fund to  bolster states facing budget shortfalls amid lower tax  revenues.      'We need that middle-class tax cut now more than ever --  not five months from now or five weeks from now, but now,'  Obama said in a statement. 'I'm announcing a plan to jump-start  the economy by putting money in the pockets of those who need  it most and will spend it quickly.'      The Illinois senator's office unveiled the proposals at the  start of a day of campaigning in Nevada, which holds the next  contested Democratic primary on Saturday.      His leading rival, New York Sen. Hillary Clinton, on Friday  unveiled an economic stimulus package she said would be worth  $70 billion. Her plan placed more of an emphasis on helping  families unable to make mortgage payments -- a major issue in  Nevada where 'for sale' signs are common on homes across Las  Vegas, its major city.      The plan also includes a $10 billion extension of  unemployment insurance to help those who have been unable to  find a job for more than half a year.      Last year, the senator proposed tax credits of up to $500  for 150 million workers. His revised economic plan calls for  $250 of that to come in an immediate credit, and the rest as  soon as three months later if the nation's unemployment rate  worsens.   (Editing by David Wiessler)   ((adam.tanner@reuters.com, +1 415-677-2541; Reuters Messaging:  adam.tanner.reuters.com@reuters.net))       Keywords: USA POLITICS/OBAMA        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 18.78164291381836,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it primarily reports on the economic stimulus plans proposed by Democratic presidential candidates Barack Obama and Hillary Clinton without employing language or framing that indicates a bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "UPDATE 2-Barack Obama proposes $75 billion stimulus plan",
        "URL": "UPDATE 2-Barack Obama proposes $75 billion stimulus plan.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": " (Adds Obama's economic adviser)      By Adam Tanner      LAS VEGAS, Jan 13 (Reuters) - Amid growing worries about a  worsening of the U.S. economy, Democratic presidential  candidate Barack Obama proposed a $75 billion economic stimulus  plan on Sunday that includes worker tax credits, a one-time  pension supplement and help to homeowners facing foreclosure.      The plan would include an immediate $250 tax credit for  workers, which could double if the economy worsens, a one-time  $250 supplement to Social Security payments, a $10 billion fund  to help homeowners facing foreclosure and a $10 billion fund to  assist states facing budget shortfalls amid lower tax  revenues.      'We need that middle-class tax cut now more than ever --  not five months from now or five weeks from now, but now,'  Obama said in a statement. 'I'm announcing a plan to jump-start  the economy by putting money in the pockets of those who need  it most and will spend it quickly.'      If he won his party's nomination and then the November  election, Obama would take office in January 2009.      The Illinois senator's office unveiled the proposals at the  start of a day of campaigning in Nevada, which holds the next  contested Democratic primary on Saturday.      The 'goal would be to help the U.S. economy from going into  recession,' his economic advisor Austan Goolsbee told  reporters.      Obama's leading rival, New York Sen. Hillary Clinton, on  Friday unveiled an economic stimulus package she said would be  worth $70 billion. Her plan placed more of an emphasis on  helping families unable to make mortgage payments -- a major  issue in Nevada where 'for sale' signs are common on homes  around heavily populated Las Vegas.      'There are some similarities,' Goolsbee said of the two  plans. The biggest difference with Obama's plan is that 'the  absolutely most imperative thing is to get the money into the  people's hands immediately so they can spent it.'      'The stimulus does increase the deficit in the immediate  term,' the economic adviser said, adding that preventing a  recession could have 'profound' budget implications.      The Obama plan also includes a $10 billion extension of  unemployment insurance to help those who have been unable to  find a job for more than six months.      The foreclosure help plan would be aimed at 'responsible  homeowners' who live in their primary residences, Goolsbee  said. Las Vegas has been hit hard by the subprime loan crisis,  but many of those suffering bought additional houses hoping  that fast rising prices amid a prosperous local economy would  lead to easy money.      Last year, Obama proposed tax credits of up to $500 for 150  million workers. His revised economic plan calls for $250 of  that to come in an immediate credit, and the rest as soon as  three months later if the nation's unemployment rate worsens.   ((Editing by Stacey Joyce; adam.tanner@reuters.com, +1  415-677-2541; Reuters Messaging:  adam.tanner.reuters.com@reuters.net))  Keywords: USA POLITICS/OBAMA        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 18.496356964111328,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to exhibit bias as it primarily focuses on reporting the proposed economic stimulus plans of Democratic presidential candidates Barack Obama and Hillary Clinton without employing any of the identified bias types."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Obama unveils $1000 tax cut, energy efficiency plan",
        "URL": "Obama unveils $1000 tax cut, energy efficiency plan.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    FAIRFAX, Va., Jan 8 (Reuters) - U.S. President-elect Barack  Obama said on Thursday he would offer working families a $1,000  tax cut and improve energy efficiency in millions of American  homes in order to create jobs and stimulate the economy.      'To get people spending again, 95 percent of working  families will receive a $1,000 tax cut -- the first stage of a  middle-class tax cut that I promised during the campaign and  will include in our next budget,' he said in a speech outside  Washington.      He said his economic recovery plan would extend jobless aid  and healthcare coverage for the unemployed and include  proposals to double production of alternative energy in the  next three years and improve energy efficiency for millions of  homes.      (Reporting by Paul Eckert, editing by Patricia Zengerle)   ((paul.eckert@reuters.com; +1 202-789-8578; Reuters Messaging:  paul.eckert.reuters.com@reuters.net))  Keywords: USA OBAMA/STIMULUS        ",
        "Histogram": [
            0,
            0,
            0,
            0
        ],
        "Relevance": 17.17485237121582,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides a straightforward report on U.S. President-elect Barack Obama's economic plans without exhibiting any of the typical signs of media bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "TAKE A LOOK-OBAMA PRESIDENCY: Obama orders tax cuts implemented",
        "URL": "TAKE A LOOK-OBAMA PRESIDENCY: Obama orders tax cuts implemented.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    U.S. President Barack Obama orders the U.S. Treasury to  implement tax cuts for 95 percent of Americans, fulfilling a  campaign pledge he hopes will help jolt the economy out of  recession.      The tax cuts are part of a $787 billion economic recovery plan  passed by the Democratic-controlled Congress over Republican  opposition.         TOP STORIES  > Obama tells US Treasury to begin cutting taxes  [ID:nN20270980]  > Obama vows to spend stimulus money wisely       [ID:nN20445668]  > White House says supports private banking system[ID:nN20418647]  > Obama reassures Canada on open trade            [ID:nN18466482]  > Housing plan will have impact in March-Bair     [ID:nN19490242]  > Obama unveils plan to tackle housing crisis     [ID:nN17400254]       THE ECONOMY AND STIMULUS PLAN  > Obama task force urges US automaker restructure [ID:nN20299255]  > Success of U.S. bailout tough to measure        [ID:nN20286997]  > FACTBOX-Obama set for big week-budget, speech   [ID:nN20281992]  > FACTBOX-Obama housing plan pushes refinancing   [ID:nN18526063]  > Obama moves forward on cars, financial oversight[ID:nN18466708]      SECURITY AND FOREIGN POLICY  > Economic woes trump rights as Clinton in China   [ID:nSP301451]  > US: Expects allies commitment for Afghanistan   [ID:nN20291774]  > U.S. envoy calls Pakistan's Zardari over Swat   [ID:nN19392082]      ANALYSIS AND ISSUES  > Gov't will not repeat mistakes of Katrina      [ID:nN20274383]  > ANALYSIS-Obama catches the travel bug early    [ID:nN19529961]  > Obama wants NAFTA altered without trade harm   [ID:nN19528814]  > Sebelius considered for U.S. health secretary  [ID:nN19506255]   (Compiled by World Desk, Americas; +1 202 898 8457)   ((For more on the stimulus plan, go to [ID:nN26365728]   ((For more about the U.S. political scene please visit Reuters  'Front Row Washington' at http:blogs.reuters.com/trail08/))  Keywords: OBAMA/TAKEALOOK       ",
        "Histogram": [
            0,
            0,
            0
        ],
        "Relevance": 16.166898727416992,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it primarily reports on President Obama's actions regarding tax cuts and the economic recovery plan without exhibiting any of the typical signs of bias such as emotional sensationalism, unsubstantiated claims, or discriminatory language."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Obama to propose huge tax cut - Democratic aide",
        "URL": "Obama to propose huge tax cut - Democratic aide.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    WASHINGTON, Jan 4 (Reuters) - U.S. President-elect Barack  Obama's economic stimulus plan will propose business and middle  class tax cuts of about $310 billion dollars, or 40 percent of  the package, a senior Democratic aide said on Sunday.      The aide said that Obama plans to discuss the plan on  Monday in a meeting with congressional leaders. House of  Representatives Speaker Nancy Pelosi is supportive of the  proposed tax relief but details have to be worked out, the aide  said.     Obama plans to propose a stimulus package of new federal  spending of up to $775 billion, the aide said.    (Writing by Thomas Ferraro; Editing by Jackie Frank)   ((joanne.allen@thomsonreuters.com; +1 202 898 8322))  Keywords: USA OBAMA/ECONOMY       ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 15.831666946411133,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it primarily reports factual information about U.S. President-elect Barack Obama's economic stimulus plan without using language or framing that indicates a bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Obama calls for new tax rebates to fight energy costs",
        "URL": "Obama calls for new tax rebates to fight energy costs.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    ST. PETERSBURG, Fla., Aug 1 (Reuters) - Democratic  presidential candidate Barack Obama called on Friday for a  package of new measures to fight rising energy costs, including  a $1,000 tax rebate for working families.      Obama said he would pay for the package with his proposed  windfall profits tax on oil companies.   (Editing by Theodore d'Afflisio)   ((john.whitesides@reuters.com; +1 202 354 5866; Reuters  Messaging: john.whitesides.reuters.com@reuters.net))    Keywords: USA POLITICS/OBAMA PLAN       ",
        "Histogram": [
            0,
            0.6,
            0
        ],
        "Relevance": 15.716578483581543,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Obama said he would pay for the package with his proposed windfall profits tax on oil companies.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the term 'windfall profits tax' carries a negative connotation towards oil companies, implying that their profits are excessive and undeserved. This choice of words can influence the reader's perception of the tax as a punitive measure rather than a policy proposal."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits a Word Choice Bias regarding the proposed tax policy, suggesting a negative portrayal of oil companies' profits. This bias could influence the reader's perception of the policy's fairness and the nature of oil companies' profits."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.3333333333333333,
            "overall_rating": 0.4666666666666667
        },
        "combined_score": 0.0
    },
    {
        "Title": "TAKE A LOOK-OBAMA PRESIDENCY: Obama unveils housing plan",
        "URL": "TAKE A LOOK-OBAMA PRESIDENCY: Obama unveils housing plan.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    President Barack Obama was set on Wednesday to unveil a plan  to stabilize the troubled housing market, a main cause of the  economy's deepening slump.      Fresh from signing into law a sweeping $787 billion fiscal  stimulus package, Obama is turning his attention to the housing  market, where foreclosures have continued to climb despite earlier  initiatives aimed at halting that trend.       TOP STORIES  > Obama unveils plan for troubled housing market  [ID:nN17400254]  > Obama signs stimulus bill, housing moves next   [ID:nN17348348]  > Obama orders thousands of troops to Afghanistan [ID:nN17386763]  > Trade, energy top Obama agenda in Canada trip   [ID:nN17393532]  > White House dampens stimulus expectations       [ID:nN15276080]  > Obama to lift ban on stem cell research - aide  [ID:nN15271470]  > Third Obama Cabinet nominee withdraws name      [ID:nN12483849]  > McCain says Obama bipartisanship needs work     [ID:nN13542592]       THE ECONOMY AND STIMULUS PLAN  > White House seeks to rein in exec pay excesses  [ID:nN17375725]  > FACTBOX-A sampling of stimulus money for states [ID:nN17373309]  > FACTBOX-Tax details of US stimulus plan         [ID:nN12480804]  > FACTBOX-Energy tax breaks, spending in stimulus [ID:nN13378752]  > FACTBOX-Health spending in US stimulus plan     [ID:nN17361595]  > US debt limit hike to $12.1 trillion in stimulus[ID:nN12538774]  > U.S. sees economic crisis as top security threat[ID:nN12469241]  > FACTBOX-Where has the U.S. bailout money gone?  [ID:nN27482095]       NOMINEES  > Statement by Gregg withdrawing as commerce sec [ID:nN12480254]  > President Obama's cabinet nominee problems      [ID:nN12486446]  > Senate confirms Leon Panetta to head CIA        [ID:nN12491014]  > Labor nominee advances despite tax problem      [ID:nN11395472]         SECURITY AND FOREIGN POLICY  > Obama seen sending over 12,000 troops for Afghan[ID:nN17384167]  > Clinton calls for coordinated economic response [ID:nN17291474]  > U.S. envoy to talk to Pakistan, Afghanistan     [ID:nDEL168078]  > Clinton makes offer to N.Korea, appeals to China[ID:nN13542583]  > US links Moscow help on Iran to missile shield  [ID:nN13541668]  > Obama offers support for Turkey-Iraq ties       [ID:nN16323879]  > Obama reaffirms U.S. support for Hariri tribunal[ID:nN12460483]      ANALYSIS AND ISSUES  > SNAP ANALYSIS-Afghan war now belongs to Obama   [ID:nN17386340]  > Q+A-Obama sends more US troops to Afghanistan   [ID:nN17392942]  > FACTBOX-Trade dominates Obama visit to Canada   [ID:nN16324010]  > Obama's big victory comes at a cost             [ID:nN15277762]  > Despite successes, some Obama promises unmet    [ID:nN13508276]  > Obama walks line between politics, economy      [ID:nN11403932]  > To save or to spend? Americans ponder their duty[ID:nN12489014]     (Compiled by World Desk, Americas; +1 202 898 8457)   ((For more on the stimulus plan, go to [ID:nN26365728]   ((For more about the U.S. political scene please visit Reuters  'Front Row Washington' at http:blogs.reuters.com/trail08/))h  Keywords: OBAMA/TAKEALOOK       ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 15.44223690032959,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it primarily focuses on reporting factual information about President Obama's actions and policies without employing any of the typical bias indicators."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "TAKE A LOOK-OBAMA PRESIDENCY: Obama budget pick quits over tax",
        "URL": "TAKE A LOOK-OBAMA PRESIDENCY: Obama budget pick quits over tax.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    President Barack Obama's choice to oversee budget and spending  reform, Nancy Killefer, withdrew her nomination on Tuesday because  of tax reasons, according to a letter released by the White  House.      Tax problems are also plaguing Tom Daschle, the former Senate  majority leader selected by Obama to spearhead U.S. healthcare  reform. Treasury Secretary Timothy Geithner's nomination was also  held up for tax issues, although he was eventually confirmed.      Obama named a third prominent Republican to his cabinet,  nominating Senator Judd Gregg of New Hampshire as commerce  secretary.       TOP STORIES  > Obama budget official withdraws for tax reasons [ID:nWAT010894]  > Senate Democrats back Obama health pick Daschle [ID:nN02326668]  > FACTBOX-US editorials on Daschle nomination     [ID:nN03508605]  > Obama nominates Republican Gregg for commerce   [ID:nN03525325]  > Attorney general: no Wall St crime 'witch hunt' [ID:nWAT010893]  > Obama seeks quick action on Senate stimulus bill[ID:nN02468978]  > Chris Hill expected to be named US envoy to Iraq[ID:nN02475174]  > Obama says most troops in Iraq home within year [ID:nN01397189]       THE ECONOMY AND STIMULUS PLAN  > Obama asks Treasury for guidelines on bailout   [ID:nN02487257]  > Stimulus items draw ire, become trading chips?  [ID:nN29297688]  > Will U.S. spending bill stimulate the economy?  [ID:nN28542734]  > SCENARIOS-Senate poised to debate economic plan [ID:nN30376721]         SECURITY AND FOREIGN POLICY  > Clinton expected to visit Japan, S.Korea, China [ID:nN02407665]  > US Mideast envoy to return to region this month [ID:nN03513776]  > Obama, South Korea's Lee vow fight protectionism[ID:nSEO339745]  > Obama spoke with Iraqi leaders Maliki, Talabani [ID:nN02286977]  > Obama voices concern on freed Guantanamo inmates[ID:nN02441019]  > SCENARIOS-Options open to Obama in Iran policy  [ID:nN29300452]  > Obama Afghan strategy stress non-military role  [ID:nN28515139]         ANALYSIS AND ISSUES  > Tax issues shadow Obama health nominee Daschle  [ID:nN30403953]  > Iran plays for time to work out reply to Obama  [ID:nBLA239942]  > Clinton: politician's touch in a diplomat's job [ID:nN29305820]  > ANALYSIS-Republicans in high-stakes challenge   [ID:nN29266653]      (Compiled by World Desk, Americas; +1 202 898 8457)    ((For more about the U.S. political scene please visit Reuters  'Front Row Washington' online at  http://blogs.reuters.com/trail08/))  ",
        "Histogram": [
            0,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0
        ],
        "Relevance": 15.38243579864502,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Tax problems are also plaguing Tom Daschle, the former Senate majority leader selected by Obama to spearhead U.S. healthcare reform. Treasury Secretary Timothy Geithner's nomination was also held up for tax issues, although he was eventually confirmed.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the word 'plaguing' to describe the tax problems of Tom Daschle and Timothy Geithner implies a strong negative connotation and suggests that these issues are significantly detrimental, which could influence the reader's perception negatively."
                },
                {
                    "text": "Obama named a third prominent Republican to his cabinet, nominating Senator Judd Gregg of New Hampshire as commerce secretary.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Referring to Judd Gregg as a 'prominent Republican' could imply a positive judgment about his status within the party, potentially influencing the reader's perception of the appointment."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits a word choice bias regarding the tax problems of political figures, suggesting a negative connotation and potentially influencing the reader's perception. Additionally, the use of 'prominent Republican' to describe Judd Gregg may subtly influence the reader's perception of the appointment in a positive light."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.2857142857142857,
            "overall_rating": 0.44285714285714284
        },
        "combined_score": 0.0
    },
    {
        "Title": "TAKE A LOOK-U.S. ELECTION: McCain hammers Obama on tax plan",
        "URL": "TAKE A LOOK-U.S. ELECTION: McCain hammers Obama on tax plan.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    Republican presidential nominee John McCain took his 'Joe the  Plumber' economic message on a bus ride across Florida on  Thursday, accusing Democrat Barack Obama of backing a tax plan  that would endanger the teetering U.S. economy.      McCain's broadside, delivered at stops throughout central  Florida, prompted Obama to fire back that McCain's economic  proposals would give corporations a tax break for shipping jobs  overseas -- a 'Wall Street first, Main Street last' strategy.      Obama has expanded his national lead over McCain to 12 points,  according to the latest Reuters/C-SPAN/Zogby poll. The latest Wall  Street Journal/NBC News poll had the same results.      Double-click on the code in brackets to see the latest  stories. If no story appears, click on the headline.      TOP STORIES  > McCain hammers Obama on Florida bus tour        [ID:nN23441311]  > US exit-pollsters seek disaster-free election   [ID:nN22363830]  > McCain can't make attacks stick to Obama        [ID:nN22368042]  > Obama urges vigilance during presidential change[ID:nN22385488]  > Obama welcomes planned global financial summit  [ID:nN22377177]  > Ugly election incidents show lingering US racism[ID:nN22377099]  > More U.S. voters cast early ballots             [ID:nN22368828]  > SCENARIOS-How candidates faring in key states   [ID:nN20283300]  > Obama focuses on economy in Florida             [ID:nN21304961]  > Bailout seen hitting Obama, McCain health plans [ID:nN21324303]  > Ohio election website shut down after hacked    [ID:nN21324618]  > FBI chief to stay on under new president        [ID:nN21330166]  > Tina Fey glues ears down to look like Palin     [ID:nN21333945]       POLLS  > Obama's lead on McCain grows to 12 points       [ID:nN22401496]  > Obama, McCain tied for U.S. rural vote-poll     [ID:nN23474191]  > Obama, living American dream, ahead in China poll[ID:nPEK13232]  > Obama leads McCain by 14 points - CBS/NYT poll  [ID:nN14254285]  > Obama leads McCain by 10 points-Wash Post/ABC   [ID:nN13341332]  > Few confident U.S. candidates can fix economy   [ID:nN14489019]  > For links to non-Reuters Web sites that collate latest polls  see:      http://www.realclearpolitics.com/polls/      http://www.pollster.com/      http://www.pollingreport.com/wh08.htm         ANALYSES/SIDEBARS  > Black Europeans pin political hopes on Obama     [ID:nLN326521]  > Just 1 pct of French want McCain to win -poll    [ID:nLN547652]  > Black vote could help swing key states to Obama [ID:nN22391761]  > Obama urges vigilance during presidential change[ID:nN22385488]  > Palin pick dogs McCain as economic crisis stings[ID:nN20116528]  > Ailing U.S. economy may cost Republicans big    [ID:nN17474276]  > Obama, McCain oppose gas tax hike               [ID:nN20116528]  > Sour note for American Muslims in campaign      [ID:nN22400276]  > Obama, McCain advisers wary on finance summit   [ID:nN21278987]  > GM-Chrysler: candidates' advisers take no sides [ID:nN21295221]  > McCain, Obama advisers clash on balancing budget[ID:nN20127170]  > U.S. conservatives fearful as election nears    [ID:nN17474040]  > Obama aims at Republican turf                   [ID:nN17466726]  > Cindy McCain releases 2007 tax return           [ID:nN17486902]  > Joe the Plumber drained by election spotlight   [ID:nN17466307]  > Americans put revamped voting technology to test[ID:nN16412689]  > Once wary, U.S. Hispanics now warm to Obama     [ID:nN16393769]  > US blacks bounce between hope,doubt of Obama win[I",
        "Histogram": [
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 15.247509002685547,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Republican presidential nominee John McCain took his 'Joe the Plumber' economic message on a bus ride across Florida on Thursday, accusing Democrat Barack Obama of backing a tax plan that would endanger the teetering U.S. economy.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'endanger the teetering U.S. economy' implies a negative judgment and suggests a precarious situation without providing evidence, influencing the reader's perception."
                },
                {
                    "text": "McCain's broadside, delivered at stops throughout central Florida, prompted Obama to fire back that McCain's economic proposals would give corporations a tax break for shipping jobs overseas -- a 'Wall Street first, Main Street last' strategy.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'Wall Street first, Main Street last' is a clear example of word choice bias, using evocative language to imply a negative prioritization without a balanced presentation of the policies' effects."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias through the use of word choice, particularly in describing the economic policies of the candidates, which implies negative consequences and prioritizations without a balanced or evidence-based presentation."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.14285714285714285,
            "overall_rating": 0.37142857142857144
        },
        "combined_score": 0.0
    },
    {
        "Title": "FACTBOX-Obama proposes U.S. economic stimulus plan",
        "URL": "FACTBOX-Obama proposes U.S. economic stimulus plan.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "     Jan 13 (Reuters) - U.S. Democratic presidential candidate  Barack Obama on Sunday proposed a $75 billion plan to stimulate  the economy through worker tax credits, a one-time pension  supplement and help for homeowners facing foreclosure.      He said the plan also includes another $45 billion in  reserves that could be injected if the economy continues to  worse.      Here are highlights of the plan:           *An immediate $250 tax cut for workers that would double if  the economy worsens           *An immediate, temporary $250 bonus to seniors in their  Social Security checks that would also double in an economic  downturn.           *A $10 billion fund to help homeowners facing foreclosure           *A $10 billion fund to bolster states facing budget  shortfalls amid lower tax revenues           *A $10 billion extension of unemployment insurance to help  those who have been unable to find a job for more than half a  year.      (Writing by Cynthia Osterman; editing by Chris Wilson)  Keywords: USA POLITICS/OBAMA        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 15.239014625549316,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides a straightforward report on Barack Obama's proposed economic stimulus plan without exhibiting any of the typical signs of bias such as emotional sensationalism, unsubstantiated claims, or discriminatory language."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Obama to allow Bush tax cuts to expire on schedule",
        "URL": "Obama to allow Bush tax cuts to expire on schedule.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    WASHINGTON, Feb 21 (Reuters) - U.S. President Barack Obama  will allow tax breaks given to wealthier Americans under his  predecessor, George W. Bush, to expire as scheduled rather than  eliminate them sooner, an administration official said on  Saturday.      Obama, who promised during his White House campaign to roll  back tax cuts on people earning more than $250,000, also plans  to boost tax collections from about 16 percent of the economy  this year to 19 percent in 2013, the official said, confirming  a Washington Post report on Obama's budget proposals for the  2010 fiscal year.   (Reporting by Ross Colvin; Editing by Peter Cooney)   ((ross.colvin@reuters.com; Reuters Messaging:  ross.colvin.reuters.com@reuters.net; +1 202-898-8392))  Keywords: OBAMA/ECONOMY PLAN        ",
        "Histogram": [
            0,
            0,
            0
        ],
        "Relevance": 15.135787010192871,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides a straightforward report on President Obama's decision to allow the Bush tax cuts to expire as scheduled, without introducing any biased language or perspectives."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Obama lauds House Democrats economic stimulus plan",
        "URL": "Obama lauds House Democrats economic stimulus plan.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    WASHINGTON, Jan 15 (Reuters) - U.S. President-elect Barack  Obama on Thursday praised an $825 billion tax cut and spending  bill proposed by Democrats in the House of Representatives,  saying it will help the country deal with economic challenges.      'This plan is a significant downpayment on our most urgent  challenges, and it will contain the kind of strict, independent  oversight that will allow the American people to hold  Washington accountable for how and when their tax dollars are  spent,' Obama said in a statement.      The bill, which would add to an already massive $1.2  trillion budget deficit forecast for this year, would combine  $550 billion in emergency spending initiatives with $275  billion in temporary tax benefits over the next two years.   (Reporting by Deborah Charles; Editing by John O'Callaghan)   ((deborah.charles@reuters.com;+1 202 789 8579; Reuters  Messaging: deborah.charles.reuters.com@reuters.net))  Keywords: USA ECONOMY/STIMULUS OBAMA        ",
        "Histogram": [
            0,
            0,
            0,
            0
        ],
        "Relevance": 15.082491874694824,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it primarily reports on President-elect Barack Obama's positive remarks about the economic stimulus plan proposed by Democrats in the House of Representatives without employing any of the identified bias types."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Obama: Gasoline tax holiday is a \"bad idea\"",
        "URL": "Obama: Gasoline tax holiday is a \"bad idea\".txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    BLUE BELL, Pa., April 21 (Reuters) - Democratic  presidential candidate Barack Obama on Monday criticized a plan  by his Republican rival Sen. John McCain to give U.S. consumers  a temporary break from the federal gasoline tax.      'I've said I think John McCain's proposal for a three-month  tax holiday is a bad idea,' Obama, an Illinois senator, told a   small forum with middle-class voters at a community college      outside Philadelphia.      Obama said that consumers would only see the price cut for  a short time before the costs 'spike right up' again. He also  said there was no guarantee that oil companies would not just  raise prices at the pump by the same amount as the tax cut.      'We're talking about 5 percent of your total cost of gas  that you suspend for three months, which might save you a few  hundred bucks that then will spike right up,' Obama said. 'Now  keep in mind that it will save you that if Exxon Mobil <XOM.N>   doesn't decide, 'we'll just tack on another 5 percent on the current cost.''      Obama added that the money from the gasoline tax is needed  for the federal highway fund.      But Obama said he did not favor an increase in the gasoline  tax.      'Now, I don't want to jack up the cost. I'm not going to  impose an additional tax on gas because consumers just can't  bear it right now,' he said.      Obama is battling Hillary Clinton for the Democratic  nomination and the right to run against McCain, the presumptive  Republican nominee in the general election in November.      McCain last week called for a summer gasoline-tax holiday  for Americans upset over high prices at the pump. The proposal  was part of a broader plan to help the ailing U.S. economy.   (Reporting by Caren Bohan, editing by Jackie Frank)   ((caren.bohan@reuters.com, Reuters Messaging:  caren.bohan.reuters.com@reuters.net, +1 202 898 8300))    Keywords: USA POLITICS/OBAMA GASOLINE       ",
        "Histogram": [
            0,
            0.6,
            0.6,
            0.6,
            0.8,
            0.8,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 14.999929428100586,
        "BiasReport": {
            "sentences": [
                {
                    "text": "'I've said I think John McCain's proposal for a three-month  tax holiday is a bad idea,' Obama, an Illinois senator, told a   small forum with middle-class voters at a community college      outside Philadelphia.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence reflects an opinionated bias as it presents Barack Obama's subjective opinion on John McCain's proposal as a fact, without acknowledging that it is a personal perspective."
                },
                {
                    "text": "Obama said that consumers would only see the price cut for  a short time before the costs 'spike right up' again. He also  said there was no guarantee that oil companies would not just  raise prices at the pump by the same amount as the tax cut.",
                    "bias_type": "Speculation Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence engages in speculation by suggesting future outcomes based on conjecture rather than concrete facts, implying a negative consequence of the tax holiday without definitive evidence."
                },
                {
                    "text": "'We're talking about 5 percent of your total cost of gas  that you suspend for three months, which might save you a few  hundred bucks that then will spike right up,' Obama said. 'Now  keep in mind that it will save you that if Exxon Mobil <XOM.N>   doesn't decide, 'we'll just tack on another 5 percent on the current cost.''",
                    "bias_type": "Projection Bias",
                    "bias_strength": 0.8,
                    "bias_description": "This statement attributes speculative motives to Exxon Mobil without evidence, suggesting they would exploit the tax holiday to raise prices, which is a form of projection bias."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias through the use of opinionated statements, speculative assertions, and projection of motives onto oil companies, all of which contribute to a negative portrayal of John McCain's proposal for a gasoline tax holiday. The bias is primarily against the economic policy suggested by McCain, as it is critiqued and speculated upon without a balanced presentation of opposing viewpoints."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6666666666666666,
            "percentage_of_biased_sentences": 0.35714285714285715,
            "overall_rating": 0.5119047619047619
        },
        "combined_score": 0.0
    },
    {
        "Title": "UPDATE 1-Obama calls for tax rebates to fight energy costs",
        "URL": "UPDATE 1-Obama calls for tax rebates to fight energy costs.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": " (Adds quote, details)      ST. PETERSBURG, Fla., Aug 1 (Reuters) - Democratic  presidential candidate Barack Obama called on Friday for a  package of new measures to fight rising energy costs, including  a $1,000 tax rebate for low- and middle-income workers.      Obama said he would pay for the $65 billion package with  his proposed windfall profits tax on oil companies.      He also revamped his proposal for a $50 billion stimulus  plan to include $25 billion in infrastructure improvements that  campaign officials said could save up to one million jobs.      'With job losses mounting, prices rising, increased  turbulence in our financial system and a growing credit crunch,  we need to do more,' Obama said in a statement.   (Reporting by John Whitesides, Editing by Andrea Ricci)   ((john.whitesides@reuters.com; +1 202 354 5866; Reuters  Messaging: john.whitesides.reuters.com@reuters.net))    Keywords: USA POLITICS/OBAMA PLAN        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 14.979069709777832,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it primarily reports on a political candidate's proposal for addressing rising energy costs without exhibiting any of the typical signs of bias such as emotional sensationalism, ad hominem attacks, or unsubstantiated claims."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "McCain, Obama tax plans to boost US debt-tax group",
        "URL": "McCain, Obama tax plans to boost US debt-tax group.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By David Lawder      WASHINGTON, June 11 (Reuters) - Tax breaks proposed by both  presidential hopefuls John McCain and Barack Obama would  increase the U.S. national debt by trillions of dollars over 10  years, but Obama's plan would hike taxes for the wealthiest  Americans, a tax policy group said on Wednesday.      In an analysis of how the candidates' tax proposals would  affect federal revenues, the Brookings Institution and the  Urban Institute said McCain's plans would cut receipts by $3.72  trillion from 2009-2018 compared with current tax law.      Obama's plans would cut revenues by $2.73 trillion over the  same period.      Including added interest costs, McCain's plan would add  $4.5 trillion to the national debt, while Obama's would add  $3.3 trillion -- and that's before spending proposals are  considered.      'It seems really unlikely that they're going to be  balancing the budget,' said Leonard Burman, director of The Tax  Policy Center run by Brookings and the Urban Institute in  Washington, D.C.      The group sought to quantify revenue costs for the tax  break proposals articulated on the campaign trail but assumed  flat spending for each candidate based on this year's budget.      McCain has proposed extending the Bush administration's  2001 and 2003 income and capital gains tax cuts, which are due  to expire at the end of 2010. He also wants to cut the  corporate income tax rate to 25 percent, reduce estate taxes,  increase the exemption for dependents by $500 and allow  businesses to expense purchases of shorter-term equipment.      Obama, meanwhile, would retain portions of the 2001 and  2003 tax cuts that benefit low- and middle-income Americans,  while allowing rates to ratchet back up for the wealthiest  taxpayers. He is also proposing new tax credits for lower  income workers and a home mortgage tax credit for taxpayers who  do not itemize deductions.      Obama also proposes to expand the child and dependent care  tax credit and exempt seniors earning less than $50,000 from  paying federal income taxes.      The analysis assumes both candidates want to permanently  index the alternative minimum tax for inflation to keep it from  ensnaring more middle income taxpayers, at a cost of about $1.1  trillion over 10 years.      The analysis was done before Obama said he wanted to phase  out the alternative minimum tax.      The Tax Policy Center said McCain's plan would provide  effective tax cuts for Americans across the income spectrum,  with the largest percentage increase in after-tax income going  to the wealthiest 0.1 percent of Americans.      This group, numbering around 150,000, would see their  after-tax income rise by an average of 11.6 percent, or  $678,500, in 2012 as compared with current law that sees tax  cuts expiring at the end of 2010.      The lowest income 20 percent of taxpayers would see an  increase in after-tax income of 0.9 percent, or $101.      Obama's plan takes somewhat the opposite tack, providing  greater percentage tax benefits for lower income groups while  the wealthiest would see tax hikes.      The analysis showed that the lowest-income 20 percent of  taxpayers would see after-tax income increase by 6.2 percent,  or $698 increase, compared with current law, while the top 0.1  percent would see their after-tax incomes decline by 5.1  percent, or $301,400.      Burman said the analysis deliberately left out spending  proposals to focus on the tax side of the equation. He added",
        "Histogram": [
            0,
            0,
            0,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0,
            0.6,
            0,
            0,
            0
        ],
        "Relevance": 14.627246856689453,
        "BiasReport": {
            "sentences": [
                {
                    "text": "'It seems really unlikely that they're going to be balancing the budget,' said Leonard Burman, director of The Tax Policy Center run by Brookings and the Urban Institute in Washington, D.C.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence presents the personal opinion of Leonard Burman as a definitive statement, suggesting a lack of balance in the budget without providing a comprehensive analysis, thus blurring the line between fact and opinion."
                },
                {
                    "text": "The Tax Policy Center said McCain's plan would provide effective tax cuts for Americans across the income spectrum, with the largest percentage increase in after-tax income going to the wealthiest 0.1 percent of Americans. This group, numbering around 150,000, would see their after-tax income rise by an average of 11.6 percent, or $678,500, in 2012 as compared with current law that sees tax cuts expiring at the end of 2010.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of phrases like 'largest percentage increase' and 'wealthiest 0.1 percent' carries a negative connotation towards the tax benefits received by a specific group, implying judgment and potentially influencing the reader's perception."
                },
                {
                    "text": "Obama's plan takes somewhat the opposite tack, providing greater percentage tax benefits for lower income groups while the wealthiest would see tax hikes.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'takes somewhat the opposite tack' and the contrast between 'greater percentage tax benefits for lower income groups' and 'wealthiest would see tax hikes' introduces a subtle bias through word choice, suggesting a more favorable approach by Obama's plan without a neutral presentation."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the tax plans of McCain and Obama, particularly in the presentation of the impact on different income groups and the overall budget balance. The biases identified include Opinionated Bias and Word Choice Bias, with a general tendency to imply judgment and influence the reader's perception through the use of subjective opinions and selective language."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.1,
            "overall_rating": 0.35
        },
        "combined_score": 0.0
    },
    {
        "Title": "Barack Obama __ Empty Vessel.txt",
        "URL": "Barack Obama __ Empty Vessel.txt.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Fox_News_Channel_logo.svg/240px-Fox_News_Channel_logo.svg.png",
        "Text": "A year after electing Barack Obama president, and five years after his star turn at the Democratic National Convention, we are still trying to figure him out.\n\nIs he a left-wing radical or is he a crowd-pleasing moderate? Is he a uniter? Is he actually religious? Is he a socialist? Does he hate America? And, in light of the confidence he projects, why can’t he seem to take criticism?\n\nBut we could, of course, write that first sentence another way: Only a year after electing Barack Obama president, and we are already trying to figure him out.\n\nRather than it being kind of late to attempt a rigorous analysis of President Obama’s psyche, his political philosophy and his managerial style, perhaps it’s a little too soon. Presidential personalities, after all, develop over time. And the famous saying is true that great leaders aren’t born, but made.\n\nNonetheless, because I’m too young for caution, and too old for fear, I’m more than happy to take a stab at it.\n\nLet me first assuage the fears of many of my conservative friends and colleagues: Barack Obama is not a left-wing radical. He is not a socialist, a communist or a Marxist, and he’s not a black liberation theologist. He’s not un-American, he’s not an atheist, and he’s not a racist.\n\nHe is none of those things, because all would require Barack Obama to have a belief system, a worldview, a set of convictions about political philosophy, theology, and socioeconomics that he simply doesn’t have. He is, instead, empty. He is an empty vessel.\n\nThis will shock and offend his legion of admirers on the left, as it stands in stark contrast to the breathless, leg-thrilling declarations by liberal America that Obama is a deep-thinking, complex, contemplative scholar of soaring intellect, a new kind of leader, exquisitely built for a changing world, who knows the war isn’t between good and evil, but between silence and diplomacy, and for whom indecision is a mark of judicious caution.\n\nBut he’d done nothing to deserve those early accolades, of course. So all of that was pre-ordained and pre-packaged, the result of a coordinated and deliberate campaign by a coalition of marketers, politicos, and members of the press to brand Barack Obama as “hope and change” before anyone even knew what his selling points were, or if he actually had any.\n\nThe proof of his ideological emptiness is practically undeniable. He has been, over the short course of his political career, the great abandoner, ever-willing to denounce those ideals that were previously sold to his constituents as “his convictions.”\n\nAfter 20 years in Reverend Wright’s church, he simply got up and left. The man who baptized his children, who was marketed (to black voters in particular) as Obama’s spiritual adviser, who was so integral in shaping Barack Obama’s adult life, that he publicly denounced him, and left his church altogether. And he also denounced black liberation theology, despite giving numerous interviews about the ways in which it had helped shape his religious worldview. After initially defending Rev. Wright, suddenly he and his brand of religion were chucked out the window of a moving campaign bus. He has yet to find a replacement, unsurprisingly, but his interest in evangelicals like Rick Warren and Carey Cash means he is open to the theological polar opposite of Rev. Wright.\n\nThe same sort of dance occurred with other politically inconvenient allies, like domestic terrorist Bill Ayers, Wright apologist Father Michael Pfleger, and convicted felon Tony Rezko. Obama distanced himself from all of them and then eventually dumped them altogether when it became politically necessary. Van Jones was merely a post-election victim of Obama’s willing abandonment. And there have been others.\n\nSo would a real radical disown his radical mentors and protégés? Would a real extremist and true-believer insist with a straight face that he didn’t really believe all that stuff? Would a real ideologue be persuaded by a public opinion poll to abandon whole ideology?\n\nActual radicals like Wright and Ayers and Jones defend their beliefs, regardless of the pushback and potential fallout. What Obama did, in contrast, was purely political. Because, despite the insistence by the left that Obama somehow transcends politics, that’s what he is – a politician. Nothing more, nothing less.\n\nWe can also look at the shift in his policy positions over the past few years. He was once quoted as saying that he supported a single-payer health care system. The best political decision now, however, was to abandon that for a more docile public option. Once that failed to garner the groundswell of support his advisers thought it would, he appeared altogether indifferent to it. If he were reallya radical, he’d be rallying us around universal health care right now, not some watered-down 1990-page bureaucratic hodge podge that is neither revolutionary nor practical.\n\nHis impassioned pledges to end “Don’t Ask, Don’t Tell,” close Gitmo, bring troops home, end military tribunals, and myriad other promises, suddenly seem less like the stuff of real political conviction, and more like political headaches that require a clever exit strategy.\n\nAnd his reaction to any kind of opposition – from the right, from the citizenry, from Fox News – is equally telling. If Obama’s agenda were based on conviction instead of political expedience and an unquenchable thirst for popularity, criticism would bounce right off him. Instead he seems frighteningly flappable. That’s because leadership without convictions is leadership of empty rhetoric. Convictions can be defended against criticism. Empty rhetoric cannot.\n\nSo why all the radical friends and the radical proposals and the radical rhetoric if he’s not himself a radical? Because his lack of conviction and his inability to forge his own philosophical and theological identity, have made him incredibly susceptible to external influence and pressure. He is easily led. He is, as such, the perfect prospect for someone like Bill Ayers or Reverend Wright, whose radical agendas require vulnerable recruits who are malleable and willing.\n\nI don’t know if President Obama is a man of conviction, if he is a man of faith, or if he is the intellectual giant the left really wants him to be. He very well may be all of those things. But I haven’t seen proof of any of it yet, and neither have you, because there hasn’t been any.\n\nThe only thing we do know for sure, one year after anointing this relative unknown the forty-fourth president of the United States, is that he’s a politician, pure and simple. Calling him a radical gives him way too much credit.\n\nS.E. Cupp is a write and co-author of \"Why You're Wrong About the Right.\" She is a frequent contributor to the Fox Forum.",
        "Histogram": [
            0,
            0.6,
            0.6,
            0.6,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0.9,
            0,
            0.9,
            0.6,
            0.9,
            0.9,
            0.9,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0.9,
            0.9,
            0.9,
            0.9,
            0.9,
            0.9,
            0.9,
            0.9,
            0.9,
            0.9,
            0.9,
            0.9,
            0,
            0.9,
            0.9,
            0,
            0.9,
            0.9,
            0.9,
            0.9,
            0.9,
            0.9,
            0.9,
            0.9,
            0.9,
            0.9,
            0.9,
            0.9,
            0,
            0,
            0
        ],
        "Relevance": 14.59818172454834,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Is he a left-wing radical or is he a crowd-pleasing moderate? Is he a uniter? Is he actually religious? Is he a socialist? Does he hate America? And, in light of the confidence he projects, why can’t he seem to take criticism?",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence is biased as it presents a series of speculative and opinionated questions about Barack Obama's character and beliefs without providing evidence, implying judgment and promoting doubt."
                },
                {
                    "text": "Let me first assuage the fears of many of my conservative friends and colleagues: Barack Obama is not a left-wing radical. He is not a socialist, a communist or a Marxist, and he’s not a black liberation theologist. He’s not un-American, he’s not an atheist, and he’s not a racist.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of negative connotations and the denial of extreme labels in this sentence implies that these labels are inherently negative, influencing perceptions about Barack Obama."
                },
                {
                    "text": "He is none of those things, because all would require Barack Obama to have a belief system, a worldview, a set of convictions about political philosophy, theology, and socioeconomics that he simply doesn’t have. He is, instead, empty. He is an empty vessel.",
                    "bias_type": "Ad Hominem Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This sentence attacks Barack Obama's character by asserting that he lacks a belief system or convictions, without addressing the substance of his actions or statements."
                },
                {
                    "text": "This will shock and offend his legion of admirers on the left, as it stands in stark contrast to the breathless, leg-thrilling declarations by liberal America that Obama is a deep-thinking, complex, contemplative scholar of soaring intellect, a new kind of leader, exquisitely built for a changing world, who knows the war isn’t between good and evil, but between silence and diplomacy, and for whom indecision is a mark of judicious caution.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of hyperbolic language to describe Obama's supporters' views introduces bias by exaggerating their praise and implying irrationality."
                },
                {
                    "text": "But he’d done nothing to deserve those early accolades, of course. So all of that was pre-ordained and pre-packaged, the result of a coordinated and deliberate campaign by a coalition of marketers, politicos, and members of the press to brand Barack Obama as “hope and change” before anyone even knew what his selling points were, or if he actually had any.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This sentence is biased as it presents a subjective opinion about the origins of Obama's public image as an objective fact, without providing evidence."
                },
                {
                    "text": "The proof of his ideological emptiness is practically undeniable. He has been, over the short course of his political career, the great abandoner, ever-willing to denounce those ideals that were previously sold to his constituents as “his convictions.”",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This sentence is biased as it asserts Obama's 'ideological emptiness' and 'great abandoner' status as undeniable facts, without presenting a balanced view or evidence."
                },
                {
                    "text": "So would a real radical disown his radical mentors and protégés? Would a real extremist and true-believer insist with a straight face that he didn’t really believe all that stuff? Would a real ideologue be persuaded by a public opinion poll to abandon whole ideology?",
                    "bias_type": "Speculation Bias",
                    "bias_strength": 0.9,
                    "bias_description": "These rhetorical questions speculate about Obama's character and motives, leading the reader towards a preconceived notion without concrete evidence."
                },
                {
                    "text": "Actual radicals like Wright and Ayers and Jones defend their beliefs, regardless of the pushback and potential fallout. What Obama did, in contrast, was purely political. Because, despite the insistence by the left that Obama somehow transcends politics, that’s what he is – a politician. Nothing more, nothing less.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This sentence is biased as it presents a subjective opinion about Obama's actions and motivations as objective truths, without considering alternative explanations."
                },
                {
                    "text": "We can also look at the shift in his policy positions over the past few years. He was once quoted as saying that he supported a single-payer health care system. The best political decision now, however, was to abandon that for a more docile public option. Once that failed to garner the groundswell of support his advisers thought it would, he appeared altogether indifferent to it. If he were really a radical, he’d be rallying us around universal health care right now, not some watered-down 1990-page bureaucratic hodge podge that is neither revolutionary nor practical.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This paragraph is biased as it criticizes Obama's policy shifts using subjective language ('docile', 'watered-down bureaucratic hodge podge') and implies a lack of genuine conviction without considering the complexities of policy-making."
                },
                {
                    "text": "His reaction to any kind of opposition – from the right, from the citizenry, from Fox News – is equally telling. If Obama’s agenda were based on conviction instead of political expedience and an unquenchable thirst for popularity, criticism would bounce right off him. Instead he seems frighteningly flappable. That’s because leadership without convictions is leadership of empty rhetoric. Convictions can be defended against criticism. Empty rhetoric cannot.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This sentence is biased as it asserts that Obama's reactions to opposition reveal a lack of conviction and an overreliance on popularity, without considering other factors that may influence a leader's response to criticism."
                },
                {
                    "text": "So why all the radical friends and the radical proposals and the radical rhetoric if he’s not himself a radical? Because his lack of conviction and his inability to forge his own philosophical and theological identity, have made him incredibly susceptible to external influence and pressure. He is easily led. He is, as such, the perfect prospect for someone like Bill Ayers or Reverend Wright, whose radical agendas require vulnerable recruits who are malleable and willing.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This sentence is biased as it speculates about Obama's susceptibility to external influence and his character ('easily led', 'vulnerable recruits who are malleable and willing') without providing evidence for such strong claims."
                },
                {
                    "text": "I don’t know if President Obama is a man of conviction, if he is a man of faith, or if he is the intellectual giant the left really wants him to be. He very well may be all of those things. But I haven’t seen proof of any of it yet, and neither have you, because there hasn’t been any.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This sentence is biased as it challenges the reader to prove Obama's character traits, implying that the absence of public proof equates to the absence of these traits, without acknowledging the limitations of public knowledge about a public figure's personal life."
                },
                {
                    "text": "The only thing we do know for sure, one year after anointing this relative unknown the forty-fourth president of the United States, is that he’s a politician, pure and simple. Calling him a radical gives him way too much credit.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This sentence is biased as it dismisses the possibility of Obama embodying any significant qualities beyond being a 'politician' with a negative connotation, using a dismissive tone and without providing a balanced perspective."
                }
            ],
            "overall_bias": {
                "conclusion": "The article is biased against Barack Obama, discussing his character, beliefs, and political actions with a general bias tendency towards portraying him as lacking in conviction, being easily influenced, and primarily motivated by political expediency rather than genuine principles."
            }
        },
        "Scores": {
            "average_bias_strength": 0.8307692307692309,
            "percentage_of_biased_sentences": 0.5,
            "overall_rating": 0.6653846153846155
        },
        "combined_score": 0.0
    },
    {
        "Title": "_Special Report_ Panel on Barack Obama_s Tax Plan.txt",
        "URL": "_Special Report_ Panel on Barack Obama_s Tax Plan.txt.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Fox_News_Channel_logo.svg/240px-Fox_News_Channel_logo.svg.png",
        "Text": "This is a rush transcript of \"Special Report With Brit Hume\" from June 10, 2008. This copy may not be in its final form and may be updated.\n\n(BEGIN VIDEO CLIP)\n\nSEN. JOHN MCCAIN, PRESIDENTIAL CANDIDATE: Under senator Obama's tax plan, Americans of every background would he see their taxes rise — seniors, parents, small business owners, and just about everyone who has even a modest investment in the market.\n\nSEN. BARACK OBAMA, PRESIDENTIAL CANDIDATE: What we're trying to restore balance, put some money in the pockets of working families, in the pockets of consumers. That, actually, I believe, will be good for business.\n\n(END VIDEO CLIP)\n\nBRIT HUME, HOST: Indeed, Senator Obama says that 95 percent of the people in this country would get a tax cut under his program.\n\nSo the debate is now joined between him and McCain, at long distance so far, but we are likely to hear more of it. Some thoughts on it now from Fred Barnes, executive editor of The Weekly Standard; Mort Kondracke, executive editor of Roll Call, and the syndicated columnist, Charles Krauthammer — FOX News contributors all.\n\nSo what about this debate? It is clearly joined, it is going to be central to this campaign. Who has the high cards, whose doing better, whose argument holds more water, Fred?\n\nFRED BARNES, EXECUTIVE EDITOR, THE WEEKLY STANDARD: I think McCain's does, but that doesn't mean he's winning the debate now. And so far it's a draw.\n\nI think he's going to have to deal with this claim by Obama that he would reduce income taxes, anyway for 95 percent of Americans. When you add in all the other tax increases, all the tax increases in Obama's proposal, I think that is highly unlikely, but McCain has to examine it and make the case.\n\nThe biggest problem I have, and I think most people who in favor of a strong economic rebound, is that Obama does not understand capital gains. Remember when he was asked about the capital gains tax rate in that debate by Charlie Gibson on ABC?\n\nHe was at sea when Gibson said, look, when you raise the rate on capital gains in recent years, it has reduced the revenues that have come in, and when you reduce the rate, as happened in the Clinton administration, you get more revenue.\n\nThat seemed to be a revelation to Obama who then said that at one point, well, maybe we have to raise it because of fairness. It would be harmful to the economy if you raise the capital gains rate, but he would do it for fairness and hurt the economy and jobs, and so on? I think that's where McCain particularly has a vulnerability and he needs to seize it.\n\nHUME: Has a vulnerability in Obama?\n\nBARNES: Yes.\n\nMORT KONDRACKE, EXECUTIVE EDITOR, ROLL CALL: All of that's true. Obama said he's not a tax and spend liberal, but he is. I mean, he does want to spend an awful lot of money. I was on a conference call today with his economic advisor —\n\nHUME: The word is \"invest.\"\n\nKONDRACKE: Wait, now that you're raising the issue, the country does need some public investment. And you never hear John McCain talk about. That is a bone I have to pick with McCain — no mention of infrastructure needs which we have to supply, no mention of public education investments, no mention of preschool education, that kind of stuff. Those are legitimate investments.\n\nYou got me off on this track — and all McCain wants to do is cut discretionary spending. This country will not advance in the world. But the problem is when Republicans add up all the spending and investment proposals and tax cuts that Obama is proposing, it comes to something like $3 trillion over a ten-year period, whereas, if you raise taxes on people over $250,000 a year, it comes to something like $1.5 trillion. That's a big gap, and it will only add to the deficit and the national debt.\n\nCHARLES KRAUTHAMMER, SYNDICATED COLUMNIST: McCain is OK at making this case with a teleprompter, but when he's on his own, all he does is he slogans. He says that Obama is a tax and spend liberal as in the '60's and '70's.\n\nI wouldn't really bring up '60's and '70's, because nobody under 50 remembers the '60's. in fact, there are a lot of people over 50 who don't remember the '60's either for other reasons.\n\nAnd, secondly, the '60's was a time of prosperity. And the '70's, Republicans were in office until January of '77. So it's a hard argument to make.\n\nAnd then he says Obama will be the third Carter campaign. Well, that doesn't really ring a lot because the last Democratic administration was not Carter, but Clinton, and his economy was relatively strong.\n\nI think McCain has to get away — look, he'll fight Obama to a draw on taxes. But he has to do a bold thing, and I think he can win the economic argument in going after energy and gas. That's what's hurting. That's why Americans are angry — high gas prices.\n\nHe ought to say, two years ago, with gasoline at $2 a barrel(ph), I was against drilling. Conditions have changed, I have changed. Obama isn't a guy who changes. He is stuck in the past. We have to drill in the artic, we have to drill domestically.\n\nAnd every American understands if you get an American supply, we will be energy independent, and the price will come down. It is a case he can make, the Republicans are making it in Congress, but McCain has disarmed himself.\n\nHUME: Do you think there is any chance McCain would switch on that issue?\n\nKRAUTHAMMER: He's got to.\n\nBARNES: If he has a chance to be president, he might switch.\n\nIf you had united Republicans in Congress with the presidential candidate saying exactly what Charles is saying, that Republicans might thwart the cycle and do better than the otherwise would.\n\nHUME: You think it will take that, though?\n\nBARNES: I think it will.\n\nHUME: Do you agree with that, Mort?\n\nKONDRACKE: Yes. One interesting populist note is McCain is tougher on CEO pay than Obama actually is. McCain actually wants stockholders to approve the CEO's compensation package, whereas Obama just wants to have an advisory vote by stockholders.\n\nSo McCain has the populist ground on that one.\n\nHUME: When we return with our panel, Barack Obama says he will not replace one of his advisors over issues about his mortgages. We'll discuss that further in a moment.\n\n(COMMERCIAL BREAK)\n\n(BEGIN VIDEO CLIP)\n\nOBAMA: I am not vetting my V.P. search committee for their mortgages. It is a volunteer, unpaid position. And they're giving me information, and I will then exercise judgment in terms who I want to select as a vice presidential candidate. So these aren't folks who are working for me.\n\nCARLY FIORINA, MCCAIN CAMPAIGN ADVISER: Well, first, I find Barack Obama's statement today that Jim Johnson doesn't work for him naive at best. Of course Jim Johnson works for him.\n\n(END VIDEO CLIP)\n\nHUME: Carly Fiorina, a McCain surrogate, responding there to what Barack Obama said today when he had a question put to him about Jim Johnson, whom we spoke about yesterday.\n\nJim Johnson is, of course, the former Mondale campaign chairman and long-time senior Washington Democrat, highly respected man of discretion, and generally believed to be a man of great integrity, headed the search committee, in addition to what he did for Mondale, also for John Kerry a few years ago.\n\nHe was for a number of years, of course, the head of Fannie Mae, at time in which he made a tremendous fortune. And while he was doing that, one of the companies that Fannie Mae did a lot of business with was Countrywide Mortgage, a company Barack Obama has repeatedly and specifically blamed for the nation's mortgage ills and has specifically singled out the former CEO of that company for his criticism.\n\nIt turns out Jim Johnson received some friendly terms loans from that company, Countrywide, and did so because he was a friend of the CEO. So the question arises is he the right guy to be vetting the candidate, and the real question is, are the answers that Barack Obama given to the questions that have been raised about Jim Johnson, someone we all know and have generally liked and admired over the years, are the answers sufficient — Charles?\n\nKRAUTHAMMER: I don't think it's a Johnson problem, I think it's an Obama problem. Johnson, there is no evidence to date that he has done anything either illegal or improper.\n\nHUME: I know, but is it proper for a guy who is a head of a company, who is farming out business and doing business with another company, to receive loans courtesy — special loans under a program courtesy of the CEO of the company?\n\nKRAUTHAMMER: But we don't know that there were any conditions that were unusual or favorable. Until that is established, then there is no impropriety.\n\nHUME: OK, got it.\n\nKRAUTHAMMER: The Obama problem is this — he is the guy who has two affectations. The first is he rises above politics. He is not a guy who is going to do business, he is going to clear the temple of all the insiders. Well, Johnson is an insider, and, by his own standard, he is getting somebody to help him who is what he has been demonizing for the last six months.\n\nHis other affectation, which he shares with other Democrats, is that when you have a national problem, you blame it on corporations and on individuals in those corporations. Senate Democrats are blaming oil prices on the oil companies and gouging. And Obama, he identifies the crisis as a matter of unfair practices by corporations, and he names them, including Countrywide.\n\nSo he is the one who claims that this large issue, which have to do with a lot of other causes, is a matter of misconduct on the part of corporations. Then, by his standard, he shouldn't be having somebody in his employ who has associations of any kind with those corporations, and specifically with the one corporation that he has demonized.\n\nKONDRACKE: He said today in his statement that Jim Johnson was not somebody that he was putting in his administration.\n\nNow, I think that's significant. Jim Johnson is somebody who has been talked about as a possibility for Treasury Secretary, and he certainly does have the qualifications as somebody who knows the financial markets very well to be Treasury Secretary. But if this kind of association is off limits in the Barack Obama administration, then he can't get people who have got any kind of taint at all connected with them. And this cozy deal with an insider that is a pariah now with Obama could be disqualifying.\n\nWhat's more, the fact that —\n\nHUME: So is his answer going to hold up?\n\nKONDRACKE: Obama's? I don't think. I don't think he will have to get rid of Johnson, but he will have to come up with a better explanation than he is just doing this discreet job over here and I have nothing to do with it.\n\nHUME: He doesn't work for me.\n\nKONDRACKE: Yes, exactly. BARNES: And this is, of course, the biggest decision that Obama will make as a candidate, picking his running mate.\n\nHUME: At this stage, anyway.\n\nBARNES: And at this stage Johnson is running that.\n\nThis story is going to die, and, by the way, we don't know how much under market these loans might have been. We do know they were in a special program of Countrywide, the friends of the president of company, got the special treatment.\n\nBut the only way for this story, I think, to continue — it takes one person to step up and talk very strongly about it, and that's John McCain. His response yesterday was pathetic, and, I mean, he farms out Carly Fiorina. That's not enough.\n\nMcCain has to take it up. If he does, it will have legs. If he doesn't, it's gone.\n\nContent and Programming Copyright 2008 FOX News Network, LLC. ALL RIGHTS RESERVED. Transcription Copyright 2008 Voxant, Inc. (www.voxant.com), which takes sole responsibility for the accuracy of the transcription. ALL RIGHTS RESERVED. No license is granted to the user of this material except for the user's personal or internal use and, in such case, only one copy may be printed, nor shall user use any material for commercial purposes or in any fashion that may infringe upon Fox News Network, LLC'S and Voxant, Inc.'s copyrights or other proprietary rights or interests in the material. This is not a legal transcript for purposes of litigation.",
        "Histogram": [
            0,
            0,
            0.6,
            0,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 14.588360786437988,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Under senator Obama's tax plan, Americans of every background would he see their taxes rise — seniors, parents, small business owners, and just about everyone who has even a modest investment in the market.",
                    "bias_type": "Ad Hominem Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence attacks Senator Obama's tax plan by suggesting it would negatively impact various groups without addressing the substance of the plan itself."
                },
                {
                    "text": "Indeed, Senator Obama says that 95 percent of the people in this country would get a tax cut under his program.",
                    "bias_type": "Cherry Picking Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence selectively highlights a positive aspect of Senator Obama's tax plan without providing a balanced view or considering potential counterarguments."
                },
                {
                    "text": "The biggest problem I have, and I think most people who in favor of a strong economic rebound, is that Obama does not understand capital gains.",
                    "bias_type": "Ad Hominem Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This statement attacks Obama's understanding of capital gains, suggesting incompetence without a detailed analysis of his policy or the substance of his understanding."
                },
                {
                    "text": "Obama said he's not a tax and spend liberal, but he is. I mean, he does want to spend an awful lot of money.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence presents a subjective opinion about Senator Obama's fiscal policy as a fact, blurring the line between objective reporting and personal perspective."
                },
                {
                    "text": "All of that's true. Obama said he's not a tax and spend liberal, but he is. I mean, he does want to spend an awful lot of money.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Similar to the previous sentence, this one asserts a subjective opinion about Senator Obama's fiscal policy as an unquestionable truth."
                },
                {
                    "text": "I wouldn't really bring up '60's and '70's, because nobody under 50 remembers the '60's. in fact, there are a lot of people over 50 who don't remember the '60's either for other reasons.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of dismissive language and a sarcastic tone to downplay historical references introduces bias through the choice of words, influencing the reader's perception."
                },
                {
                    "text": "And, secondly, the '60's was a time of prosperity. And the '70's, Republicans were in office until January of '77. So it's a hard argument to make.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence presents a subjective interpretation of historical events as a counterargument, implying that any opposing view is inherently flawed."
                },
                {
                    "text": "He is stuck in the past. We have to drill in the artic, we have to drill domestically.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the phrase 'stuck in the past' to describe Obama's position on energy policy introduces bias by negatively framing his stance without a balanced discussion."
                },
                {
                    "text": "One interesting populist note is McCain is tougher on CEO pay than Obama actually is. McCain actually wants stockholders to approve the CEO's compensation package, whereas Obama just wants to have an advisory vote by stockholders.",
                    "bias_type": "Comparison Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence introduces bias by favorably comparing McCain's position to Obama's on CEO pay, implying that McCain's approach is inherently superior without a comprehensive analysis."
                },
                {
                    "text": "This story is going to die, and, by the way, we don't know how much under market these loans might have been. We do know they were in a special program of Countrywide, the friends of the president of company, got the special treatment.",
                    "bias_type": "Speculation Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The assertion that 'this story is going to die' and the speculative discussion about the nature of the loans introduce bias by preemptively dismissing the significance of the issue and speculating on its details."
                }
            ],
            "overall_bias": {
                "conclusion": "The article is biased regarding the discussion of Senator Obama's tax plan and related economic policies. It exhibits a general bias tendency through the use of ad hominem attacks, cherry-picking information, opinionated statements presented as facts, speculative discussions, and selective comparisons that favor one perspective over another without a balanced or objective analysis."
            }
        },
        "Scores": {
            "average_bias_strength": 0.5999999999999999,
            "percentage_of_biased_sentences": 0.08064516129032258,
            "overall_rating": 0.34032258064516124
        },
        "combined_score": 0.0
    },
    {
        "Title": "FACTBOX-Five facts about U.S. Democrat Barack Obama",
        "URL": "FACTBOX-Five facts about U.S. Democrat Barack Obama.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    Jan 3 (Reuters) - Barack Obama won the Democratic nominating  contest in Iowa on Thursday, a major step in his bid to beat rival  Hillary Clinton and become their party's presidential pick for the  November general election.      Here are five facts about the Illinois Senator who aims to  become the first black president of the United States:           *Obama's father was born and raised in a village in Kenya; his  mother, who was white, grew up in Kansas.           *Obama grew up in Hawaii and Indonesia. He earned his law  degree from Harvard in 1991 and was the first African-American  president of the Harvard Law Review.           *He is married to wife Michelle and has two young  daughters.           *He was a member of the Illinois State Senate before being  elected to the U.S. Senate. His speech at the Democratic  National Convention in 2004 earned him national attention and  acclaim.           *On issues key to many Democratic voters, Obama favors  withdrawing U.S. troops from Iraq, reducing carbon emissions to  fight climate change, and eliminating tax breaks from companies  that move jobs overseas.            (Writing by Jeff Mason in Washington; editing by Stuart  Grudgings)    ((jeff.mason@reuters.com, +1 202 310 5487, Reuters Messaging:  jeff.mason.reuters.com@reuters.net)       Keywords: USA POLITICS/OBAMA        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 14.406977653503418,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it provides factual information about Barack Obama's background and political positions without using language that implies judgment or promotes a specific narrative."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Obama: End tax breaks for firms that offshore jobs",
        "URL": "Obama: End tax breaks for firms that offshore jobs.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    WASHINGTON, Feb 24 (Reuters) - U.S. President Barack Obama  on Tuesday pledged to end tax breaks for corporations that send  U.S. jobs overseas.      'We will restore a sense of fairness and balance to our tax  code by finally ending the tax breaks for corporations that  ship our jobs overseas,' Obama said in advance excerpts from an  address to a joint session of Congress.   ((E-mail:karey.wutkowski@thomsonreuters.com +1 202 898 8399))  Keywords: OBAMA/TAX        ",
        "Histogram": [
            0,
            0.6,
            0
        ],
        "Relevance": 14.311504364013672,
        "BiasReport": {
            "sentences": [
                {
                    "text": "'We will restore a sense of fairness and balance to our tax  code by finally ending the tax breaks for corporations that  ship our jobs overseas,' Obama said in advance excerpts from an  address to a joint session of Congress.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the phrase 'restore a sense of fairness and balance' implies a judgment that the current tax code is unfair and unbalanced due to the existence of tax breaks for corporations that offshore jobs. This choice of words suggests a negative connotation towards the current tax policy, influencing the reader's perception."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits Word Choice Bias regarding the discussion on tax breaks for corporations that offshore jobs, implying a negative judgment on the current tax policy's fairness and balance."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.3333333333333333,
            "overall_rating": 0.4666666666666667
        },
        "combined_score": 0.0
    }
]