[
    {
        "Title": "Bush makes farewell visit to Iraq",
        "URL": "Bush makes farewell visit to Iraq.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    BAGHDAD, Dec 14 (Reuters) - U.S. President George W. Bush  made an unannounced farewell visit to Baghdad on Sunday, just  weeks before he leaves office and bequeaths the unpopular Iraq  war to President-elect Barack Obama.      'Bush has come to meet Iraqi leaders, thank the troops and  celebrate the new security agreement,' a White House official  said.    ((Reuters Messaging: matt.spetalnick.reuters.com@reuters.net;  +1 202 898 8300, fax +1 202 898 8383))      Keywords: IRAQ/BUSH        ",
        "Histogram": [
            0,
            0,
            0
        ],
        "Relevance": 17.95781707763672,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides a factual report of U.S. President George W. Bush's farewell visit to Baghdad without exhibiting any evident bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Abbas to bid Bush farewell at Washington meeting",
        "URL": "Abbas to bid Bush farewell at Washington meeting.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    RAMALLAH, West Bank, Dec 12 (Reuters) - Palestinian  President Mahmoud Abbas will hold farewell talks with U.S.  President George W. Bush in Washington on Dec. 19, a aide said  on Friday.      'It will be a working meeting that will include a farewell.  They will discuss the peace process,' Palestinian negotiator  Saeb Erekat said.      Bush had hoped to push Israel and the Palestinians towards a  peace deal before he leaves office in January. But all sides  have said that goal cannot be met.   (Writing by Joseph Nasr)   ((joseph.nasr@reuters.com ; +972 2 632 2202; Reuters Messaging:  joseph.nasr.reuters.com@reuters.net))    Keywords: PALESTINIANS ISRAEL/USA       ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 17.460664749145508,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides a straightforward report on Palestinian President Mahmoud Abbas' upcoming meeting with U.S. President George W. Bush in Washington to discuss the peace process, without exhibiting any evident bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Bush to give farewell address on Thursday",
        "URL": "Bush to give farewell address on Thursday.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    WASHINGTON, Jan 12 (Reuters) - U.S. President George W.  Bush will deliver a televised farewell address to Americans on  Thursday night, the White House said on Monday.      Bush, who leaves office on Jan. 20 when Barack Obama is  sworn in, will give a 10-15 minute speech to an audience at the  White House, his press secretary, Dana Perino, said. It will be  Bush's last scheduled public event before he steps down.   ((Reuters Messaging: matt.spetalnick.reuters.com@reuters.net;  +1 202 898 8300))  Keywords: BUSH/SPEECH        ",
        "Histogram": [
            0,
            0,
            0,
            0
        ],
        "Relevance": 17.3283748626709,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it simply reports the factual information about President George W. Bush's scheduled farewell address without introducing any subjective or misleading elements."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "UPDATE 1-Bush to make farewell speech on Thursday",
        "URL": "UPDATE 1-Bush to make farewell speech on Thursday.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": " (Adds details, quote)      WASHINGTON, Jan 12 (Reuters) - U.S. President George W.  Bush will deliver a televised farewell address to the American  people on Thursday night, the White House said.      Bush, who leaves office on Jan. 20 when Barack Obama is  sworn in, will give a 10-15 minute speech in front of an  audience in the East Room of the White House, press secretary  Dana Perino said Monday.      It will be Bush's last scheduled public event before he  steps down, and comes as he tries to burnish a presidential  legacy marked by the unpopular war in Iraq and the worst  financial crisis in nearly 80 years.      'This is not going to be a swan song to the president's  administration, although he will defend his record, but it will  be very gracious to President-elect Obama,' Perino said.      'It's not something where he's trying to refight old  battles. It's a very thoughtful, forward-looking speech in  which the president will share the lessons he learned in office  and his views on the future,' Perino said.      The White House has asked the major television networks for  a slot to broadcast his address, but an exact time has not yet  been set.      Bush's farewell speech will be in keeping with a ritual  followed by his recent predecessors in the White House.   (Reporting by Matt Spetalnick; Editing by Doina Chiacu)      ((Washington newsroom +1 202 898 8300))  Keywords: BUSH/SPEECH        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 16.11383056640625,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides factual information about President George W. Bush's upcoming farewell speech without exhibiting any of the typical signs of bias such as emotional sensationalism, unsubstantiated claims, or discriminatory language."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Israel's Olmert in U.S. to bid farewell to Bush",
        "URL": "Israel's Olmert in U.S. to bid farewell to Bush.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    WASHINGTON, Nov 23 (Reuters) - Israeli Prime Minister Ehud  Olmert began on Sunday a visit to Washington to bid farewell to  President George W. Bush  before the two lame duck leaders leave  office without the Palestinian statehood deal they had sought.      The United States, Israel and the Palestinians have all  acknowledged they will not have a peace accord in place before  Bush vacates the White House in January, missing a target date  set at the Annapolis peace conference a year ago this week.      Bush and Olmert meet on Monday.      Olmert, who resigned in September in a corruption scandal  but remains prime minister until a new government is formed after  Israel's Feb. 1O election, also will meet U.S. Jewish leaders  before departing on Tuesday.      A spokesman for Olmert said that besides taking stock of the  ongoing Israeli-Palestinian peace negotiations, Monday's talks in  the White House will also focus on Iran's nuclear program.      No major announcements are expected after the meeting, but  the spokesman said: 'When the president of the United States and  the prime minister of Israel get together, they always have  serious matters to discuss.'   (Writing by Jeffrey Heller, Editing by Vicki Allen)   ((jeffrey.heller@reuters.com))  Keywords: USA ISRAEL/       ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 15.563607215881348,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it primarily reports on the visit of Israeli Prime Minister Ehud Olmert to bid farewell to President George W. Bush and the acknowledgment that a peace accord will not be achieved before Bush leaves office. The information is presented in a neutral manner without any evident bias towards a particular viewpoint or group."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Bush lands in Russia for farewell summit with Putin",
        "URL": "Bush lands in Russia for farewell summit with Putin.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    SOCHI, Russia, April 5 (Reuters) - U.S. President George W.  Bush arrived in Russia's Black Sea resort of Sochi on Saturday  for a farewell meeting with Russia's President Vladimir Putin  that both leaders hope will polish their legacies.      Bush and Putin will seek to narrow differences over the U.S.  plans for a missile shield in eastern Europe and will work on a  'strategic framework' document mapping out future ties. Bush  will also meet Russia's next president, Dmitry Medvedev.   (Reporting by Matt Spetalnick; writing by Christian Lowe;  editing by Ibon Villelabeitia)   ((christian.lowe@reuters.com; +7 495 775 1242; Reuters  Mesaging: christian.lowe.reuters.com@reuters.net))    Keywords: BUSH RUSSIA/ARRIVAL       ",
        "Histogram": [
            0,
            0,
            0,
            0
        ],
        "Relevance": 15.56091594696045,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it primarily reports on the factual event of U.S. President George W. Bush's arrival in Russia for a meeting with President Vladimir Putin and the discussions they intend to have. The language used is neutral and does not exhibit any of the typical signs of bias such as emotional sensationalism, word choice bias, or unsubstantiated claims."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "UPDATE 2-Bush makes farewell visit to Iraq",
        "URL": "UPDATE 2-Bush makes farewell visit to Iraq.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": " (Adds details, background)      By Matt Spetalnick      BAGHDAD, Dec 14 (Reuters) - U.S. President George W. Bush  made an unannounced farewell visit to Baghdad on Sunday, just  weeks before he leaves office and bequeaths the unpopular Iraq  war to President-elect Barack Obama.      Slipping out of the White House over the weekend, Bush flew  secretly to the Iraqi capital to hold talks with Prime Minister  Nuri al-Maliki and address a rally of U.S. troops.      'Bush has come to meet Iraqi leaders, thank the troops and  celebrate the new security agreement,' a White House official  said.      Bush arrived first by helicopter at the presidential palace  for talks with President Jalal Talabani and his two  vice-presidents. He planned to meet later with Maliki.      Bush's trip -- his fourth to Iraq since the 2003 U.S.-led  invasion -- follows approval of a security pact between  Washington and Baghdad last month that paves the way for U.S.  forces to withdraw by the end of 2011.       Bush was greeted on the heavily guarded tarmac in Baghdad  by General Raymond Odierno and Ambassador Ryan Crocker.      The decision to land in broad daylight reflected confidence  that Baghdad was more secure this time than during Bush's last  visit to the capital in 2006 when sectarian violence was raging.     Though Iraq has slipped down the list of Americans' concerns  as the recession-hit U.S. economy has taken center stage, polls  show most people think the war was a mistake.      It will now be left to Obama, a Democrat and early opponent  of U.S. military involvement in Iraq, to sort out an exit  strategy after he takes office on Jan. 20.      About 140,000 U.S. troops will still be in Iraq nearly six  years into a war that has killed more than 4,200 American  military personnel and tens of thousands of Iraqis.      Bush's visit, just 11 days before Christmas, was a final  chance for him to bid farewell to troops on the ground there.      Mindful of the threat still posed by militants, the White  House kept a tight lid of secrecy on Bush's trip before he  landed at Baghdad International Airport.      His movements were expected to be limited to the heavily  fortified sites in and around the Iraqi capital.      Bush was last in Iraq in September 2007, when he flew into a  U.S. air base in the restive Anbar province to underscore  improved security amid a 30,000-troop buildup and growing  support of Sunni tribal chiefs in the fight against al Qaeda.      Since then, there has been further progress in Baghdad and  elsewhere, and Iraqi security forces are increasingly taking  charge of policing streets and going after militants.            PULLOUT TIMETABLE      U.S. Gen. David Petraeus said last week that violence in  Iraq in the past few weeks had fallen to its lowest level since  mid-2003 and that security gains, while still at risk of  reversal, were less fragile than before. Car bombings and  suicide blasts are still common.      Bush will meet Maliki for the first time since the Iraqi  government won a key concession -- Washington's agreement on a  pullout timetable, something the U.S. president long opposed.      Obama pledged during the campaign to withdraw U.S. combat  troops in 16 months, which will now have to reconciled with the  timetable set in the new security deal.      As he prepares to step down, Bush has insisted toppling  Iraqi dictator Saddam Hussein was the right thing to do.      But he said in a recent ABC interview that the 'big",
        "Histogram": [
            0,
            0.6,
            0,
            0,
            0,
            0.6,
            0,
            0,
            0.6,
            0.5,
            0.6,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 15.45056438446045,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Slipping out of the White House over the weekend, Bush flew secretly to the Iraqi capital to hold talks with Prime Minister Nuri al-Maliki and address a rally of U.S. troops.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'slipping out' and 'flew secretly' implies a negative connotation, suggesting an element of deceit or evasion, which could influence the reader's perception of the action."
                },
                {
                    "text": "Bush's trip -- his fourth to Iraq since the 2003 U.S.-led invasion -- follows approval of a security pact between Washington and Baghdad last month that paves the way for U.S. forces to withdraw by the end of 2011.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'paves the way for U.S. forces to withdraw' implies a positive outcome, suggesting progress and resolution, which could influence the reader's perception of the policy's impact."
                },
                {
                    "text": "Though Iraq has slipped down the list of Americans' concerns as the recession-hit U.S. economy has taken center stage, polls show most people think the war was a mistake.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence includes an opinion ('most people think the war was a mistake') presented as a fact, blurring the line between objective reporting and personal perspective."
                },
                {
                    "text": "It will now be left to Obama, a Democrat and early opponent of U.S. military involvement in Iraq, to sort out an exit strategy after he takes office on Jan. 20.",
                    "bias_type": "Political Bias",
                    "bias_strength": 0.5,
                    "bias_description": "The framing of Obama as 'a Democrat and early opponent of U.S. military involvement in Iraq' could imply a positive bias towards his stance, contrasting it with the previous administration's actions."
                },
                {
                    "text": "About 140,000 U.S. troops will still be in Iraq nearly six years into a war that has killed more than 4,200 American military personnel and tens of thousands of Iraqis.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence uses emotionally charged statistics ('killed more than 4,200 American military personnel and tens of thousands of Iraqis') to evoke a strong emotional response, potentially overshadowing a more balanced discussion."
                },
                {
                    "text": "Mindful of the threat still posed by militants, the White House kept a tight lid of secrecy on Bush's trip before he landed at Baghdad International Airport.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'tight lid of secrecy' conveys a sense of danger or urgency, potentially exaggerating the security concerns and dramatizing the situation."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the portrayal of the U.S. administration's actions and policies in Iraq, with instances of word choice bias, opinionated bias, political bias, and emotional sensationalism bias. The general bias tendency leans towards critiquing the past administration's approach to the Iraq war and highlighting the challenges and negative impacts."
            }
        },
        "Scores": {
            "average_bias_strength": 0.5833333333333334,
            "percentage_of_biased_sentences": 0.045454545454545456,
            "overall_rating": 0.3143939393939394
        },
        "combined_score": 0.0
    },
    {
        "Title": "UPDATE 1-Bush makes farewell visit to Iraq",
        "URL": "UPDATE 1-Bush makes farewell visit to Iraq.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": " (Adds details, background)      By Matt Spetalnick      BAGHDAD, Dec 14 (Reuters) - U.S. President George W. Bush  made an unannounced farewell visit to Baghdad on Sunday, just  weeks before he leaves office and bequeaths the unpopular Iraq  war to President-elect Barack Obama.      Slipping out of the White House over the weekend, Bush flew  secretly to the Iraqi capital to hold talks with Prime Minister  Nuri al-Maliki and address a rally of U.S. troops.      'Bush has come to meet Iraqi leaders, thank the troops and  celebrate the new security agreement,' a White House official  said.      Bush arrived first by helicopter at the presidential palace  for talks with President Jalal Talabani and his two  vice-presidents. He planned to meet later with Maliki.      Bush's trip -- his fourth to Iraq since the 2003 U.S.-led  invasion -- follows approval of a security pact between  Washington and Baghdad last month that paves the way for U.S.  forces to withdraw by the end of 2011.      The brief visit was meant to showcase recent security gains  in Iraq but was also a stark reminder of how heavily the war  will weigh on the Republican president's foreign policy  legacy.      Though Iraq has slipped down the list of Americans'  concerns as the recession-hit U.S. economy has taken center  stage, polls show most people think the war was a mistake.      It will now be left to Obama, a Democrat and early opponent  of U.S. military involvement in Iraq, to sort out an exit  strategy after he takes office on Jan. 20.      About 140,000 U.S. troops will still be in Iraq nearly six  years into a war that has killed more than 4,200 American  military personnel and tens of thousands of Iraqis.      Bush's visit, just 11 days before Christmas, was a final  chance for him to bid farewell to troops on the ground there.      Mindful of the threat still posed by militants, the White  House kept a tight lid of secrecy on Bush's trip before he  landed at Baghdad International Airport.      His movements were expected to be limited to the heavily  fortified sites in and around the Iraqi capital.      Bush was last in Iraq in September 2007, when he flew into  a U.S. air base in the restive Anbar province to underscore  improved security amid a 30,000-troop buildup and growing  support of Sunni tribal chiefs in the fight against al Qaeda.      Since then, there has been further progress in Baghdad and  elsewhere, and Iraqi security forces are increasingly taking  charge of policing streets and going after militants.      U.S. Gen. David Petraeus said last week that violence in  Iraq in the past few weeks had fallen to its lowest level since  mid-2003 and that security gains, while still at risk of  reversal, were less fragile than before. Car bombings and  suicide blasts are still common.      Bush will meet Maliki for the first time since the Iraqi  government won a key concession -- Washington's agreement on a  pullout timetable, something the U.S. president long opposed.      Obama pledged during the campaign to withdraw U.S. combat  troops in 16 months, which will now have to reconciled with the  timetable set in the new security deal.      As he prepares to step down, Bush has insisted toppling  Iraqi dictator Saddam Hussein was the right thing to do.      But he said in a recent ABC interview that the 'biggest  regret' of his presidency was flawed intelligence that Iraq had  weapons of mass destruction. He used that intelligence as a key  justification f",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 15.34133529663086,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it primarily focuses on reporting the details of U.S. President George W. Bush's farewell visit to Iraq and the implications for the Iraq war without employing biased language or presenting information in a skewed manner."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "UPDATE 3-Bush makes farewell visit to Iraq",
        "URL": "UPDATE 3-Bush makes farewell visit to Iraq.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": " (Adds details)      By Matt Spetalnick      BAGHDAD, Dec 14 (Reuters) - U.S. President George W. Bush  made an unannounced farewell visit to Baghdad on Sunday, just  weeks before he leaves office and bequeaths the unpopular Iraq  war to President-elect Barack Obama.      Bush flew secretly to the Iraqi capital to hold talks with  Prime Minister Nuri al-Maliki and address a rally of U.S.  troops.      'Bush has come to meet Iraqi leaders, thank the troops and  celebrate the new security agreement,' a White House official  said.      Bush arrived first by helicopter at the presidential palace  for talks with President Jalal Talabani and his two  vice-presidents. He planned to meet later with Maliki.      Bush's trip -- his fourth to Iraq since the 2003 U.S.-led  invasion -- follows approval of a security pact between  Washington and Baghdad last month that paves the way for U.S.  forces to withdraw by the end of 2011.      The brief visit was meant to showcase recent security gains  in Iraq but was also a stark reminder of how heavily the war  will weigh on the Republican president's foreign policy legacy.      Though Iraq has slipped down the list of Americans' concerns  as the recession-hit U.S. economy has taken center stage, polls  show most people think the war was a mistake.      It will now be left to Obama, a Democrat and early opponent  of U.S. military involvement in Iraq, to sort out an exit  strategy after he takes office on Jan. 20.      About 140,000 U.S. troops will still be in Iraq nearly six  years into a war that has killed more than 4,200 American  military personnel and tens of thousands of Iraqis.      Bush's visit, just 11 days before Christmas, was a final  chance for him to bid farewell to troops on the ground there.      He was greeted on the heavily guarded tarmac in Baghdad by  the top U.S. commander in Iraq, General Ray Odierno, and U.S.  Ambassador Ryan Crocker.      The decision to land in broad daylight reflected confidence  that Baghdad was more secure this time than in Bush's last visit  to the capital in 2006 when sectarian violence was raging.            'REGRET'      Until Air Force One touched down, Bush's trip was conducted  in strictest secrecy. The presidential jet was rolled out of its  giant hangar only after everyone was onboard. Journalists'  electronic devices, from cellphones to iPods, were confiscated  until mid-flight.      Bush, dressed casually and wearing a black baseball cap  after his night-time getaway from the White House, made a rare  appearance in the press cabin just before takeoff.      'Nobody knew who I was,' he joked when an aide complimented  him on his disguise.      His movements were expected to be limited to the heavily  fortified sites in and around the Iraqi capital.      Bush was last in Iraq in September 2007, when he flew into a  U.S. air base in the restive Anbar province to underscore  improved security amid a 30,000-troop build-up and growing  support of Sunni tribal chiefs in the fight against al Qaeda.      Since then, there has been further progress in Baghdad and  elsewhere, and Iraqi security forces are increasingly taking  charge of policing streets and going after militants.      U.S. General David Petraeus said last week that violence in  Iraq in the past few weeks had fallen to its lowest level since  mid-2003 and that security gains, while still at risk of  reversal, were less fragile than before. Car bombings and  suicide blasts are still common.      B",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 15.203010559082031,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to exhibit bias as it primarily reports on the factual details of U.S. President George W. Bush's farewell visit to Baghdad and the current situation in Iraq without employing any of the common bias types."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Albanian town bids sorrowful farewell to Bush",
        "URL": "Albanian town bids sorrowful farewell to Bush.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Benet Koleka      FUSHE-KRUJE, Albania, Jan 17 (Reuters) - At the 'George W.  Bush' cafe in this little Albanian town, owner Festim Cela gives  a solemn reply when asked if it will change its name when the  U.S. President leaves office on Tuesday.      Many beyond U.S. shores may welcome the end of Bush's  presidency, but in zealously pro-American Albania, he is feted  as a hero.      'As long as this building stands, its name will be George W.  Bush,' Cela said as he watched television pictures of Bush's   farewell speech the week before Barack Obama succeeds him.      Below the TV is a table where Bush sat to discuss a  U.S.-funded micro-loan programme with a baker, a barber, a  tailor and a shepherd when he visited Fushe-Kruje on June 10,  2007.      The chairs bear a copper plate with names of Bush and his  wife Laura.      People in Fushe-Kruje said they were sad to see him leave  and cherished the memory of his visit.      Waving and blowing kisses, a shirt-sleeved Bush crossed the  main street from Cela's cafe to Klarita Topi's bakery, where  pictures of his visit hang on the wall.      'His visit was a big blessing for the people of Fushe-Kruje,  for our business and the whole of Albania,' Topi said.      'It was a day of great joy. He got us into NATO, made us  known to the world, and all has gone well for us.'      Topi's bakery and Cela's cafe have turned into landmarks for  Albanians and foreigners keen to see places Bush visited.      Topi, who received a loan under the U.S. programme, said  Albanian migrant workers returning home came to see the shop.  Italian tourists thought the photos were fakes.      'President Bush came to Fushe-Kruje with the independence of  Kosovo. This is a big debt which can never be returned. Thanks  U.S.,' Rasim Qorraj from Decani in Kosovo wrote in a book Cela  keeps at the cafe along with the Albanian, U.S. and EU flags.      Albania, once an isolated state, has blossomed since the  fall of communism in 1990 and now embraces all things Western.      It's people reserve special affection for the United States,  which they credit not only with ending their Cold War isolation  but also for leading NATO in 1999 to rescue the Albanians of  neighboring Kosovo from 'ethnic cleansing' by Serbia.      'Thank you Mr. Bush! Thank you U.S.A.! God Bless U.S. Semper  Fidelis (Always Faithful),' wrote Agim Gashi.      Bush backed Kosovo's independence during the visit and urged  the Kosovo Albanians to be patient. The United States was one of  the first countries to recognize Kosovo's independence in  February 2008.      The visit was also marked by reports Bush lost or had his  watch stolen there but television pictures showed he had given  it to a bodyguard.     'I wish he had another mandate,' Cela said.'      Bush, the first U.S. President to visit the ex-communist  state, dived into a throng of waiting Albanian fans and enjoyed  a rock-star reception.      While meeting the crowd, Bush stopped and embraced  70-year-old Thomaidha Kaziu.      'I started shaking with emotion. There were a lot of people  behind me who wanted to meet him. I was told he said I resembled  his mother. It was a great day for me,' Kaziu said.   (Editing by Angus MacSwan)   ((E-mail:benet.koleka@reuters.com: +355 4 2229824/8,  ReutersMessaging:benet.koleka.reuters.com@reuters.net))    Keywords: BUSH ALBANIA/        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 14.958308219909668,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides a factual account of the sentiments and experiences of the people in Fushe-Kruje, Albania, regarding the visit and impact of George W. Bush, without displaying any evident bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "UPDATE 3-Bush defends troubled record in farewell address",
        "URL": "UPDATE 3-Bush defends troubled record in farewell address.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": " (Updates with speech)      By Matt Spetalnick and Tabassum Zakaria      WASHINGTON, Jan 15 (Reuters) - President George W. Bush on  Thursday defended his actions to avert a collapse of the  financial system and protect America from another terrorist  attack as he mounted a farewell bid to polish his troubled  legacy.      Five days before handing over the presidency to Barack  Obama, Bush delivered a televised final address to the American  people in which he sought to define a White House record that  some historians are already ranking among the worst ever.      But even as he focused on what he saw as his successes,  Bush was preparing to leave Obama with unfinished wars in Iraq  and Afghanistan, a bitter conflict in Gaza, a U.S. economy deep  in recession and a U.S. image badly tarnished overseas.      'Facing the prospect of a financial collapse, we took  decisive measures to safeguard our economy,' Bush said from the  White House, referring to a massive government intervention he  ordered, counter to his free-market roots. 'The toll would be  far worse if we had not acted.'      Trying to reassure recession-weary Americans, Bush said:  'Together, with determination and hard work, we will restore  our economy to the path of growth. We will show the world once  again the resilience of America's free enterprise system.'      Obama has said dealing with the economic meltdown, the  worst financial crisis since the Great Depression and one that  has sent shockwaves across the globe, will be a top priority.      Bush warned, however, that the gravest challenge facing the  incoming president remained the threat of another terrorist  attack like the al Qaeda strikes on Sept. 11, 2001.      He acknowledged that some of his actions in response to  9/11 had been controversial but he stood by them and reasserted  his with-us-or-against-us doctrine widely criticized overseas.      'There is legitimate debate about many of these decisions.  But there can be little debate about the results,' the two-term  Republican said. 'America has gone more than seven years  without another terrorist attack on our soil,' he said.      Some of Bush's actions after the 9/11 attacks, such as  establishing a detention center for terrorism suspects at  Guantanamo and approving harsh interrogation methods that human  rights groups said amounted to torture, severely damaged  America's image abroad. Obama has vowed to close the facility.      'Our enemies are patient, and determined to strike again,'  Bush said in a brief address from the White House with Vice  President Dick Cheney, his Cabinet and several dozen selected  citizens in attendance. 'Good and evil are present in this  world, and between the two there can be no compromise.'           POSITIVE SPIN      With the clock ticking down on his presidency, Bush and his  aides used his last day of public events before Inauguration  Day to try to put a positive spin on his record.      Farewell speeches are a ritual for departing U.S. leaders,  but the stakes are especially high for Bush, who will step down  with one of the lowest public approval ratings of any   president in modern times -- in the mid-20 percent range.      In a final ceremony at the State Department earlier on  Thursday, Bush defended his foreign policy -- from the  unpopular war in Iraq to nuclear standoffs with Iran and North  Korea. 'We have made the world freer,' he said.      Bush touted security gains in Iraq as vindication for a  U.S. tr",
        "Histogram": [
            0.6,
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0.7,
            0.7,
            0,
            0,
            0.6,
            0,
            0,
            0,
            0
        ],
        "Relevance": 14.502131462097168,
        "BiasReport": {
            "sentences": [
                {
                    "text": "President George W. Bush on Thursday defended his actions to avert a collapse of the financial system and protect America from another terrorist attack as he mounted a farewell bid to polish his troubled legacy.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'mounted a farewell bid to polish his troubled legacy' implies a judgment about the nature of his legacy, suggesting it is negative and in need of improvement, which introduces a word choice bias."
                },
                {
                    "text": "But even as he focused on what he saw as his successes, Bush was preparing to leave Obama with unfinished wars in Iraq and Afghanistan, a bitter conflict in Gaza, a U.S. economy deep in recession and a U.S. image badly tarnished overseas.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'unfinished wars', 'bitter conflict', 'deep in recession', and 'badly tarnished' all carry negative connotations, indicating a word choice bias that frames these issues in a particularly negative light."
                },
                {
                    "text": "'Facing the prospect of a financial collapse, we took decisive measures to safeguard our economy,' Bush said from the White House, referring to a massive government intervention he ordered, counter to his free-market roots. 'The toll would be far worse if we had not acted.'",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The statement implies a judgment that the government intervention was necessary, which could be seen as an opinion presented as fact, blurring the line between objective reporting and personal perspective."
                },
                {
                    "text": "Trying to reassure recession-weary Americans, Bush said: 'Together, with determination and hard work, we will restore our economy to the path of growth. We will show the world once again the resilience of America's free enterprise system.'",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'resilience of America's free enterprise system' and the overall tone of reassurance introduces a word choice bias that positively frames the outlook for the American economy."
                },
                {
                    "text": "Bush warned, however, that the gravest challenge facing the incoming president remained the threat of another terrorist attack like the al Qaeda strikes on Sept. 11, 2001.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'gravest challenge' and the reference to the 9/11 attacks are designed to evoke strong emotions, potentially at the expense of a more balanced or nuanced discussion about national security threats."
                },
                {
                    "text": "He acknowledged that some of his actions in response to 9/11 had been controversial but he stood by them and reasserted his with-us-or-against-us doctrine widely criticized overseas.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'with-us-or-against-us doctrine' and the mention of it being 'widely criticized overseas' introduce a word choice bias that frames Bush's approach in a negative light, particularly in the context of international relations."
                },
                {
                    "text": "Some of Bush's actions after the 9/11 attacks, such as establishing a detention center for terrorism suspects at Guantanamo and approving harsh interrogation methods that human rights groups said amounted to torture, severely damaged America's image abroad. Obama has vowed to close the facility.",
                    "bias_type": "Causal Misunderstanding Bias",
                    "bias_strength": 0.7,
                    "bias_description": "This sentence implies a direct causal relationship between Bush's actions and the damage to America's image abroad, without fully exploring the complexities of international perceptions or the broader context of counterterrorism efforts."
                },
                {
                    "text": "With the clock ticking down on his presidency, Bush and his aides used his last day of public events before Inauguration Day to try to put a positive spin on his record.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'try to put a positive spin on his record' suggests a judgment about the nature of the efforts, implying a manipulative or deceptive intent through the choice of words."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the portrayal of President George W. Bush's legacy, particularly in the areas of economic policy, national security, and international relations. The biases are manifested through word choice, opinionation, emotional sensationalism, and causal misunderstanding, indicating a general tendency to frame Bush's presidency in a negative light."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6124999999999999,
            "percentage_of_biased_sentences": 0.3181818181818182,
            "overall_rating": 0.4653409090909091
        },
        "combined_score": 0.0
    },
    {
        "Title": "The Bush Farewell_ The Truth_ the Whole Truth and Nothing But the Truth.txt",
        "URL": "The Bush Farewell_ The Truth_ the Whole Truth and Nothing But the Truth.txt.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Fox_News_Channel_logo.svg/240px-Fox_News_Channel_logo.svg.png",
        "Text": "By Andrea TantarosRepublican Political Commentator/FOXNews.com Contributor\n\nAs I watched President George W. Bush say a final farewell to the nation last night, my emotions were mixed. Though I admired the humility of his speech, I was left to wonder where thatPresident Bush, and that tone, had been hiding for the last eight years. Mysteriously, there was no real acknowledgment of our current economic calamity, or at a minimum the reassurance that the situation was top of mind, and that he and President- elect Obama were working together to ensure a seamless hand off.\n\n[caption id=\"attachment_5553\" align=\"aligncenter\" width=\"300\" caption=\"President George W. Bush gives a farewell address to the nation, Thursday, Jan. 15, 2009, in the East Room of the White House in Washington. (AP Photo/Ron Edmonds)\"][/caption]\n\nWhile he still remains a somewhat popular figure in the Republican Party, Bush has angered many in the GOP, including me. That is not to say I don't respect my President. I do. But Bush and I have something in common: we both are always going to tell you exactly what we think, politically correct or not, no matter whom we tick off.\n\nPresident Bush will largely be known for two things: the decision to invade Iraq and for presiding over the largest and most dramatic expansion of government this country has ever seen, which is a long term threat to liberty.\n\nWhile his compassionate conservatism produced positive results like an unprecedented level of funding to combat AIDS in Africa, it also bought into the notion that it is the federal government's job to provide material success to people -- a terrible premise to operate from.\n\nOn foreign policy, he rightly supported Israel and refused to back down to radical Islamic jihadists. His tough-talkin' cavalier character put the fundamentalists who seek to destroy us on notice, but his second Inaugural was an ideological orgy promoting democracy. As someone who is conservative, I do not want the United States to be a crusader for democracy. That is Napoleonic.\n\nDomestically he saw successes with Medicare Part D and CAFTA, but the back story to each of these successes was filled with late night votes and congressional cloakroom arm twisting. Bush created a massive fault line in the Republican Party with his proposal for easy immigration, and by the time Hurricane Katrina rolled around it seemed as though he given up. He politicized his decision-making by having Karl Rove present in all his policy meetings and he put allegiance above ability when it came to selecting a staff whose modus operandi was insular, bullish, close-minded and off-putting. Sadly, this has left the Republican Party badly bruised, divided and disoriented.\n\nWhile he deserves enormous credit for keeping this country safe, his most overlooked achievements were his admirable positions on the judiciary and the social issues. He genuinely struggled to formulate an ethical position on stem cells. He picked outstanding justices and that is his biggest, untold legacy. He also picked a wife that could arguably be considered the most gracious and respected First Lady in United States' history. Moreover, as a person, he is a man of class and grace, a role model as a father and a man with a genuine conscience. It is hard not to admire him for that reason.\n\nWhen it comes to his legacy, President Bush deserves more credit than he will get, especially when it comes to the mainstream media. In order for Obama to be a success, they must paint Bush as a failure. However, no president is perfect. Bush's biggest downfall was not that his intentions were misguided, it was that he forgot how to communicate with the American people. The last week of one's presidency is a terrible time to remember.",
        "Histogram": [
            0,
            0,
            0.6,
            0,
            0.6,
            0,
            0,
            0,
            0.9,
            0.6,
            0,
            0.9,
            0.9,
            0.9,
            0.6,
            0.6,
            0.9,
            0.9,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6
        ],
        "Relevance": 14.4979248046875,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Mysteriously, there was no real acknowledgment of our current economic calamity, or at a minimum the reassurance that the situation was top of mind, and that he and President- elect Obama were working together to ensure a seamless hand off.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'Mysteriously' implies a judgment about the absence of acknowledgment, suggesting that it was intentionally obscure or unexplained, which influences the reader's perception negatively."
                },
                {
                    "text": "While he still remains a somewhat popular figure in the Republican Party, Bush has angered many in the GOP, including me.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The sentence injects the author's personal opinion ('including me') into what could be a more neutral statement about Bush's standing within the GOP, blurring the line between fact and personal perspective."
                },
                {
                    "text": "President Bush will largely be known for two things: the decision to invade Iraq and for presiding over the largest and most dramatic expansion of government this country has ever seen, which is a long term threat to liberty.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This sentence presents a subjective interpretation of President Bush's legacy as an established fact, without acknowledging differing viewpoints or the complexity of historical analysis, thus heavily biasing the reader's perception."
                },
                {
                    "text": "While his compassionate conservatism produced positive results like an unprecedented level of funding to combat AIDS in Africa, it also bought into the notion that it is the federal government's job to provide material success to people -- a terrible premise to operate from.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'a terrible premise' to describe the approach of compassionate conservatism introduces a strong negative judgment, framing it as inherently flawed without a balanced discussion of its merits and drawbacks."
                },
                {
                    "text": "His tough-talkin' cavalier character put the fundamentalists who seek to destroy us on notice, but his second Inaugural was an ideological orgy promoting democracy. As someone who is conservative, I do not want the United States to be a crusader for democracy. That is Napoleonic.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "The language used to describe President Bush's character and his approach to democracy is highly charged and opinionated, employing phrases like 'tough-talkin' cavalier character' and 'ideological orgy' to convey disapproval and discredit his actions."
                },
                {
                    "text": "Domestically he saw successes with Medicare Part D and CAFTA, but the back story to each of these successes was filled with late night votes and congressional cloakroom arm twisting.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of phrases like 'cloakroom arm twisting' to describe the legislative process introduces a negative connotation, suggesting underhanded or manipulative tactics without a more neutral or comprehensive discussion of the political realities involved."
                },
                {
                    "text": "Bush created a massive fault line in the Republican Party with his proposal for easy immigration, and by the time Hurricane Katrina rolled around it seemed as though he given up.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The assertion that Bush 'created a massive fault line' and 'given up' employs strong language to convey the author's disapproval, framing complex issues in a simplistic and negative light without a balanced exploration of the factors at play."
                },
                {
                    "text": "He politicized his decision-making by having Karl Rove present in all his policy meetings and he put allegiance above ability when it came to selecting a staff whose modus operandi was insular, bullish, close-minded and off-putting. Sadly, this has left the Republican Party badly bruised, divided and disoriented.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "The sentence heavily criticizes President Bush's leadership style and its impact on the Republican Party, using highly negative adjectives like 'insular, bullish, close-minded and off-putting' to describe his staff, which clearly conveys a strong bias through the choice of language."
                },
                {
                    "text": "While he deserves enormous credit for keeping this country safe, his most overlooked achievements were his admirable positions on the judiciary and the social issues. He genuinely struggled to formulate an ethical position on stem cells. He picked outstanding justices and that is his biggest, untold legacy. He also picked a wife that could arguably be considered the most gracious and respected First Lady in United States' history. Moreover, as a person, he is a man of class and grace, a role model as a father and a man with a genuine conscience. It is hard not to admire him for that reason.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This paragraph, while acknowledging some positive aspects of President Bush, is still biased due to its overly positive and idealized portrayal of him, using language that elevates him to an almost mythic status without a balanced examination of his actions and their consequences."
                },
                {
                    "text": "When it comes to his legacy, President Bush deserves more credit than he will get, especially when it comes to the mainstream media. In order for Obama to be a success, they must paint Bush as a failure. However, no president is perfect. Bush's biggest downfall was not that his intentions were misguided, it was that he forgot how to communicate with the American people. The last week of one's presidency is a terrible time to remember.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This statement attributes the perceived lack of credit for President Bush's legacy to a deliberate effort by the mainstream media to undermine him in favor of President Obama, suggesting a conspiratorial bias against Bush without providing evidence for such a claim."
                }
            ],
            "overall_bias": {
                "conclusion": "The article is biased regarding the portrayal of President George W. Bush's presidency, exhibiting a general bias tendency through the use of opinionated language, selective framing of events, and the employment of charged and judgmental word choices to influence the reader's perception."
            }
        },
        "Scores": {
            "average_bias_strength": 0.69,
            "percentage_of_biased_sentences": 0.4482758620689655,
            "overall_rating": 0.5691379310344827
        },
        "combined_score": 0.0
    },
    {
        "Title": "UPDATE 4-Bush makes farewell visit to Iraq",
        "URL": "UPDATE 4-Bush makes farewell visit to Iraq.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": " (Adds quotes after meeting with Talabani, reaction)      By Matt Spetalnick      BAGHDAD, Dec 14 (Reuters) - U.S. President George W. Bush  made a farewell visit to Baghdad on Sunday, flying in secret out  of Washington just weeks before he bequeaths the unpopular Iraq  war to President-elect Barack Obama.      Bush held talks with President Jalal Talabani and Prime  Minister Nuri al-Maliki, and was due to address U.S. troops. He  made a show of the improved security in Baghdad after five years  of sectarian bloodshed by landing in daylight and venturing out  beyond the heavily fortified international Green Zone.      Bush's visit was intended to thank U.S. troops for their  efforts and 'pat the Iraqis on the back for all they've  accomplished this last year', said General Douglas Lute, White  House coordinator for Iraq and Afghanistan.      Bush arrived first by helicopter at the presidential palace  for talks with Talabani and his two vice-presidents.      Talabani called Bush a great friend of the Iraqi people 'who  helped us to liberate our country and to reach this day, which  we have democracy, human rights, and prosperity gradually in our  country'. He said he hoped that friendship would continue when  Bush went back to Texas after leaving the presidency.      Bush's trip -- his fourth to Iraq since the 2003 U.S.-led  invasion -- follows approval of a security pact between  Washington and Baghdad last month that paves the way for U.S.  forces to withdraw by the end of 2011.      Bush, beaming with obvious delight during the meeting with  Talabani, said he had come to herald the passage of the security  pact. 'And the work hasn't been easy, but it has been necessary  for American security, Iraqi hope, and world peace,' he said.      The pact has its critics in Iraq, who doubt the United  States will live up to its promise to leave Iraqi cities by the  end of June next year and withdraw completely by end-2011.      'We reject this visit, as it occurs at a time when Iraq is  still under the U.S. occupation and the U.S army has the upper  hand in controlling the security situation,' said Ahmed  al-Massoudi, a spokesman for the parliamentary bloc loyal to  anti-American Shi'ite cleric Moqtada al-Sadr.      'This visit is a show of force.'            SHOWCASE SECURITY GAINS      The brief visit was meant to showcase recent security gains  in Iraq but was also a stark reminder of how heavily the war  will weigh on the Republican president's foreign policy legacy.      Though Iraq has slipped down the list of Americans' concerns  as the recession-hit U.S. economy has taken center stage, polls  show most people think the war was a mistake.      It will now be left to Obama, a Democrat and early opponent  of U.S. military involvement in Iraq, to sort out an exit  strategy after he takes office on Jan. 20.      About 140,000 U.S. troops will still be in Iraq nearly six  years into a war that has killed more than 4,200 American  military personnel and tens of thousands of Iraqis.      Bush was greeted on the heavily guarded tarmac in Baghdad by  the top U.S. commander in Iraq, General Ray Odierno, and U.S.  Ambassador Ryan Crocker.      The decision to land in broad daylight reflected confidence  that Baghdad was more secure this time than in Bush's last visit  to the capital in 2006 when sectarian violence was raging.      Until Air Force One touched down, Bush's trip was conducted  in strictest secrecy. The presidential jet was rolled out",
        "Histogram": [
            0,
            0,
            0.6,
            0.6,
            0,
            0.6,
            0.6,
            0,
            0.6,
            0.6,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 14.134798049926758,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Bush made a show of the improved security in Baghdad after five years of sectarian bloodshed by landing in daylight and venturing out beyond the heavily fortified international Green Zone.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'made a show' implies a deliberate, possibly insincere, display for the purpose of impressing others, suggesting a judgment about the nature of the visit's intentions."
                },
                {
                    "text": "Bush's visit was intended to thank U.S. troops for their efforts and 'pat the Iraqis on the back for all they've accomplished this last year', said General Douglas Lute, White House coordinator for Iraq and Afghanistan.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the colloquial expression 'pat the Iraqis on the back' can be seen as diminishing the significance of the visit's purpose, implying a condescending or dismissive attitude."
                },
                {
                    "text": "Talabani called Bush a great friend of the Iraqi people 'who helped us to liberate our country and to reach this day, which we have democracy, human rights, and prosperity gradually in our country'. He said he hoped that friendship would continue when Bush went back to Texas after leaving the presidency.",
                    "bias_type": "Mud Praise Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence excessively praises Bush without regard for an objective evaluation, presenting a one-sided and overly positive view of his role in Iraq's development."
                },
                {
                    "text": "Bush, beaming with obvious delight during the meeting with Talabani, said he had come to herald the passage of the security pact. 'And the work hasn't been easy, but it has been necessary for American security, Iraqi hope, and world peace,' he said.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The description of Bush as 'beaming with obvious delight' and the dramatic assertion of the work being 'necessary for American security, Iraqi hope, and world peace' are designed to evoke strong emotions and overstate the significance of the visit."
                },
                {
                    "text": "'We reject this visit, as it occurs at a time when Iraq is still under the U.S. occupation and the U.S army has the upper hand in controlling the security situation,' said Ahmed al-Massoudi, a spokesman for the parliamentary bloc loyal to anti-American Shi'ite cleric Moqtada al-Sadr.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the phrase 'we reject this visit' and the framing of the U.S. presence as 'occupation' with 'the upper hand' in a negative context reflects a biased perspective against the visit and the U.S. role in Iraq."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the portrayal of George W. Bush's visit to Iraq, particularly in the choice of words and the emotional framing of the events and reactions. The biases identified include Word Choice Bias, Mud Praise Bias, and Emotional Sensationalism Bias, all of which contribute to a general bias tendency towards presenting the visit and its significance in a more positive light than may be warranted."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.18181818181818182,
            "overall_rating": 0.3909090909090909
        },
        "combined_score": 0.0
    },
    {
        "Title": "Bush on farewell Europe tour seeks to pressure Iran",
        "URL": "Bush on farewell Europe tour seeks to pressure Iran.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By William Schomberg and Matt Spetalnick      LJUBLJANA, June 10 (Reuters) - U.S. President George W. Bush  goes into his farewell European summit on Tuesday seeking to  work with allies to ratchet up pressure on Iran over its nuclear  programme but still at odds with them over climate change.      Bush is due to meet European Commission President Jose  Manuel Barroso and Janez Jansa, prime minister of current  European Union president Slovenia, before he heads off to the  capitals of Europe's four biggest powers.      Washington and European governments have played down the  chance of dramatic announcements during the visit, which comes  in the twilight of a presidency marked by fierce opposition from  many Europeans to the U.S.-led war in Iraq.      Divisions over Iraq have eased somewhat, even as Europeans  look increasingly past Bush to his successor who will be chosen  in the November election.      Despite that, a draft of the summit statement obtained by  Reuters showed the United States and EU were ready to threaten  extra measures against Iran on top of U.N. sanctions if Tehran  keeps defying demands to suspend sensitive nuclear work.      The U.N. Security Council passed a third sanctions package  against Tehran in April, and Washington has pressed the EU to  deny some Iranian banks access to the world financial system.      EU diplomats have said recently the bloc was prepared to go  beyond the approved sanctions, citing previous travel bans and  asset freezes on Iranian officials.            MORE COOPERATIVE APPROACH      Bush, accused by critics of 'cowboy diplomacy' during much  of his presidency,' has tried to take a more cooperative  approach with allies in his second term. He hopes to forge a  foreign policy legacy defined by more than Iraq.      With low approval ratings at home, Bush acknowledges,  however, he is also unpopular in Europe. 'A lot of people like  America. They may not sometimes necessarily like the president,'  Bush told Slovenia's Pop TV before arriving in Ljubljana late on  Monday.      On climate change, EU policymakers say they have given up  trying to get Washington to join with the bloc in signing up now  for binding cuts of greenhouse gas emissions.      U.S. officials insist that big developing nations such as  China and India have to make similar commitments for the United  States to join in too, and say Europeans hoping for big changes  with a new president will be disappointed.      'Barack Obama and John McCain are very close to the  positions of the administration and there is no difference with  the administration on the need to engage China,' the U.S. envoy  to the EU, C. Boyden Gray, told reporters.      But polls show Europeans are especially fond of Obama, a  Democrat who would be the first black U.S. president, for his  opposition to the Iraq war, which has frayed America's image.      Obama and McCain both win high marks in Europe for calling  for the closing of the Guantanamo military prison where  terrorism suspects are held. Bush says he wants to shut it down  too but only after other arrangements are made for detainees.            THE DOLLAR      Money matters will also figure in Bush's weeklong trip,  which will see stops in Germany, Italy, France and Britain.      He made clear before leaving Washington that he would press  his commitment to a 'strong dollar' -- its weakness is seen as a  barometer of the U.S. economic slowdown -- and his concern about  record oil prices.  ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 13.771164894104004,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Bush, accused by critics of 'cowboy diplomacy' during much of his presidency,' has tried to take a more cooperative approach with allies in his second term. He hopes to forge a foreign policy legacy defined by more than Iraq.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'cowboy diplomacy' is a pejorative term with negative connotations, implying recklessness and unilateral action. The sentence implies a judgment about Bush's earlier approach, suggesting it was not cooperative, and contrasts it with a more positive portrayal of his second-term efforts."
                },
                {
                    "text": "With low approval ratings at home, Bush acknowledges, however, he is also unpopular in Europe. 'A lot of people like America. They may not sometimes necessarily like the president,' Bush told Slovenia's Pop TV before arriving in Ljubljana late on Monday.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence includes Bush's subjective opinion about his unpopularity in Europe, which is presented as a matter of fact. It blurs the line between his personal perspective and an objective assessment of his popularity."
                },
                {
                    "text": "U.S. officials insist that big developing nations such as China and India have to make similar commitments for the United States to join in too, and say Europeans hoping for big changes with a new president will be disappointed.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The sentence implies a judgment about the expectations of Europeans regarding the impact of a new U.S. president on climate change policy. It suggests that these expectations are unrealistic, without presenting evidence or a balanced view."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the portrayal of U.S. President George W. Bush's foreign policy, particularly in the use of word choice and the inclusion of subjective opinions without a balanced perspective. The topics discussed include climate change policy and international relations with a focus on Iran and Europe. The general bias tendency leans towards critiquing Bush's approach and managing expectations for future U.S. leadership without providing a fully objective analysis."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.25,
            "overall_rating": 0.425
        },
        "combined_score": 0.0
    },
    {
        "Title": "Bush farewell trip to paper over cracks with Europe",
        "URL": "Bush farewell trip to paper over cracks with Europe.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By William Schomberg      LJUBLJANA, June 9 (Reuters) - U.S. President George W. Bush  begins a farewell tour of Europe on Monday when he arrives in  Slovenia for an U.S.-EU summit which is expected to gloss over  disputed issues such as climate change.      In a sign of waning ambitions before Bush leaves office, a  row over chicken carcasses is likely to vex transatlantic  advisers at the summit as much as higher profile issues.      The summit is the starting point for a visit which will also  take Bush to Germany, Italy, France and Britain - partners with  whom he has had mixed relations over the past eight years.      European Union officials say differences with Bush's  administration over greenhouse gas emissions are too big to  bother trying to broach yet again when leaders meet at the  summit on Tuesday, just months before Bush stands down.      On other issues such as the Middle East, differences have  been less acute since Bush began his second term, beset by  problems in Iraq following the 2003 invasion, and he has focused  more on cooperating with European allies.      In the absence of geopolitics, a decade-old trade row over  how to wash poultry meat has risen up the summit agenda.      The United States has expressed increasing frustration with  the EU's ban on imports of U.S. poultry, introduced in 1997 over  American producers' use of a low-concentration chlorine wash on  chickens, a practice that is not permitted in Europe.      The ban affects U.S. exports worth at most $300 million a  year, a small fraction of the world's biggest trade  relationship. But U.S. officials have taken it as the test of a  new body designed to smooth a broad range of transatlantic  business.      'Despite the frustrations on the poultry issue which will be  vented at the summit, both sides agree that the Transatlantic  Economic Council is far more important than just the poultry  issue,' an EU official told reporters.      The European Commission has proposed ending the ban, albeit  with strict conditions. But that plan was blocked last week by  national-level veterinary experts, dashing hopes in Brussels for  progress towards settling the dispute before the summit.            NO CHANGE ON CLIMATE      Brussels and Washington will talk about climate change on  Tuesday but they remain at odds over how to tackle the problem.      'The Bush administration is not on the same wavelength as  the EU about the seriousness of the climate change problem and  what to do about it,' the EU official said.      The EU is looking more for signs of what the next president  intends to do on emissions. But Europeans hoping that either  Barack Obama or John McCain will take a sharply new approach are  likely to be disappointed, a senior U.S. official said.      'I don't think they will find the next administration to be  very different on the fundamental disagreement ... the central  question of whether China and other advanced developing  countries need to make a commitment of some level.'      On Iran, Bush will be seeking assurances from the EU that it  will rigorously implement a set of sanctions approved by the  United Nations in April, the U.S. official said.      The EU hoped to persuade Washington to take a less sceptical  view of Syria's potential role in the Middle East peace process,  the EU official said.      The EU side will also renew calls on the United States to  move more quickly to relax visa requirements from citizens of  all EU count",
        "Histogram": [
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 13.76702880859375,
        "BiasReport": {
            "sentences": [
                {
                    "text": "In a sign of waning ambitions before Bush leaves office, a row over chicken carcasses is likely to vex transatlantic advisers at the summit as much as higher profile issues.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the phrase 'waning ambitions' and the choice to highlight 'chicken carcasses' as a point of contention through the word 'vex' implies a judgment and diminishes the significance of the issues being discussed."
                },
                {
                    "text": "The summit is the starting point for a visit which will also take Bush to Germany, Italy, France and Britain - partners with whom he has had mixed relations over the past eight years.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Describing the relations as 'mixed' without further context or explanation introduces a negative connotation, suggesting a lack of harmony or success without providing evidence."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias through the use of word choice, particularly in framing certain issues and relationships in a negative or judgmental light. The topics discussed, such as climate change and trade disputes, are presented with a tendency to diminish their significance or portray them in a negative context."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.05,
            "overall_rating": 0.325
        },
        "combined_score": 0.0
    },
    {
        "Title": "Bush starts five-nation Africa trip in Benin",
        "URL": "Bush starts five-nation Africa trip in Benin.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    COTONOU, Feb 16 (Reuters) - President George W. Bush arrived  in Benin on Saturday to start a five-nation tour of Africa aimed  at highlighting U.S. support for health, education and democracy  in the world's poorest continent.      Air Force One, carrying Bush and his wife Laura, touched  down at Benin's Cadjehoun international airport where the U.S.  leader was due to meet President Thomas Boni Yayi in a brief  stopover before flying on to Tanzania.      Bush is also due to visit Rwanda, Ghana and Liberia during  his six-day trip to Africa, his second to the continent.   (Reporting by Samuel Elijah; Writing by Pascal Fletcher;  Editing by Janet Lawrence)  ((pascal.fletcher@reuters.com; Dakar Newsroom +221 33 864 5076;  Reuters Messaging: pascal.fletcher.reuters.com@reuters.net))    Keywords: AFRICA BUSH/ARRIVE        ",
        "Histogram": [
            0,
            0,
            0,
            0
        ],
        "Relevance": 13.734183311462402,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it primarily reports on the factual event of President George W. Bush's arrival in Benin to start a five-nation tour of Africa, focusing on U.S. support for health, education, and democracy in the continent's poorest regions."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Bush, Putin face tough tasks in farewell summit",
        "URL": "Bush, Putin face tough tasks in farewell summit.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Matt Spetalnick and Oleg Shchedrov      SOCHI, Russia, April 6 (Reuters) - U.S. President George W.  Bush and Russia's Vladimir Putin will have one last chance on  Sunday to try to mend frayed relations face-to-face but with  little hope of resolving the biggest dispute that divides them.      In a farewell summit at the Russian president's Black Sea  holiday villa, the two leaders -- both in the twilight of their  terms -- will use their personal chemistry to try to bridge  differences that have driven ties to a post-Cold War low.      Bush will also hold his first substantive talks with Putin's  protÃ©gÃ© and successor, Dmitry Medvedev, who will be sworn in as  president on May 7.      The summit opened on a positive note after Bush's arrival at  Putin's seaside retreat on Saturday as the two joined in a  Russian folk dance during an informal dinner of red caviar and  veal loin. But once the night's festive mood has worn off, the  leaders still face a long list of grievances.      The thorniest issue is Bush's plan for a U.S. missile shield  based in eastern Europe, a system Washington says is needed to  protect against Iran but Moscow says threatens its security.      After holding out hope a deal on missile defence might be  reached at Sochi, the White House all but ruled that out on the  eve of Sunday's formal talks.      'We're going to have to do more work after Sochi,' White  House spokeswoman Dana Perino said on the Bush's Air Force One  presidential jet as it headed to Russia. She called it  'premature' to predict a deal though negotiations over  compromise proposals were 'headed in the right direction'.      Despite that, Bush hopes to capitalise on a less strident  tone struck by Putin at a NATO summit in Bucharest last week,  where he attacked Western military expansion near Russia's  borders but also implored: 'Let's be friends, guys.'      The two men are expected to sign an agreement on the  'strategic framework' of U.S.-Russian relations, aimed at  encapsulating the legacy they will bequeath to their successors.            'HEART-TO-HEART'      Bush, who leaves office in January, was meeting the Russian  leader seven years after saying he had peered into Putin's soul  and trusted him. Critics had roundly mocked Bush as naÃ¯ve.      Since then, disputes over Kosovo, missile defence and  Russia's rights records have led to talk of a Cold War-style  atmosphere.      Bush says he expects his last heads-of-state meeting with  Putin -- they have met more than 20 times before -- to be  another 'heart-to-heart.'      Showing their rapport was still intact, the two leaders  shared a hug as Bush arrived at Putin's compound and exchanged  jokes as they were briefed on plans for the 2014 Winter Olympic  Games in Sochi, Putin's pet project.      Bush is out to salvage a foreign policy record dominated by  the Iraq war, which has damaged U.S. credibility.      He is also struggling to stay relevant on the world stage  now that his economic stewardship is under fire and attention is  focused on whoever will succeed him in the White House.      For his part, Putin is looking for a smooth transition of  the presidency to Medvedev, elected in a landslide last month  after the Russian leader endorsed him.      Bush had a chance to start forging a bond with Medvedev over  dinner, and will hold separate talks with him on Sunday.      This may give Bush a chance to gauge how much power Putin,  who will become prime minister, will continu",
        "Histogram": [
            0,
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0.9,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 13.572758674621582,
        "BiasReport": {
            "sentences": [
                {
                    "text": "The summit opened on a positive note after Bush's arrival at Putin's seaside retreat on Saturday as the two joined in a Russian folk dance during an informal dinner of red caviar and veal loin. But once the night's festive mood has worn off, the leaders still face a long list of grievances.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The contrast between the 'positive note' and the 'festive mood' with the 'long list of grievances' implies a judgment about the nature of the meeting, suggesting that the positive start was superficial and the underlying issues are significant."
                },
                {
                    "text": "'We're going to have to do more work after Sochi,' White House spokeswoman Dana Perino said on the Bush's Air Force One presidential jet as it headed to Russia. She called it 'premature' to predict a deal though negotiations over compromise proposals were 'headed in the right direction'.",
                    "bias_type": "Speculation Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The statement speculates on the future of negotiations and the direction they are headed without concrete evidence, implying a level of certainty about the outcome that may not be justified."
                },
                {
                    "text": "Despite that, Bush hopes to capitalise on a less strident tone struck by Putin at a NATO summit in Bucharest last week, where he attacked Western military expansion near Russia's borders but also implored: 'Let's be friends, guys.'",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'hopes to capitalize' suggests a strategic or opportunistic approach by Bush, implying a judgment about the sincerity or significance of Putin's remarks."
                },
                {
                    "text": "Bush, who leaves office in January, was meeting the Russian leader seven years after saying he had peered into Putin's soul and trusted him. Critics had roundly mocked Bush as naÃ¯ve.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This sentence includes a subjective opinion about the nature of Bush's statement and its reception, portraying it as a universally accepted critique ('Critics had roundly mocked') rather than a matter of opinion."
                },
                {
                    "text": "Since then, disputes over Kosovo, missile defence and Russia's rights records have led to talk of a Cold War-style atmosphere.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Describing the situation as 'Cold War-style atmosphere' employs a strong, historically charged term to characterize current disagreements, implying a level of conflict and tension that may not be fully justified."
                },
                {
                    "text": "Bush says he expects his last heads-of-state meeting with Putin -- they have met more than 20 times before -- to be another 'heart-to-heart.'",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'heart-to-heart' suggests an intimate and sincere discussion, implying a depth of connection and understanding between the leaders that may not accurately reflect the nature of their relationship or the formality of diplomatic discussions."
                },
                {
                    "text": "Showing their rapport was still intact, the two leaders shared a hug as Bush arrived at Putin's compound and exchanged jokes as they were briefed on plans for the 2014 Winter Olympic Games in Sochi, Putin's pet project.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The emphasis on personal gestures and informal interactions, such as a hug and exchanging jokes, over the substance of the meeting or the issues at hand, sensationalizes the event by focusing on emotional displays rather than diplomatic discussions."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the Bush-Putin summit, particularly through the use of word choice, speculation, opinionation, and emotional sensationalism, which collectively suggest a judgmental and speculative perspective on the nature and outcomes of the meeting."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6428571428571429,
            "percentage_of_biased_sentences": 0.3333333333333333,
            "overall_rating": 0.48809523809523814
        },
        "combined_score": 0.0
    },
    {
        "Title": "UPDATE 8-Bush on farewell visit to Iraq dodges flying shoes",
        "URL": "UPDATE 8-Bush on farewell visit to Iraq dodges flying shoes.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": " (Adds new Bush quote in paragraph 13)      By Matt Spetalnick      BAGHDAD, Dec 14 (Reuters) - An Iraqi reporter called U.S.  President George W. Bush a 'dog' and threw his shoes at him on  Sunday, sullying a farewell visit to Baghdad meant to mark  greater security in Iraq after years of bloodshed.      Just weeks before he bequeaths the unpopular Iraq war to  President-elect Barack Obama, Bush sought to underline improved  security by landing in daylight and venturing out beyond the  city's heavily fortified international Green Zone.      He declared the war 'not over' despite recent gains.      In a sign of lingering anger over the war that will define  the Republican president's foreign policy legacy, an Iraqi  journalist shouted in Arabic 'this is a goodbye kiss from the  Iraqi people, dog,' and hurled his shoes at Bush during a news  conference with Prime Minister Nuri al-Maliki.      Throwing shoes at somebody is a supreme insult in the Middle  East. One of the shoes sailed over the president's head and  slammed into the wall behind him and he had to duck to miss the  other one. Maliki tried to block the second shoe with his arm.      'It's like going to a political rally and have people yell  at you. It's a way for people to draw attention,' Bush said. 'I  don't know what the guy's cause was. I didn't feel the least bit  threatened by it.'      The journalist was leapt on by Iraqi security officials and  U.S. secret service agents and dragged from the room screaming  and struggling.      Bush's fleeting visit to Baghdad was aimed at marking the  recent passage of a U.S.-Iraq security pact that paves the way  for U.S. troops to pull out of Iraqi cities by July next year  and withdraw completely by the end of 2011.      It was also meant to hail a recent sharp fall in the  sectarian violence and insurgency that raged after the 2003 U.S.  invasion to topple Saddam Hussein, and to show support for Iraqi  police and soldiers as they take on increasing responsibility.      Asked whether he had come to Iraq on a victory lap, Bush  said: 'No, I consider it an important step on the road toward an  Iraq that can sustain itself, govern itself and defend itself.'      'There's still more work to be done. The war is not over.'             PRAISE FOR BUSH      Bush thanked U.S. forces for their service in Iraq at a  rally of about 1,500 cheering troops inside Saddam's old al-Faw  palace at the sprawling U.S. military base of Camp Victory.      'The surge is one of the greatest successes in the history  of the U.S. military,' Bush said, referring to the decision to  send an additional 30,000 troops to Iraq last year.      Bush held talks with President Jalal Talabani and Maliki  during the visit. Talabani called Bush a great friend of the  Iraqi people 'who helped us to liberate our country.'      Maliki, who had a strained look on his face after the  shoe-throwing, praised Bush: 'You have stood by Iraq and the  Iraqi people for a very long time, starting with getting rid of  the dictatorship.'      The U.S.-Iraq security pact, which replaces a U.N. mandate  governing the presence of foreign troops, has its critics in  Iraq, some of whom doubt the United States will live up to its  promise to withdraw.      'We reject this visit, as it occurs at a time when Iraq is  still under the U.S. occupation and the U.S army has the upper  hand in controlling the security situation,' said Ahmed  al-Massoudi, a spokesman for the parliamentary bloc loyal ",
        "Histogram": [
            0.6,
            0,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 13.519461631774902,
        "BiasReport": {
            "sentences": [
                {
                    "text": "An Iraqi reporter called U.S.  President George W. Bush a 'dog' and threw his shoes at him on  Sunday, sullying a farewell visit to Baghdad meant to mark  greater security in Iraq after years of bloodshed.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the word 'dog' to insult President George W. Bush carries a strong negative connotation and is a form of ad hominem attack, targeting his character in a derogatory manner."
                },
                {
                    "text": "In a sign of lingering anger over the war that will define  the Republican president's foreign policy legacy, an Iraqi  journalist shouted in Arabic 'this is a goodbye kiss from the  Iraqi people, dog,' and hurled his shoes at Bush during a news  conference with Prime Minister Nuri al-Maliki.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The repetition of the insult using the word 'dog' and the dramatic action of throwing shoes are highlighted to emphasize the depth of anger, portraying the event in a sensationalized manner."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias through the use of word choice, particularly in the derogatory language used to describe the interaction between an Iraqi journalist and U.S. President George W. Bush during his visit to Baghdad. The bias is evident in the sensationalized portrayal of the event and the ad hominem attacks on the president's character."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.041666666666666664,
            "overall_rating": 0.3208333333333333
        },
        "combined_score": 0.0
    },
    {
        "Title": "CORRECTED - Bush on farewell Europe tour seeks to pressure Iran",
        "URL": "CORRECTED - Bush on farewell Europe tour seeks to pressure Iran.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": " (In paragraphs 17 and 20, White House corrects comment to say  health care workers in Africa instead of Afghanistan)      By William Schomberg and Matt Spetalnick      LJUBLJANA, June 10 (Reuters) - U.S. President George W. Bush  goes into his farewell European summit on Tuesday seeking to  work with allies to ratchet up pressure on Iran over its nuclear  programme but still at odds with them over climate change.      Bush is due to meet European Commission President Jose  Manuel Barroso and Janez Jansa, prime minister of current  European Union president Slovenia, before he heads off to the  capitals of Europe's four biggest powers.      Washington and European governments have played down the  chance of dramatic announcements during the visit, which comes  in the twilight of a presidency marked by fierce opposition from  many Europeans to the U.S.-led war in Iraq.      Divisions over Iraq have eased somewhat, even as Europeans  look increasingly past Bush to his successor who will be chosen  in the November election.      Despite that, a draft of the summit statement obtained by  Reuters showed the United States and EU were ready to threaten  extra measures against Iran on top of U.N. sanctions if Tehran  keeps defying demands to suspend sensitive nuclear work.      The U.N. Security Council passed a third sanctions package  against Tehran in April, and Washington has pressed the EU to  deny some Iranian banks access to the world financial system.      EU diplomats have said recently the bloc was prepared to go  beyond the approved sanctions, citing previous travel bans and  asset freezes on Iranian officials.            MORE COOPERATIVE APPROACH      Bush, accused by critics of 'cowboy diplomacy' during much  of his presidency, has tried to take a more cooperative approach  with allies in his second term. He hopes to forge a foreign  policy legacy defined by more than Iraq.      With low approval ratings at home, Bush acknowledges,  however, he is also unpopular in Europe. 'A lot of people like  America. They may not sometimes necessarily like the president,'  Bush told Slovenia's Pop TV before arriving in Ljubljana late on  Monday.      On climate change, EU policymakers say they have given up  trying to get Washington to join with the bloc in signing up now  for binding cuts of greenhouse gas emissions.      U.S. officials insist that big developing nations such as  China and India have to make similar commitments for the United  States to join in too, and say Europeans hoping for big changes  with a new president will be disappointed.      'Barack Obama and John McCain are very close to the  positions of the administration and there is no difference with  the administration on the need to engage China,' the U.S. envoy  to the EU, C. Boyden Gray, told reporters.      But polls show Europeans are especially fond of Obama, a  Democrat who would be the first black U.S. president, for his  opposition to the Iraq war, which has frayed America's image.      Obama and McCain both win high marks in Europe for calling  for the closing of the Guantanamo military prison where  terrorism suspects are held. Bush says he wants to shut it down  too but only after other arrangements are made for detainees.            THE DOLLAR      Money matters will also figure in Bush's weeklong trip,  which will see stops in Germany, Italy, France and Britain.      He made clear before leaving Washington that he would press  his commitment to a 'strong dollar",
        "Histogram": [
            0,
            0,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 13.434292793273926,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Washington and European governments have played down the chance of dramatic announcements during the visit, which comes in the twilight of a presidency marked by fierce opposition from many Europeans to the U.S.-led war in Iraq.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'fierce opposition' carries a negative connotation, implying strong, possibly irrational resistance, and could influence the reader's perception of the European stance on the Iraq war."
                },
                {
                    "text": "Divisions over Iraq have eased somewhat, even as Europeans look increasingly past Bush to his successor who will be chosen in the November election.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'look increasingly past Bush' suggests a dismissive attitude towards Bush's remaining time in office, implying a lack of relevance or importance, which could bias the reader against the current administration."
                },
                {
                    "text": "Despite that, a draft of the summit statement obtained by Reuters showed the United States and EU were ready to threaten extra measures against Iran on top of U.N. sanctions if Tehran keeps defying demands to suspend sensitive nuclear work.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'threaten extra measures' implies a confrontational approach, suggesting a readiness to escalate the situation with Iran, which could bias the reader towards viewing the actions of the U.S. and EU as aggressive."
                },
                {
                    "text": "Bush, accused by critics of 'cowboy diplomacy' during much of his presidency, has tried to take a more cooperative approach with allies in his second term. He hopes to forge a foreign policy legacy defined by more than Iraq.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The term 'cowboy diplomacy' is a pejorative, suggesting reckless or overly aggressive foreign policy, and its use here without context or attribution could bias the reader against Bush's earlier presidency."
                },
                {
                    "text": "With low approval ratings at home, Bush acknowledges, however, he is also unpopular in Europe. 'A lot of people like America. They may not sometimes necessarily like the president,' Bush told Slovenia's Pop TV before arriving in Ljubljana late on Monday.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence highlights Bush's unpopularity without providing a balanced perspective, potentially leading the reader to form a negative opinion of Bush based solely on his personal acknowledgment of his unpopularity."
                },
                {
                    "text": "On climate change, EU policymakers say they have given up trying to get Washington to join with the bloc in signing up now for binding cuts of greenhouse gas emissions.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'have given up' conveys a sense of resignation and implies that the U.S.'s position on climate change is so uncooperative that further efforts are futile, which could bias the reader against the U.S.'s stance."
                },
                {
                    "text": "U.S. officials insist that big developing nations such as China and India have to make similar commitments for the United States to join in too, and say Europeans hoping for big changes with a new president will be disappointed.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The assertion that Europeans will be disappointed implies a negative judgment on the expectations for change with a new U.S. president, suggesting a cynical view of the potential for international cooperation on climate change."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the portrayal of U.S.-European relations during the Bush administration, particularly in the context of the Iraq war and climate change. The bias is predominantly conveyed through the use of word choice, which subtly influences the reader's perception towards viewing the U.S. and its policies in a negative light."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.25,
            "overall_rating": 0.425
        },
        "combined_score": 0.0
    },
    {
        "Title": "UPDATE 7-Bush on farewell visit to Iraq dodges flying shoes",
        "URL": "UPDATE 7-Bush on farewell visit to Iraq dodges flying shoes.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": " (Recasts)      By Matt Spetalnick      BAGHDAD, Dec 14 (Reuters) - An Iraqi reporter called U.S.  President George W. Bush a 'dog' and threw his shoes at him on  Sunday, sullying a farewell visit to Baghdad meant to mark  greater security in Iraq after years of bloodshed.      Just weeks before he bequeaths the unpopular Iraq war to  President-elect Barack Obama, Bush sought to underline improved  security by landing in daylight and venturing out beyond the  city's heavily fortified international Green Zone.      He declared the war 'not over' despite recent gains.      In a sign of lingering anger over the war that will define  the Republican president's foreign policy legacy, an Iraqi  journalist shouted in Arabic 'this is a goodbye kiss from the  Iraqi people, dog,' and hurled his shoes at Bush during a news  conference with Prime Minister Nuri al-Maliki.      Throwing shoes at somebody is a supreme insult in the Middle  East. One of the shoes sailed over the president's head and  slammed into the wall behind him and he had to duck to miss the  other one. Maliki tried to block the second shoe with his arm.      'It's like going to a political rally and have people yell  at you. It's a way for people to draw attention,' Bush said. 'I  don't know what the guy's cause was. I didn't feel the least bit  threatened by it.'      The journalist was leapt on by Iraqi security officials and  U.S. secret service agents and dragged from the room screaming  and struggling.      Bush's fleeting visit to Baghdad was aimed at marking the  recent passage of a U.S.-Iraq security pact that paves the way  for U.S. troops to pull out of Iraqi cities by July next year  and withdraw completely by the end of 2011.      It was also meant to hail a recent sharp fall in the  sectarian violence and insurgency that raged after the 2003 U.S.  invasion to topple Saddam Hussein, and to show support for Iraqi  police and soldiers as they take on increasing responsibility.      Asked whether he had come to Iraq on a victory lap, Bush  said: 'No, I consider it an important step on the road toward an  Iraq that can sustain itself, govern itself and defend itself.'      'There's still more work to be done. The war is not over.'             PRAISE FOR BUSH      Bush held talks with President Jalal Talabani and Maliki at  the presidential palace.      Later, he thanked U.S. forces for their service in Iraq at a  rally of about 1,500 cheering troops inside Saddam's old al-Faw  palace at the sprawling U.S. military base of Camp Victory.      Talabani called Bush a great friend of the Iraqi people 'who  helped us to liberate our country.'      Maliki, who had a strained look on his face after the  shoe-throwing, praised Bush: 'You have stood by Iraq and the  Iraqi people for a very long time, starting with getting rid of  the dictatorship.'      The U.S.-Iraq security pact, which replaces a U.N. mandate  governing the presence of foreign troops, has its critics in  Iraq, some of whom doubt the United States will live up to its  promise to withdraw.      'We reject this visit, as it occurs at a time when Iraq is  still under the U.S. occupation and the U.S army has the upper  hand in controlling the security situation,' said Ahmed  al-Massoudi, a spokesman for the parliamentary bloc loyal to  anti-American Shi'ite cleric Moqtada al-Sadr.      'This visit is a show of force.'      Though Iraq has slipped down the list of Americans' concerns  as the recession-hit U.S. economy ",
        "Histogram": [
            0.6,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0,
            0.5,
            0.5,
            0.5,
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0
        ],
        "Relevance": 13.321442604064941,
        "BiasReport": {
            "sentences": [
                {
                    "text": "An Iraqi reporter called U.S. President George W. Bush a 'dog' and threw his shoes at him on Sunday, sullying a farewell visit to Baghdad meant to mark greater security in Iraq after years of bloodshed.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the word 'dog' to insult President George W. Bush carries a strong negative connotation and is a derogatory term, influencing perceptions negatively."
                },
                {
                    "text": "In a sign of lingering anger over the war that will define the Republican president's foreign policy legacy, an Iraqi journalist shouted in Arabic 'this is a goodbye kiss from the Iraqi people, dog,' and hurled his shoes at Bush during a news conference with Prime Minister Nuri al-Maliki.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Describing the event as a 'goodbye kiss' and the use of the word 'dog' are emotionally charged and designed to provoke a strong reaction, overshadowing the objective reporting of the incident."
                },
                {
                    "text": "Throwing shoes at somebody is a supreme insult in the Middle East. One of the shoes sailed over the president's head and slammed into the wall behind him and he had to duck to miss the other one. Maliki tried to block the second shoe with his arm.",
                    "bias_type": "Cultural Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The emphasis on the significance of throwing shoes as a cultural insult in the Middle East may lead to a misunderstanding or oversimplification of the event's context for readers unfamiliar with this cultural practice."
                },
                {
                    "text": "Bush's fleeting visit to Baghdad was aimed at marking the recent passage of a U.S.-Iraq security pact that paves the way for U.S. troops to pull out of Iraqi cities by July next year and withdraw completely by the end of 2011.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'fleeting' to describe Bush's visit carries a negative connotation, suggesting it was brief and insignificant, which may undermine the importance of the visit and the security pact."
                },
                {
                    "text": "Asked whether he had come to Iraq on a victory lap, Bush said: 'No, I consider it an important step on the road toward an Iraq that can sustain itself, govern itself and defend itself.' 'There's still more work to be done. The war is not over.'",
                    "bias_type": "Political Bias",
                    "bias_strength": 0.5,
                    "bias_description": "The framing of the question as 'on a victory lap' implies a dismissive attitude towards Bush's efforts and suggests a political bias by downplaying the significance of the visit and the ongoing work in Iraq."
                },
                {
                    "text": "Talabani called Bush a great friend of the Iraqi people 'who helped us to liberate our country.'",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Describing Bush as a 'great friend' and crediting him with 'liberating' Iraq presents an opinion as a fact, blurring the line between objective reporting and personal perspective."
                },
                {
                    "text": "Maliki, who had a strained look on his face after the shoe-throwing, praised Bush: 'You have stood by Iraq and the Iraqi people for a very long time, starting with getting rid of the dictatorship.'",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The description of Maliki's facial expression and the emphasis on Bush's long-standing support are subjective details that imply a judgment about the sincerity of Maliki's praise and Bush's actions."
                },
                {
                    "text": "The U.S.-Iraq security pact, which replaces a U.N. mandate governing the presence of foreign troops, has its critics in Iraq, some of whom doubt the United States will live up to its promise to withdraw.",
                    "bias_type": "Speculation Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The sentence introduces doubt about the United States' commitment to withdraw based on the opinions of unnamed critics, engaging in speculation rather than presenting concrete evidence."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the portrayal of the incident involving President George W. Bush's visit to Iraq, with a focus on word choice, emotional sensationalism, cultural bias, political bias, opinionated bias, and speculation bias. The biases are directed towards shaping a negative perception of the event and the individuals involved, particularly through the use of emotionally charged language and speculative assertions."
            }
        },
        "Scores": {
            "average_bias_strength": 0.5874999999999999,
            "percentage_of_biased_sentences": 0.32,
            "overall_rating": 0.45375
        },
        "combined_score": 0.0
    }
]