[
    {
        "Title": "ANALYSIS-Gay marriage 2008: election sideshow or main event?",
        "URL": "ANALYSIS-Gay marriage 2008: election sideshow or main event?.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Ed Stoddard      DALLAS, June 19 (Reuters) - This week's start of gay  marriages in California has pushed a hot-button social issue  into the U.S. presidential campaign, but will it be a sideshow  or a main event?      When voters in California and Florida choose between  presumptive Democratic nominee Barack Obama and Republican John  McCain in November, they will also be asked to weigh amendments  to the state constitutions seeking to ban same-sex marriage.      Such ballot initiatives played a key role in President  George W. Bush's 2004 re-election as they galvanized the  Republican Party's conservative Christian base.      But several key things are very different this year.      The first is McCain. In sharp contrast to Bush, the Arizona  senator is regarded with suspicion by many conservative  evangelicals because of his past lack of support for a federal  ban on same-sex marriage and other 'liberal' offenses.      'McCain is a Republican nominee who has to appeal to the  base but he is much queasier on social issues with the  exception of abortion. He is much less confrontational on  things like gay marriage,' said Cal Jillson, a political  scientist at Southern Methodist University in Dallas.      The evangelical movement, which counts one in four U.S.  adults among its ranks, has also undergone change since 2004 as  it broadens its biblical agenda beyond abortion and gay  marriage to embrace issues like global warming that were  previously seen as causes of the left.           BACK ON THE RADAR      Neither Obama nor McCain have made gay marriage a  centerpiece of their campaigns. Obama, an Illinois senator, has  said states should make their own decisions on marriage but  believes 'same-sex couples should enjoy equal rights under the  law.'      The California Supreme Court has put the issue on the 2008  electoral agenda just when it seemed to have faded far behind  concerns about a recession, the housing crisis, soaring fuel  prices and the war in Iraq.      Same-sex weddings kicked off in California on Monday after  a ruling by the court paved the way for their recognition. And  unlike Massachusetts, the only other state where gay marriage  is legal, California will wed couples from other states.      With or without a staunch religious conservative in the  White House race, this has the 'Religious Right' seeing red.      The Southern Baptist Convention, America's largest  evangelical denomination, last week called on its 400,000  members in California to support the amendment against gay  marriage in November.      But California is viewed as safely Democratic and not seen  tilting Republican because of the issue, although voters could  reject gay marriage in the ballot initiative.      The same cannot be said of Florida, which has a large  evangelical community and where the presidential contest is  shaping up to be tight.      According to the latest Quinnipiac University Swing State  poll released on Wednesday, Obama's lead over McCain in Florida  is 47 percent to 43 percent -- hardly a wide margin.      'Florida is close enough ... that energized social  conservatives could affect the outcome there,' said Jillson.      Social conservatives are gearing up in Florida, where the  amendment needs 60 percent support by voters to pass.      The issue could also heat up elsewhere if a couple from  Kansas or some other heartland state gets married in California  and then demands that local authorities recognize their un",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 22.17848777770996,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to exhibit bias. It provides a factual overview of the impact of gay marriage on the 2008 U.S. presidential campaign without promoting a particular viewpoint or using language that implies judgment."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Calif. gay marriage fundraiser reaches for stars",
        "URL": "Calif. gay marriage fundraiser reaches for stars.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Alex Dobuzinskis      LOS ANGELES, Oct 16 (Reuters) - Battling to save the right  to same-sex marriage in what is expected to be a close state  vote next month, California gay rights backers are turning to  Hollywood celebrities for help at a major fundraiser.      Actress and singer Barbra Streisand is expected at the  event on Tuesday and singers Melissa Etheridge and Mary J.  Blige will perform, organizers said on Thursday.      Supermarket billionaire Ron Burkle will host the event at  his Beverly Hills home, with a private $25,000-a-plate dinner.  Among other entertainment figures planning to attend are  actor/director Rob Reiner.      In recent weeks, director Steven Spielberg and actor Brad  Pitt each donated $100,000 in support of the campaign to  preserve the right to gay marriage.      The fundraiser comes as backers of same-sex marriage fight  to stem a tide of support for Proposition 8, a Nov. 4 ballot  measure that seeks to define marriage under the California  Constitution as only between a man and a woman.      A poll released last week by Survey USA showed 47 percent  of Californians supported the measure, while 42 percent opposed  it.      'We're feeling very good about the surge in the campaign,'  said Sonja Eddings Brown, a spokeswoman for Protect Marriage,  the group advocating for a 'Yes' vote on Proposition 8.      The 'Yes' campaign has raised $25.4 million, compared with  $15.8 million for those who wish to maintain the right to gay  marriage.      In recent weeks, advocates of same-sex marriage have chided  the Hollywood community for failing to contribute cash to the  campaign to defeat Proposition 8.      But Geoff Kors, executive director of Equality California,  said the fundraiser would show Hollywood's support for   same-sex marriage rights.      'Having support from Hollywood leaders who are visible, who  reach a wide audience, is critical to our success,' Kors said.      'It's always really scary when you're being outspent 2 to   1 in an election, and when your rights are at stake and  someone's trying to take your rights away,' he added.      In recent days, opponents of same-sex marriage have stepped  up their television advertising and warned voters that if  Proposition 8 is defeated, children will be taught about gay  marriage in elementary schools.      Gay-marriage supporters call that argument misleading.      In California, an estimated 11,000 same-sex couples have  married since the state's highest court in May overturned a  state ban on same-sex marriage.      Talk show host Ellen DeGeneres and actress Portia de Rossi  wed in August in one the most high-profile same-sex unions.  Etheridge has said she plans to marry girlfriend Tammy Lynn  Michaels before Nov. 4.      DeGeneres released an online video message this week urging  California voters to strike down Proposition 8.      Gay and lesbian marriage was legalized last week in  Connecticut, bringing to three the number of U.S. states that  allow it.  (Reporting by Alex Dobuzinskis: Editing by Jill Serjeant and  Peter Cooney)   ((jill.serjeant1@thomsonreuters.com; +1 213 955 6749))    (To read more about our entertainment news, visit our blog  'Fan Fare' online at http://blogs.reuters.com/fanfare/)       Keywords: USA POLITICS/GAYMARRIAGE       ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 21.778879165649414,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides a factual overview of a fundraiser for the right to same-sex marriage in California, including details about the event and the current state of the campaign, without displaying any evident bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Is Hollywood Blacklisting Supporters of Gay Marriage Ban_.txt",
        "URL": "Is Hollywood Blacklisting Supporters of Gay Marriage Ban_.txt.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Fox_News_Channel_logo.svg/240px-Fox_News_Channel_logo.svg.png",
        "Text": "This is a rush transcript from \"The O'Reilly Factor,\" November 24, 2008. This copy may not be in its final form and may be updated.\n\nWatch \"The O'Reilly Factor\" weeknights at 8 p.m. and 11 p.m. ET and listen to the \"Radio Factor!\"\n\nLAURA INGRAHAM, GUEST HOST: In the \"Personal Story\" segment tonight: According to a report in the L.A. Times, some gay rights supporters in Hollywood may be starting a blacklist against people who supported traditional marriage by giving money to Prop 8 advocates.\n\nJoining us now from Los Angeles is Andrew Breitbart, publisher of Breitbart.com, and one of a handful of conservatives who are brave enough to speak out in Hollywood. Andrew, great to see you.\n\nClick here to watch the segment.\n\nANDREW BREITBART, BREITBART.COM: Hey, Laura. How are you?\n\nINGRAHAM: I remember when George Clooney was telling us that, you know, the biggest threat to mankind, you know, a few decades back was the blacklisting in Hollywood of people who dared to question authority. And so is this actually happening now on the other side of the political fence?\n\nBREITBART: Well, this is a more conspicuous form of blacklisting. It happens for conservatives every single day in Hollywood. This FEC search mechanism is a way that the left, the activist left, not specifically gay groups, because there are a lot of gay people who are against gay marriage. There are a lot of people who think that it should be up for debate.\n\nBut this is the same group of people back in the 1980s, Michelangelo Signorile, who started OutWeek magazine, who started to out people who were actually gay who didn't agree with the activist left agenda for the gay community. So what's happening right now is those schoolyard bullies are back, playing a bigger game on a bigger playground.\n\nINGRAHAM: Right.\n\nBREITBART: Yes.\n\nINGRAHAM: What are they actually doing? What's being done to people who have given to Prop 8? Because I know the San Francisco Chronicle is allowing people who go to their Web site to find out who gave to what Prop 8 groups.\n\nBREITBART: It's there. That's exactly what they are doing. Scott Eckern, who is the musical — the director of the California Musical Theater, had his name initially exposed, and he had to step down. To me that's an effective blacklist.\n\nEl Coyote restaurant in Los Angeles, the floor manager, not the owner but the floor manager, gave $100. And people started to protest El Coyote restaurant. So it's not just about blacklisting. It's blacklisting entire institutions if somebody is associated with it.\n\nMy father-in-law, who was blacklisted in the 1950s for being a communist, is a Christian now, believes in the sanctity of marriage, of the definition between a man and a woman, and they are protesting his theater in Venice, California.\n\nINGRAHAM: So right now there clearly is no real free speech in Hollywood. There's no political free speech. If major Hollywood executives don't speak out against this intimidation, they have no credibility. I don't want to see another movie about the blacklist of the 1940s and '50s. I don't want to see it again coming out of Hollywood. They have no credibility with me. None.\n\nBREITBART: Well, what's so important about this issue right now is that George Clooney is silent, and secondly, President-elect Barack Obama is against gay marriage. Joe Biden, Vice President-elect Joe Biden is against gay marriage. So were Bill and Hillary Clinton when they implemented don't ask, don't tell and the Defense of Marriage Act.\n\nWhat they have done specifically is isolate conservative groups, the Mormon Church, which is safe. I asked Michelangelo Signorile to go down to a local mosque with a group of angry activist left people and to protest the Islamic position on gay marriage. He won't do that.\n\nINGRAHAM: Yes.\n\nBREITBART: And he won't go after President-elect Barack Obama. President-elect Barack Obama has an aggressive attitude towards gay rights in this country, and they allow for him to get away with it.\n\nINGRAHAM: Well, Andrew, that is such a great point about the mosque. I mean, that would show true courage, OK? Go after the black churches and the mosques, and we'll see whether they're actually going to put their money where their mouths are.\n\nAndrew, thanks a lot.\n\nContent and Programming Copyright 2008 FOX News Network, LLC. ALL RIGHTS RESERVED. Transcription Copyright 2008 ASC LLC (www.ascllc.net), which takes sole responsibility for the accuracy of the transcription. ALL RIGHTS RESERVED. No license is granted to the user of this material except for the user's personal or internal use and, in such case, only one copy may be printed, nor shall user use any material for commercial purposes or in any fashion that may infringe upon FOX News Network, LLC'S and ASC LLC's copyrights or other proprietary rights or interests in the material. This is not a legal transcript for purposes of litigation.",
        "Histogram": [
            0,
            0,
            0,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.9,
            0.9,
            0.9,
            0.9,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 21.221912384033203,
        "BiasReport": {
            "sentences": [
                {
                    "text": "According to a report in the L.A. Times, some gay rights supporters in Hollywood may be starting a blacklist against people who supported traditional marriage by giving money to Prop 8 advocates.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the term 'blacklist' carries a negative connotation and implies a judgment about the actions of the gay rights supporters, suggesting a punitive and unjust practice."
                },
                {
                    "text": "Well, this is a more conspicuous form of blacklisting. It happens for conservatives every single day in Hollywood.",
                    "bias_type": "Exaggeration Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The statement exaggerates the prevalence and severity of blacklisting in Hollywood, implying a widespread and constant practice without providing evidence."
                },
                {
                    "text": "This FEC search mechanism is a way that the left, the activist left, not specifically gay groups, because there are a lot of gay people who are against gay marriage. There are a lot of people who think that it should be up for debate.",
                    "bias_type": "Generalization Bias",
                    "bias_strength": 0.9,
                    "bias_description": "The generalization that 'the left, the activist left' uses the FEC search mechanism to target individuals broadly implies a uniform and coordinated effort within a diverse political and social movement."
                },
                {
                    "text": "But this is the same group of people back in the 1980s, Michelangelo Signorile, who started OutWeek magazine, who started to out people who were actually gay who didn't agree with the activist left agenda for the gay community. So what's happening right now is those schoolyard bullies are back, playing a bigger game on a bigger playground.",
                    "bias_type": "Ad Hominem Bias",
                    "bias_strength": 0.9,
                    "bias_description": "Comparing the current actions of some individuals to 'schoolyard bullies' from the 1980s and attributing motives of personal attack and intimidation without a direct comparison or evidence is a clear ad hominem argument."
                },
                {
                    "text": "It's there. That's exactly what they are doing. Scott Eckern, who is the musical — the director of the California Musical Theater, had his name initially exposed, and he had to step down. To me that's an effective blacklist.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of phrases like 'That's exactly what they are doing' and 'To me that's an effective blacklist' is designed to evoke a strong emotional response, emphasizing the perceived severity of the situation."
                },
                {
                    "text": "So right now there clearly is no real free speech in Hollywood. There's no political free speech. If major Hollywood executives don't speak out against this intimidation, they have no credibility.",
                    "bias_type": "Exaggeration Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The absolute statement that 'there clearly is no real free speech in Hollywood' and the call for major Hollywood executives to speak out against 'intimidation' without specifying the nature or extent of such actions exaggerates the situation."
                },
                {
                    "text": "Well, what's so important about this issue right now is that George Clooney is silent, and secondly, President-elect Barack Obama is against gay marriage. Joe Biden, Vice President-elect Joe Biden is against gay marriage. So were Bill and Hillary Clinton when they implemented don't ask, don't tell and the Defense of Marriage Act.",
                    "bias_type": "Whataboutism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The mention of prominent figures' positions on gay marriage, particularly in the context of their silence or past actions, serves to deflect from the main issue by raising different, albeit related, concerns."
                },
                {
                    "text": "What they have done specifically is isolate conservative groups, the Mormon Church, which is safe. I asked Michelangelo Signorile to go down to a local mosque with a group of angry activist left people and to protest the Islamic position on gay marriage. He won't do that.",
                    "bias_type": "Speculation Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The assertion that conservative groups, including the Mormon Church, are 'safe' from criticism, and the hypothetical scenario proposed to Michelangelo Signorile, are speculative and not based on demonstrated actions or statements."
                }
            ],
            "overall_bias": {
                "conclusion": "The article is biased regarding the issue of gay rights and the response to Prop 8 in Hollywood, demonstrating a general bias tendency through the use of word choice, exaggeration, generalization, ad hominem attacks, emotional sensationalism, whataboutism, and speculation."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6749999999999999,
            "percentage_of_biased_sentences": 0.22413793103448276,
            "overall_rating": 0.44956896551724135
        },
        "combined_score": 0.0
    },
    {
        "Title": "Power struggle complicates NY bid for gay marriage",
        "URL": "Power struggle complicates NY bid for gay marriage.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Edith Honan      NEW YORK, Nov 26  (Reuters) - New York is close to becoming  the first U.S. state to pass legislation making gay marriage  legal but, like many political issues in the state capital  Albany, it has fallen victim to a power struggle.      Democrats won a majority in the upper house Senate for the  first time in more than 40 years in the Nov. 4 election, but  three Democratic senators refuse to back fellow Democratic Sen.  Malcolm Smith as majority leader without concessions.      The Republicans could regain their power in the Senate if  the three Democratic senators, who include longtime gay  marriage opponent Sen. Ruben Diaz, opt to vote with them.      'I will not give my vote to a leader that will bring gay  marriage to the state,' Diaz, a Pentecostal minister, said in  an interview. 'Have a voter referendum. Let the people  decide.'      Connecticut and Massachusetts are the only U.S. states that  allow same-sex marriage as a result of court rulings. No state  legislature has instituted gay marriage into law.      After Californian voters passed Prop 8 on Nov. 4 reversing  the state's Supreme Court decision in May to allow same-sex  marriage, the next battleground state for gay mariage is  expected to be New York. The New York Assembly passed a  marriage bill in June 2007 but the Senate has yet to act.      The Senate power struggle has delayed appointment of a  majority leader until January and upset gay rights activists  who believed gay marriage would be legalized once Democrats  took control of the Senate.      Albany has a reputation for bickering and power struggles,  which critics say was demonstrated when the legislature last  week rejected Democratic Gov. David Paterson's emergency budget  cuts for many reasons, including the Senate leadership battle.      Gay marriage has broad support in the Democratic-controlled  lower house, the State Assembly, where it passed in a vote of  85 to 61 last year. It was never put to a vote in the upper  house when the Republicans controlled the Senate.      Paterson, who in May ordered all state agencies to  recognize out-of-state gay marriages, has said he would sign  such a bill into law.      'It's going to happen. It's not an if, it's a when,' said  Sen. Tom Duane, a same-sex marriage campaigner.      Gay rights groups say they are still hopeful New York and  New Jersey legislatures will pass gay marriage bills as soon as  2009 and are unfazed by the New York State Senate leadership  struggle.      'When the dust settles, and we do consider it dust, there  will be a Democratic majority leader who will put forth a  marriage equality bill,' said Marty Rouse, national field  director for Human Rights Campaign, a major U.S. gay rights  group.      Alan Van Capelle, executive director of Empire State Pride  Agenda, said the gay marriage issue had not proven to be toxic  as none of the Republican assembly members who voted for  same-sex marriage in 2007 were voted out of office.      But Duane Motley, executive director of the Christian lobby  group New Yorkers for Constitutional Freedoms, said that even  if Smith is named majority leader, passage of gay marriage is  by no means assured.      'It's not a done deal,' he said. 'The rank and file people  of New York State are not in favor of homosexual marriages.'      Smith has not said publicly how he will handle the gay  marriage issue if he is made majority leader at the next  legislative session in January.      'Re",
        "Histogram": [
            0,
            0.6,
            0,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0.6,
            0.6,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0,
            0
        ],
        "Relevance": 20.900503158569336,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Democrats won a majority in the upper house Senate for the first time in more than 40 years in the Nov. 4 election, but three Democratic senators refuse to back fellow Democratic Sen. Malcolm Smith as majority leader without concessions.",
                    "bias_type": "Political Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence exhibits political bias by portraying the Democratic senators' refusal to support Sen. Malcolm Smith as a power struggle within the Democratic party, suggesting internal disarray and undermining the party's recent electoral victory."
                },
                {
                    "text": "'I will not give my vote to a leader that will bring gay marriage to the state,' Diaz, a Pentecostal minister, said in an interview. 'Have a voter referendum. Let the people decide.'",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This quote from Sen. Ruben Diaz introduces opinionated bias by advocating for a voter referendum on gay marriage, implying that the decision should not be left to legislative processes. This presents a subjective opinion as a valid alternative to the legislative procedure."
                },
                {
                    "text": "After Californian voters passed Prop 8 on Nov. 4 reversing the state's Supreme Court decision in May to allow same-sex marriage, the next battleground state for gay mariage is expected to be New York. The New York Assembly passed a marriage bill in June 2007 but the Senate has yet to act.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The sentence uses emotionally charged language, referring to New York as the 'next battleground state for gay marriage,' which sensationalizes the issue and implies a dramatic conflict, potentially evoking strong emotions in the reader."
                },
                {
                    "text": "Albany has a reputation for bickering and power struggles, which critics say was demonstrated when the legislature last week rejected Democratic Gov. David Paterson's emergency budget cuts for many reasons, including the Senate leadership battle.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the word 'bickering' to describe political disagreements in Albany introduces word choice bias, suggesting trivial or petty arguments rather than substantive policy debates, and undermining the seriousness of the legislative process."
                },
                {
                    "text": "But Duane Motley, executive director of the Christian lobby group New Yorkers for Constitutional Freedoms, said that even if Smith is named majority leader, passage of gay marriage is by no means assured. 'It's not a done deal,' he said. 'The rank and file people of New York State are not in favor of homosexual marriages.'",
                    "bias_type": "Unsubstantiated Claims Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This statement presents the opposition to gay marriage as a widely held and unchallenged view ('the rank and file people of New York State are not in favor of homosexual marriages'), without providing evidence to support the claim, thus introducing unsubstantiated claims bias."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the issue of gay marriage in New York, with multiple instances of political bias, opinionated bias, emotional sensationalism bias, word choice bias, and unsubstantiated claims bias. The general bias tendency leans towards portraying the legislative process and public opinion on gay marriage in a divisive and emotionally charged manner, potentially skewing the reader's perception of the issue."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.38461538461538464,
            "overall_rating": 0.49230769230769234
        },
        "combined_score": 0.0
    },
    {
        "Title": "California's top court ponders gay marriage",
        "URL": "California's top court ponders gay marriage.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Adam Tanner      SAN FRANCISCO, March 4 (Reuters) - Four years after San  Francisco ignited passionate embraces and heated national  debate by briefly allowing gay marriage, California's top court  hears arguments on Tuesday as to whether matrimony should be  limited to a man and a woman.      The hearing brings into focus the highest-profile U.S.  fight over gay rights in recent years and the outcome could end  up influencing legislation and litigation in other states.      San Francisco Mayor Gavin Newsom forced the issue by suddenly  issuing gay marriage licenses in February 2004. More than 4,000  homosexual couples took him up on the offer, including comedian  Rosie O'Donnell and her partner, until a lower court halted the  process.      Later that year California's Supreme Court ruled that  Newsom, mayor of a city long at the forefront of gay rights,  had no authority to wed gays and voided the marriages.      The same court just across the street from City Hall where  the gay marriages took place now decides the larger question  whether California can legally bar same-sex matrimony.      Gay marriage supporters won an initial battle when a  Superior Court judge ruled in their favor in 2005. The  following year a state appeals court judge overruled that  decision and backed existing state law.      Californians in 2000 approved a ballot measure defining  marriage as the union of man and woman. But domestic  partnership legislation as of 2005 gave registered gay couples  many of the same privileges enjoyed by married couples.      Since 2005 California's legislature twice voted to allow gay  marriages, but Gov. Arnold Schwarzenegger, a Republican who is  liberal on many social issues, vetoed the bills, saying voters or  the courts should decide the issue.           UNUSUAL SESSION      It now falls to the seven justices of the California  Supreme Court to resolve the matter, and they have 90 days from  the hearing to issue an opinion. With six of the judges  appointed by Republican governors and one appointed by a  Democrat, the panel is considered politically moderate.      The court has made a rare exception to its one-hour total  limit on oral arguments and will hold a three-hour session.      'I can't recall any where there were three hours of  arguments, I really can't,' Cruz Reynoso told Reuters about his  years as a California Supreme Court justice from 1982-87.      'Not often, but sometimes, oral arguments actually make a  difference in difficult cases and I assume that the court  considers this a difficult case.'      More than half of U.S. states have passed constitutional  amendments barring gay marriage, and President George W. Bush has  proposed a U.S. Constitutional amendment.      State supreme courts in Massachusetts, New Jersey and  Vermont have ruled against limiting marriage to a man and a  woman. Massachusetts responded by becoming the only U.S. state  to allow gay marriage, while New Jersey and Vermont instead  passed civil union laws similar to those in California.      Several other state supreme courts, including those in New  York, Washington and Maryland, found that marriage can be  limited to one man, one woman.    (Editing by Mary Milliken and Eric Walsh)   ((adam.tanner@reuters.com, +1 415-677-2541; Reuters Messaging:  adam.tanner.reuters.com@reuters.net))  Keywords: RIGHTS CALIFORNIA/GAYS        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 20.889175415039062,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides a factual overview of the legal and social context surrounding the debate on gay marriage in California, presenting information from various perspectives without promoting a particular bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Gay marriage votes may show changing U.S.",
        "URL": "Gay marriage votes may show changing U.S..txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Peter Henderson      LOS ANGELES, Nov 2 (Reuters) - Gay couples are not hiding  any more and that has made all the difference, said health care  administrator Linda Merkens before Tuesday's vote in California  that will decide the legality of same-sex marriage there.      It's one of several important ballot measures voters will  face in states across the country on Election Day.      'A lot more gays are more open about their relationships,  and a lot more people are willing to accept it,' Merkens said  in downtown Los Angeles recently.      Other passersby disagreed. 'Same sex marriage is a sin,'  said city planner Kim Chan.      Tuesday's results will show how far attitudes to gay  marriage have changed. Florida and Arizona will join California  in voting on whether to stop gay marriage.      In the past, such propositions have almost always been  approved, but polls show a close finish in California and many  undecided in all three states.      Legal abortion also faces a key challenge as South Dakotans  consider a measure to severely restrict the procedure. If it  passes, opponents are expected to challenge it all the way to  the U.S. Supreme Court. A poll by the state Argus Leader  newspaper showed that vote a toss-up.      Altogether, 150 measures in about 35 states will be put to  the vote on the same day the next U.S. president is chosen,  with other issues ranging from affirmative action to how farm  animals are treated. [ID:nN01396494].      A California court in May rejected limiting marriage to a  man and a woman. Only a few nations and states agree.      Now Hollywood stars like Brad Pitt are facing off with  conservative foes like the fast-growing Mormon church, the  Church of Jesus Christ of Latter-day Saints, over Proposition  8, which would ban same-sex marriage.      Both sides have broad, deep pockets: ban proponents have  raised about $30 million, and opponents recently topped that.           MORE IMPORTANT THAN PRESIDENCY      'This is the most important thing on the November 4th  ballot,' said Tony Perkins, president of the conservative  Family Research Council. 'We've made bad selections as  presidents but survived as a nation. But if we move down the  path towards the dissolution of marriage we cannot divorce  ourselves from the consequences of that.'      Episcopal Bishop Marc Andrus supports gay marriage and said  a ballot loss would slow the process -- not stop it.      Californians in 2000 passed a measure to define marriage as  between a man and a woman. At that time, the San Francisco Bay  Area was the only part of the state that supported gay  marriage, said pollster Mark DiCamillo of the Field Poll.      This year, all the coastal areas support gay marriage, and  support in the inland valleys, which have values similar to the  center of the United States, has grown but remains small.      Los Angeles County had the biggest swing, he said. 'It's  the moderates who have moved,' he said.      John Matsusaka, president of the Initiative and Referendum  Institute at the University of Southern California, said  voters, especially younger ones, were used to homosexuality.     'It doesn't have shock value any more,' Matsusaka said.      A ProtectMarriage.org flyer argues that gay marriage will  be taught in schools if the ban fails, a position their  opponents reject. Same-sex marriage supporters focus on equal  rights for all. 'People you know are asking you to vote no on  Prop. 8' a No on 8 flyer says. ",
        "Histogram": [
            0,
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0.5,
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 20.293664932250977,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Other passersby disagreed. 'Same sex marriage is a sin,' said city planner Kim Chan.",
                    "bias_type": "Discriminatory Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence promotes a generalized and prejudiced statement against same-sex marriage, based on religious beliefs, reinforcing discrimination."
                },
                {
                    "text": "In the past, such propositions have almost always been approved, but polls show a close finish in California and many undecided in all three states.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'almost always' and 'many undecided' implies a judgment and uncertainty that could influence the reader's perception of the situation."
                },
                {
                    "text": "Legal abortion also faces a key challenge as South Dakotans consider a measure to severely restrict the procedure. If it passes, opponents are expected to challenge it all the way to the U.S. Supreme Court. A poll by the state Argus Leader newspaper showed that vote a toss-up.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Describing the vote as a 'toss-up' introduces a subjective and potentially misleading term, suggesting a closer contest than may be the case."
                },
                {
                    "text": "Now Hollywood stars like Brad Pitt are facing off with conservative foes like the fast-growing Mormon church, the Church of Jesus Christ of Latter-day Saints, over Proposition 8, which would ban same-sex marriage.",
                    "bias_type": "Political Bias",
                    "bias_strength": 0.5,
                    "bias_description": "The framing of the conflict as 'Hollywood stars' versus 'conservative foes' introduces a political bias by favoring the perspective of the former over the latter."
                },
                {
                    "text": "'This is the most important thing on the November 4th ballot,' said Tony Perkins, president of the conservative Family Research Council. 'We've made bad selections as presidents but survived as a nation. But if we move down the path towards the dissolution of marriage we cannot divorce ourselves from the consequences of that.'",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of dramatic language such as 'the dissolution of marriage' is designed to evoke strong emotions, potentially at the expense of a balanced discussion."
                }
            ],
            "overall_bias": {
                "conclusion": "The article is biased regarding the topic of same-sex marriage, showing a general bias tendency through discriminatory, word choice, political, and emotional sensationalism biases."
            }
        },
        "Scores": {
            "average_bias_strength": 0.58,
            "percentage_of_biased_sentences": 0.25,
            "overall_rating": 0.415
        },
        "combined_score": 0.0
    },
    {
        "Title": "Gay marriage supporters rally across United States",
        "URL": "Gay marriage supporters rally across United States.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Peter Henderson      SAN FRANCISCO, Nov 15 (Reuters) - Thousands of gay marriage  advocates held boisterous rallies on Saturday across the United  States and abroad in a coordinated protest of California's vote  this month to ban same-sex marriage.      In Manhattan, where some protesters were offering hula-hoop  demonstrations, Sean Petersen, 21, a musician from Brooklyn,  called the vote 'mean-spirited and divisive.'      In Chicago, Andy Thayer, a co-founder of the Gay Liberation  Network, exhorted a crowd that had listened to a gay men's  choir sing a peppy version of the hymn 'Down by the Riverside'  to follow through on the spirit of the protest.      'We can't just let this be a blowing-off-steam rally, as  satisfying as that might be,' he said. 'We're here to win equal  marriage rights right here in Illinois.'      Demonstrations had been organized for Saturday afternoon in  the United States and elsewhere, including Canada, Europe and  Australia, coordinated by a campaign on the Internet.      Los Angeles police estimated 8,000 attended, and thousands  filled the central plaza in San Francisco. Other cities had  crowds estimated in the hundreds or low thousands.      'I am here to protect my marriage and my family,' said  39-year-old Susan Ferris at Los Angeles City Hall.      On Nov. 4, California voters narrowly approved Proposition  8, which defines marriage as between a man and a woman. It  reversed the right of gays and lesbians to marry that had been  granted by the state's Supreme Court this year and triggered a  series of protests.      'A turning point has been reached,' landscape architect  James York, 45, said at the San Francisco rally.           $70 MILLION CAMPAIGN      Measures to ban gay marriage also passed in Florida and  Arizona, while Arkansas barred gay couples from adopting  children.      In 2003, Massachusetts became the first state to legalize  gay marriages. Last month, Connecticut became the second when  the state's top court overturned a ban on same-sex marriage.      The California measure passed by 52 percent after one of  the most expensive ballot campaigns in history in which both  sides combined raised some $70 million.      Gay marriage advocates have asked the California Supreme  Court to overturn the ban, arguing that more than a majority  vote is needed to make a fundamental change in the state  constitution. In May, the court had declared same-sex marriage  a right, unleashing a flood of weddings.      The rallies drew a few opponents of gay marriage.      'We're troubled by the intolerance on their side about what  obviously is the will of the American people,' Peter LaBarbera,  a board member of Protect Marriage Illinois, told Reuters. 'We  think they represent the minority viewpoint.'      Despite the setback in the country's most populous state,  gay marriage advocates said they were upbeat about their cause  in the long run.      'History is on our side,' said Ferris in Los Angeles.   (Reporting by Chris Michaud in New York, Matthew Lewis in  Chicago, Nichola Groom in Los Angeles, Peter Henderson in San  Francisco; Editing by Xavier Briand)   ((Reuters Messaging; peter.henderson.reuters.net@reuters.com,  e-mail peter.henderson@reuters.com, 213 955 6750))     Keywords: GAYMARRIAGE/PROTESTS        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 20.17414665222168,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to exhibit bias. It provides a factual account of the gay marriage supporters' rallies and includes statements from both advocates and opponents without showing a tendency to favor one perspective over the other."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "California set for gay marriage ballot showdown",
        "URL": "California set for gay marriage ballot showdown.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Amanda Beck      SAN FRANCISCO, June 3 (Reuters) - U.S. opponents of gay  marriage pushed their campaign on both coasts this week,  setting it up as a potential hot-button issue in the Nov. 4  elections around the country.      Activists said on Tuesday California was set for its  biggest political battle in years after it was announced the  November ballot would include a constitutional amendment  limiting marriage to unions between men and women.      A similar measure also is on the November ballot in  Florida, which is likely to be closely fought in the election,  and there also are national implications.      'Values voters have even more reason to go to the polls in  2008,' said Tony Perkins, a leading religious conservative who  is president of the Family Research Council.      Initiatives to ban gay marriage played a role in President  George W. Bush's 2004 re-election as they propelled the  Republican Party's conservative Christian base to the polls.      In New York, conservative lawmakers were among those who  filed a suit against Gov. David Paterson on Tuesday, charging  that he overstepped his authority by ordering state agencies to  recognize out-of-state same-sex marriages.      California is scheduled to begin marrying gay couples later  this month but until then, Massachusetts is the only state that  allows same-sex marriage. More than 25 states have  constitutional amendments barring gay marriage.      Although Republican presidential candidate John McCain is  viewed by many religious conservatives as soft on core values  issues, gay marriage could affect turnout where it is on the  ballot.      'Which will actually be a larger draw in California? Will  the presidential choice motivate people or will the issue of  marriage motivate people?' said Ron Prentice, chairman of the  Protect Marriage Coalition, a group of 31 organizations that  are sponsoring the measure in California.      'We believe that this measure on the ballot will actually  bring significantly more people to vote,' he said.           BATTLE IN CALIFORNIA      If more than half of California voters approve the measure,  it would neutralize last month's state Supreme Court ruling  that said preventing same-sex couples from marrying was  unconstitutional and discriminatory.      'This will be the biggest battle on the West Coast since  the recall,' Randy Thomasson, president of the Campaign for  Children and Families in reference to the emotional 2003  election that recalled then-California Gov. Gray Davis.      Gay marriage opponents are urging county officials to  practice civil disobedience by refusing to marry same-sex  couples this month when the marriages are scheduled to begin.      The group behind the California ballot measure expects to  spend at least $10 million campaigning for it.      Gay marriage proponents have said they will match them  dollar-for-dollar. 'We believe that the time has passed that an  amendment like this could survive at the ballot box,' said Kate  Kendall of the National Center for Lesbian Rights.      Polls offer conflicting predictions. A Field poll published  last week showed 51 percent in favor of gay marriage with 42  percent opposed. But a Los Angeles Times poll the previous week  found 54 percent backed the amendment defining marriage as  between a man and a woman with 35 percent opposed.      Evangelical Protestants, who account for one in four  American adults, are especially keen to prohibit gay marriage,",
        "Histogram": [
            0,
            0.6,
            0,
            0.6,
            0.7,
            0,
            0,
            0,
            0,
            0.5,
            0.6,
            0.6,
            0.6,
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 20.120506286621094,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Activists said on Tuesday California was set for its biggest political battle in years after it was announced the November ballot would include a constitutional amendment limiting marriage to unions between men and women.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the phrase 'biggest political battle in years' and the specific framing of the amendment as 'limiting marriage' to certain unions implies a judgment and suggests a significant conflict, influencing the reader's perception."
                },
                {
                    "text": "'Values voters have even more reason to go to the polls in 2008,' said Tony Perkins, a leading religious conservative who is president of the Family Research Council.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The term 'values voters' and the emphasis on 'even more reason' to vote in 2008 suggest a positive framing of the group's actions, implying that their values are under threat and they must act, which can influence the reader's perception of the situation."
                },
                {
                    "text": "Initiatives to ban gay marriage played a role in President George W. Bush's 2004 re-election as they propelled the Republican Party's conservative Christian base to the polls.",
                    "bias_type": "Causal Misunderstanding Bias",
                    "bias_strength": 0.7,
                    "bias_description": "This sentence implies a direct cause-and-effect relationship between the initiatives to ban gay marriage and President George W. Bush's re-election, attributing the outcome solely to this factor without considering other influences."
                },
                {
                    "text": "Although Republican presidential candidate John McCain is viewed by many religious conservatives as soft on core values issues, gay marriage could affect turnout where it is on the ballot.",
                    "bias_type": "Political Bias",
                    "bias_strength": 0.5,
                    "bias_description": "The sentence suggests that John McCain's perceived stance on 'core values issues' is a significant concern for religious conservatives, implying a judgment about the candidate's political position and its impact on voter turnout."
                },
                {
                    "text": "'Which will actually be a larger draw in California? Will the presidential choice motivate people or will the issue of marriage motivate people?' said Ron Prentice, chairman of the Protect Marriage Coalition, a group of 31 organizations that are sponsoring the measure in California.",
                    "bias_type": "Speculation Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This quote speculates on the potential impact of the presidential choice versus the issue of marriage on voter motivation, presenting it as a significant and uncertain factor without concrete evidence."
                },
                {
                    "text": "If more than half of California voters approve the measure, it would neutralize last month's state Supreme Court ruling that said preventing same-sex couples from marrying was unconstitutional and discriminatory.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'neutralize' to describe the potential effect of the voter approval on the Supreme Court ruling introduces a conflict-oriented and judgmental tone, suggesting a power struggle between the voters and the court."
                },
                {
                    "text": "'This will be the biggest battle on the West Coast since the recall,' Randy Thomasson, president of the Campaign for Children and Families in reference to the emotional 2003 election that recalled then-California Gov. Gray Davis.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Describing the upcoming event as 'the biggest battle' and drawing a comparison to a past 'emotional' election using charged language like 'recall' and 'battle' serves to sensationalize and dramatize the issue, influencing the reader's perception."
                },
                {
                    "text": "Gay marriage opponents are urging county officials to practice civil disobedience by refusing to marry same-sex couples this month when the marriages are scheduled to begin.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'civil disobedience' and 'urging' frames the actions of the opponents in a positive, principled light, suggesting a morally justified resistance to an unjust law, which can bias the reader's interpretation of the situation."
                }
            ],
            "overall_bias": {
                "conclusion": "The article is biased regarding the topic of gay marriage, with a general bias tendency towards framing the issue as a significant and contentious battle between opposing values and groups. The use of charged language, speculative statements, and causal misunderstandings contributes to this bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.28,
            "overall_rating": 0.44
        },
        "combined_score": 0.0
    },
    {
        "Title": "UPDATE 1-California's top court ponders gay marriage",
        "URL": "UPDATE 1-California's top court ponders gay marriage.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    (Adds quotes from scene.)      By Adam Tanner      SAN FRANCISCO, March 4 (Reuters) - Four years after San  Francisco ignited a heated national debate by briefly allowing  gay marriage, California's top court hears arguments on Tuesday  about whether matrimony should be limited to a man and a  woman.      The hearing brings into focus the highest-profile U.S.  fight over gay rights in recent years and the outcome could end  up influencing legislation and litigation in other states on a  matter that has been a hot-button issue in election campaigns.      'California's a bellwether state. What happens here, blows  east,' said Larry Bowler, a retired deputy sheriff from  Sacramento, who opposes gay marriage, outside the courthouse.      San Francisco Mayor Gavin Newsom forced the issue by  suddenly issuing gay marriage licenses in February 2004. More  than 4,000 homosexual couples took him up on the offer, before  a lower court halted the process.      California's Supreme Court ruled later that year that  Newsom, mayor of a city long at the forefront of the fight for  gay rights, had no authority to perform weddings for same-sex  couples and voided the marriages.      The same court, just across the street from City Hall,  where the gay marriages took place, now decides the larger  question whether California can legally bar same-sex  matrimony.      'We're married. We're just ready for the state and everyone  else to catch up with us,' said Davina Kotulski, who married  her partner Molly McKay in 2004 at City Hall.      'We're real people and we desire the same rights as  everyone else,' said McKay, who held a bouquet of white roses  as the couple waited to enter the court building.      Gay marriage supporters won an initial battle when a  Superior Court judge ruled in their favor in 2005. The  following year a state appeals court judge overruled that  decision and backed existing state law.      Californians in 2000 approved a ballot measure defining  marriage as the union of man and woman. But domestic  partnership legislation as of 2005 gave registered gay couples  many of the same privileges enjoyed by married couples.      California's legislature has voted twice since 2005 to  allow gay marriages, but Gov. Arnold Schwarzenegger, a  Republican, vetoed the bills, saying voters or the courts  should decide the issue.           UNUSUAL SESSION      It now falls to the seven justices of the California  Supreme Court to resolve the matter, and they have 90 days from  Tuesday's hearing to issue an opinion. Six of the judges were  appointed by Republican governors and one by a Democrat and the  panel is considered politically moderate.      The court made a rare exception to its one-hour total limit  on oral arguments for the gay marriage case and was to hold a  three-hour session.      'Not often, but sometimes, oral arguments actually make a  difference in difficult cases and I assume that the court  considers this a difficult case,' Cruz Reynoso, a professor of  law emeritus at the University of California Davis School of  Law, who was a California Supreme Court justice from 1982-87.      More than half of U.S. states have passed constitutional  amendments barring same-sex marriage, and President George W.  Bush has proposed a U.S. Constitutional amendment to do so.      State supreme courts in Massachusetts, New Jersey and  Vermont have ruled against limiting marriage to a man and a  woman. Massachusetts became the only U.S. state",
        "Histogram": [
            0,
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 19.867080688476562,
        "BiasReport": {
            "sentences": [
                {
                    "text": "'California's a bellwether state. What happens here, blows east,' said Larry Bowler, a retired deputy sheriff from Sacramento, who opposes gay marriage, outside the courthouse.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'bellwether state' and the use of 'blows east' carry connotations of significance and influence, implying a judgment about the impact of California's decisions on other states, which could influence perceptions."
                },
                {
                    "text": "'We're married. We're just ready for the state and everyone else to catch up with us,' said Davina Kotulski, who married her partner Molly McKay in 2004 at City Hall.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'catch up with us' implies a judgment that the state and others are behind or lagging in their recognition of the marriage, suggesting a perspective that frames the issue as a matter of progress."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the topic of gay marriage, particularly in the way it frames the significance of California's decisions and the progression of marriage rights, with a general bias tendency towards portraying the issue as a matter of influence and progress."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.15384615384615385,
            "overall_rating": 0.3769230769230769
        },
        "combined_score": 0.0
    },
    {
        "Title": "UPDATE 2-Connecticut court allows gay marriage",
        "URL": "UPDATE 2-Connecticut court allows gay marriage.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": " (Recasts, changes dateline, adds new details throughout)      By Ted Lorson      HARTFORD, Conn., Oct 10 (Reuters) - Connecticut's highest  court on Friday unexpectedly struck down a ban on gay and  lesbian marriage, making the New England state the third in the  nation to allow full-fledged marriage for same-sex couples.      After four years of legal wrangling in the state court  system, the Connecticut Supreme Court ruled 4-3 that a ban on  gay marriage constituted 'cognizable harm' and infringed on a  'fundamental right' of same-sex couples.      The decision, which overturns a lower court ruling, follows  the legalization of gay marriage in California this year and in  Massachusetts in 2003. It was hailed by gay rights advocates as  a proud day after battles over the culturally divisive issue in  several states.      Connecticut Gov. Jodi Rell, a Republican, disagreed with  the ruling but said she will uphold it.      'I continue to believe that marriage is the union of a man  and a woman,' Rell said. 'I do not believe their voice reflects  the majority of the people of Connecticut.'      She said she was convinced that any attempt to reverse the  decision, either legislatively or by amending the state  Constitution, would fail.      The decision came as a surprise after previous courts  upheld the ban and lawmakers wrote specific language into a  civil union measure defining marriage as between men and  women.      Connecticut was one of four U.S. states that permits  same-sex civil unions that grant rights such as insurance  coverage, tax benefits and hospital visitations. But these lack  the full, federal legal protections of marriage.      Opponents of gay marriage said they would seek to overturn  the ruling by persuading voters to support a ballot measure   next month that would open a state constitutional convention to  address the issue of same-sex marriage.      'Then we will put a question on the ballot to allow the  public, not our robed masters, to decide once and for all if  marriage will be protected in our state constitution as the  union between a man and a woman,' said Peter Wolfgang,  president of the Family Institute of Connecticut, a  conservative Christian group.        'WE ARE OVERJOYED'      The plaintiffs in the case -- eight same-sex couples --  challenged the lower court's ruling that civil unions give  same-sex couples the same rights and protections as marriage.      They argued that their constitutional rights were denied  when they were barred from getting marriage licenses.      'We are overjoyed to tell our twin boys that we will be  married, just like their friends' parents,' Beth Kerrigan and  Jodie Mock, two plaintiffs in the case, said in a statement.      The date when the decision takes effect depends on a trial  court order that is expected after Oct. 28, said Connecticut  Attorney General Richard Blumenthal.      'It won't take effect immediately but probably in the next  month or so,' he said in a telephone interview.      When Massachusetts' top court overturned a ban on gay  marriage in 2003, opposition was so strong that it drove  religious conservatives to the polls in 2004, a factor in the  re-election of President George W. Bush.      But this year, just three weeks before the U.S.  presidential election, national reaction was relatively muted  as the news fought for air time with turmoil in financial  markets, tumbling stock prices and signs of a possible global  recession.      More",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 19.79655647277832,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It presents the information about the Connecticut court's decision on gay marriage in a factual and neutral manner, without showing any evident bias towards any particular viewpoint."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Ellen buys $100,000 TV time to support gay marriage",
        "URL": "Ellen buys $100,000 TV time to support gay marriage.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    LOS ANGELES, Oct 17 (Reuters) - Comedian Ellen DeGeneres  has bought $100,000 of television airtime to urge Californians  to vote to save the right to gay marriage in a November ballot,  campaign organizers said on Friday.      Claiming that opponents of gay marriage are twisting the  truth and trying to scare voters, DeGeneres will appeal in a  television ad to vote for equality, compassion and fairness.      The chat show host and comic actress wed her long time  partner, actress Portia de Rossi, in August in the most  high-profile same-sex marriage since such unions were declared  legal in California in May.      Her message will be broadcast on television as celebrities  step up the fight to defeat Proposition 8 on the Nov.4 state  ballot that seeks to define marriage under the California  constitution as only between a man and a woman.      'Hi, I'm Ellen DeGeneres.  I got to do something this year  I never thought I'd ever be able to do: I got married. It was  the happiest day of my life. There are people out there raising  millions of dollars to try and take that right away from me.      'You've seen their ads on TV. They're twisting the truth,  and they're trying to scare you. I believe in fairness.  I  believe in compassion. I believe in equality for all people.  Proposition 8 does not. Please, please, vote no on Prop. 8,'  the actress says in her appeal.      In recent weeks, opinion polls have shown a swing in the  number of Californians who oppose same-sex marriage. Their  campaign has raised $25.4 million, compared with $15.8 million  for those who wish to maintain the right to gay marriage.      Opponents of same-sex marriage have stepped up their  television advertising, warning that children will be taught  about gay marriage in elementary schools.      Gay-marriage supporters call that argument misleading.      Singers Melissa Etheridge, who plans to marry partner Tammy  Tammy Lynn Michaels, and Mary J. Blige will perform at a  $25,000-a-plate dinner in Beverly Hills on Tuesday in support  of the 'No' campaign.   (Reporting by Jill Serjeant)   ((jill.serjeant1@thomsonreuters.com; +1 213 955 6749))    (To read more about our entertainment news, visit our blog  'Fan Fare' online at http://blogs.reuters.com/fanfare/)  Keywords: PEOPLE ELLEN       ",
        "Histogram": [
            0,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0,
            0.6,
            0.6,
            0.6,
            0.7,
            0.7,
            0,
            0
        ],
        "Relevance": 19.765840530395508,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Claiming that opponents of gay marriage are twisting the truth and trying to scare voters, DeGeneres will appeal in a television ad to vote for equality, compassion and fairness.",
                    "bias_type": "Ad Hominem Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence attacks the character and motives of the opponents of gay marriage by accusing them of 'twisting the truth' and 'trying to scare voters' without addressing the substance of their arguments."
                },
                {
                    "text": "'You've seen their ads on TV. They're twisting the truth, and they're trying to scare you. I believe in fairness. I believe in compassion. I believe in equality for all people. Proposition 8 does not. Please, please, vote no on Prop. 8,' the actress says in her appeal.",
                    "bias_type": "Ad Hominem Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Ellen DeGeneres' statement directly accuses the proponents of Proposition 8 of 'twisting the truth' and 'trying to scare' voters, targeting their character and motives rather than addressing the specifics of the proposition."
                },
                {
                    "text": "In recent weeks, opinion polls have shown a swing in the number of Californians who oppose same-sex marriage. Their campaign has raised $25.4 million, compared with $15.8 million for those who wish to maintain the right to gay marriage.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the word 'swing' in describing the change in opinion polls implies a judgment that a shift away from supporting same-sex marriage is negative, suggesting a bias in favor of the position supporting gay marriage."
                },
                {
                    "text": "Opponents of same-sex marriage have stepped up their television advertising, warning that children will be taught about gay marriage in elementary schools. Gay-marriage supporters call that argument misleading.",
                    "bias_type": "Causal Misunderstanding Bias",
                    "bias_strength": 0.7,
                    "bias_description": "This sentence implies that the opponents' concern about children being taught about gay marriage in schools is a misunderstood or misleading argument, without providing a balanced view or evidence to support the claim that it is indeed misleading."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the topic of gay marriage, with a general tendency to discredit the arguments of those opposed to gay marriage through ad hominem attacks, word choice, and causal misunderstanding, while presenting the supporters' perspective more favorably."
            }
        },
        "Scores": {
            "average_bias_strength": 0.625,
            "percentage_of_biased_sentences": 0.5,
            "overall_rating": 0.5625
        },
        "combined_score": 0.0
    },
    {
        "Title": "Connecticut court overturns gay marriage ban",
        "URL": "Connecticut court overturns gay marriage ban.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    BOSTON, Oct 10 (Reuters) - The Connecticut Supreme Court  overturned a ban on same-sex marriage on Friday in a victory  for gay-rights advocates that will allow couples to marry in  the New England state.      The court found that the state's law limiting marriage to  heterosexual couples discriminates on the basis of sexual  orientation.      Connecticut is now the third state in the country to allow  gay marriage, following neighboring Massachusetts, the first  state to allow it, and California.      Connecticut already permitted same-sex civil unions that  grant largely the same state rights as to married couples, but  lack the full, federal legal protections of marriage.   (Reporting by Svea Herbst-Bayliss)   ((Svea.Herbst@Reuters.com; +1 617 856 4331; Reuters Messaging:  svea.herbst.reuters.com@reuters.net))  Keywords: GAYMARRIAGE/CONNECTICUT        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 19.71396255493164,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides a factual report on the Connecticut Supreme Court's decision to overturn the ban on same-sex marriage, including relevant context about the state's position in relation to gay marriage. The language used is neutral and does not exhibit any of the typical signs of bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Gay marriage backers set 'Day Without a Gay' event",
        "URL": "Gay marriage backers set 'Day Without a Gay' event.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Peter Henderson      SAN FRANCISCO, Dec 9 (Reuters) - Same-sex marriage  advocates plan to 'Call in gay' on Wednesday in a protest  designed to show Americans how big a part of daily life -- and  the economy -- gays and their supporters are.      The Internet-organized project, which follows California's  passage of anti-same-sex-marriage Proposition 8, urges 'Day  Without a Gay' participants to skip work and volunteer in the  community.      The idea is creating a controversy over how to garner  support without protesters hurting their cause.      Californians struck down same-sex marriage last month,  reversing a court decision that had affirmed the right. The  Nov. 4 vote stopped gay unions in California -- one of a  handful of states, provinces and mostly European countries that  allowed it.      After the vote, protest marches targeted U.S. temples of  the Church of Jesus Christ of Latter-day Saints, the Mormons,  who were top supporters of California Proposition 8, which  limits marriage to a man and a woman. That led to a nationwide  protest day on Nov. 15.      'In order for this movement to continue it can't just be  about marching and being pissed off. It's got to be creative in  different ways to get into the hearts and minds of moderate  voters,' said daywithoutagay.org creator Sean Hetherington.      The Los Angeles comedian and his boyfriend, Aaron Hartzler,  put the focus on volunteering, although one of the groups  behind the Nov. 15 rallies, jointheimpact.com, urges people to  shut businesses and avoid spending anything.      The protest appears inspired by the 2004 film 'A Day  Without a Mexican' which imagines the effect on California of a  day when there are no Latinos, leading to chaos on the state.   (Editing by Mohammad Zargham)   ((Reuters Messaging: peter.henderson.reuters.com@reuters.net;  email: peter.henderson@reuters.com; +1 415 677 2541))  Keywords: GAYMARRIAGE/PROTEST        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 19.71150016784668,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to exhibit bias. It provides a factual overview of the 'Day Without a Gay' event and the context surrounding it without employing any of the typical bias types."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Hollywood urged to give more to save gay marriage",
        "URL": "Hollywood urged to give more to save gay marriage.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Jill Serjeant      LOS ANGELES, Oct 2 (Reuters) - Hollywood, long considered a  bastion of liberal thinking, is being chided for not opening  its wallet to save the right to same-sex marriage in California  even as several A-list gays and lesbians rush to the altar.      With a month to go before a Nov. 4 referendum seeking to  abolish the newly won right of same-sex couples to marry in  California, some in the entertainment community are anxious  that more of their own are not supporting gay rights by  donating money to defeat the proposed ban.      So far, the largest celebrity donations have come from  actor Brad Pitt and director Steven Spielberg who each  contributed $100,000 each last month to help defeat the ballot  proposal, known as Proposition 8.      'We are concerned that the entertainment industry hasn't  stepped up to the plate to fight this unnecessary initiative  ... Now it's time for the entertainment industry as a whole to  take the lead,' activist Jonathan Lewis said on Wednesday.      Lewis, an entrepreneur from Ohio, said his family would  match the next $500,000 that entertainment industry leaders  contribute to the 'No on Prop 8' campaign.      Hundreds of gays and lesbians have married since a May  decision by the California Supreme Court overturning a state  ban on same-sex marriage.      But opponents of the ruling put the issue up for a  state-wide referendum that seeks to amend the California  constitution to allow marriage only between a man and a woman.      Recent opinion polls show that 38 percent of California  voters would support a ban on same-sex marriage with 55 percent  opposed. But supporters of the ban, including several religious  and conservative groups, have edged ahead in fund-raising.        CELEBRITY SIDE EFFECTS      By late September, opponents of gay marriage had raised  $14.7 million, while supporters brought in $13.5 million,  according the official records.      An article in the Los Angeles gay magazine In-LA last month  headlined 'Mega A-Gays Missing in Fight Against Prop 8' noted  that state records show Ellen DeGeneres, Portia de Rossi,  Melissa Etheridge, Rosie O'Donnell and international gays such  as Elton John have not contributed any cash.      But many in Hollywood also argue that the high-profile  wedding of popular chat show host DeGeneres to actress de Rossi  in August brought the kind of publicity money cannot buy.      DeGeneres, who in 1997 became the first openly gay lead  character on U.S. prime-time network TV, also has used her talk  show and an appearance on 'The Tonight Show with Jay Leno' to  urge Californians to maintain same-sex marriage.       Still, says Steve Smith, a consultant for the 'No on Prop  8' campaign, money is important.      'California is a very expensive state to communicate with  voters. Celebrity money in some ways goes a little further. It  gets more reported and that adds to the benefit of the  contribution itself,' Smith said.      'My guess is that after Pitt and Spielberg's donations we  are going to see more of that money,' Smith added.      To bolster its funds, the 'No on Prop 8' campaign will hold  an entertainment industry fundraiser this month.      However, celebrity giving can backfire.      'On word that Brad Pitt had donated $100,000 to the No  campaign, we had an individual who read that and himself  donated $100,000 to us,' said Jennifer Kearns, spokeswoman for  the 'Yes on Prop 8' campaign. 'So sometimes the high-prof",
        "Histogram": [
            0,
            0,
            0,
            0.6,
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0,
            0.6,
            0.6,
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 19.623149871826172,
        "BiasReport": {
            "sentences": [
                {
                    "text": "'We are concerned that the entertainment industry hasn't  stepped up to the plate to fight this unnecessary initiative  ... Now it's time for the entertainment industry as a whole to  take the lead,' activist Jonathan Lewis said on Wednesday.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence presents the opinion of activist Jonathan Lewis as a fact, suggesting that the entertainment industry's involvement is necessary without providing a balanced perspective."
                },
                {
                    "text": "Hundreds of gays and lesbians have married since a May  decision by the California Supreme Court overturning a state  ban on same-sex marriage.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'hundreds' and 'since a May decision' emphasizes the volume and recentness of the marriages, potentially to evoke a specific emotional response in support of same-sex marriage."
                },
                {
                    "text": "But opponents of the ruling put the issue up for a  state-wide referendum that seeks to amend the California  constitution to allow marriage only between a man and a woman.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'marriage only between a man and a woman' frames the opposition's position in a way that could evoke a negative emotional response, suggesting exclusion and inequality."
                },
                {
                    "text": "Recent opinion polls show that 38 percent of California  voters would support a ban on same-sex marriage with 55 percent  opposed. But supporters of the ban, including several religious  and conservative groups, have edged ahead in fund-raising.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The mention of 'religious and conservative groups' in the context of fundraising could imply a negative connotation, suggesting a disparity in the moral or ethical standing of the supporters based on their affiliations."
                },
                {
                    "text": "An article in the Los Angeles gay magazine In-LA last month  headlined 'Mega A-Gays Missing in Fight Against Prop 8' noted  that state records show Ellen DeGeneres, Portia de Rossi,  Melissa Etheridge, Rosie O'Donnell and international gays such  as Elton John have not contributed any cash.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The term 'Mega A-Gays' and the framing of their non-contribution as 'Missing in Fight Against Prop 8' could be seen as using provocative language to criticize these individuals for their perceived lack of support."
                },
                {
                    "text": "But many in Hollywood also argue that the high-profile  wedding of popular chat show host DeGeneres to actress de Rossi  in August brought the kind of publicity money cannot buy.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence presents the argument that the wedding's publicity is invaluable as a fact, without acknowledging alternative perspectives on the effectiveness of celebrity donations or endorsements."
                },
                {
                    "text": "Still, says Steve Smith, a consultant for the 'No on Prop  8' campaign, money is important.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The assertion that 'money is important' in the context of the campaign implies a judgment that financial contributions are crucial for the success of the cause, without considering other forms of support or advocacy."
                },
                {
                    "text": "'California is a very expensive state to communicate with  voters. Celebrity money in some ways goes a little further. It  gets more reported and that adds to the benefit of the  contribution itself,' Smith said.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This statement suggests a bias towards the effectiveness of celebrity donations over other forms of support, emphasizing the added value of media attention without a balanced examination of different advocacy strategies."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the discussion on same-sex marriage in California, with a general tendency to use word choice and opinionated statements that favor the support of same-sex marriage and criticize the perceived lack of involvement from the entertainment industry."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.22727272727272727,
            "overall_rating": 0.41363636363636364
        },
        "combined_score": 0.0
    },
    {
        "Title": "RPT-Gay marriage votes may show changing U.S.",
        "URL": "RPT-Gay marriage votes may show changing U.S..txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "(Repeats due to technical problem)      By Peter Henderson      LOS ANGELES, Nov 2 (Reuters) - Gay couples are not hiding  any more and that has made all the difference, said health care  administrator Linda Merkens before Tuesday's vote in California  that will decide the legality of same-sex marriage there.      It's one of several important ballot measures voters will  face in states across the country on Election Day.      'A lot more gays are more open about their relationships,  and a lot more people are willing to accept it,' Merkens said  in downtown Los Angeles recently.      Other passersby disagreed. 'Same sex marriage is a sin,'  said city planner Kim Chan.      Tuesday's results will show how far attitudes to gay  marriage have changed. Florida and Arizona will join California  in voting on whether to stop gay marriage.      In the past, such propositions have almost always been  approved, but polls show a close finish in California and many  undecided in all three states.      Legal abortion also faces a key challenge as South Dakotans  consider a measure to severely restrict the procedure. If it  passes, opponents are expected to challenge it all the way to  the U.S. Supreme Court. A poll by the state Argus Leader  newspaper showed that vote a toss-up.      Altogether, 150 measures in about 35 states will be put to  the vote on the same day the next U.S. president is chosen,  with other issues ranging from affirmative action to how farm  animals are treated. [ID:nN01396494].      A California court in May rejected limiting marriage to a  man and a woman. Only a few nations and states agree.      Now Hollywood stars like Brad Pitt are facing off with  conservative foes like the fast-growing Mormon church, the  Church of Jesus Christ of Latter-day Saints, over Proposition  8, which would ban same-sex marriage.      Both sides have broad, deep pockets: ban proponents have  raised about $30 million, and opponents recently topped that.           MORE IMPORTANT THAN PRESIDENCY      'This is the most important thing on the November 4th  ballot,' said Tony Perkins, president of the conservative  Family Research Council. 'We've made bad selections as  presidents but survived as a nation. But if we move down the  path towards the dissolution of marriage we cannot divorce  ourselves from the consequences of that.'      Episcopal Bishop Marc Andrus supports gay marriage and said  a ballot loss would slow the process -- not stop it.      Californians in 2000 passed a measure to define marriage as  between a man and a woman. At that time, the San Francisco Bay  Area was the only part of the state that supported gay  marriage, said pollster Mark DiCamillo of the Field Poll.      This year, all the coastal areas support gay marriage, and  support in the inland valleys, which have values similar to the  center of the United States, has grown but remains small.      Los Angeles County had the biggest swing, he said. 'It's  the moderates who have moved,' he said.      John Matsusaka, president of the Initiative and Referendum  Institute at the University of Southern California, said  voters, especially younger ones, were used to homosexuality.     'It doesn't have shock value any more,' Matsusaka said.      A ProtectMarriage.org flyer argues that gay marriage will  be taught in schools if the ban fails, a position their  opponents reject. Same-sex marriage supporters focus on equal  rights for all. 'People you know are asking you to vote no",
        "Histogram": [
            0,
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0,
            0
        ],
        "Relevance": 19.57383155822754,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Other passersby disagreed. 'Same sex marriage is a sin,' said city planner Kim Chan.",
                    "bias_type": "Discriminatory Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence promotes a generalized and prejudiced statement against same-sex marriage, based on religious beliefs, reinforcing discrimination."
                },
                {
                    "text": "A California court in May rejected limiting marriage to a man and a woman. Only a few nations and states agree.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the word 'rejected' implies a negative judgment towards the traditional view of marriage, suggesting that it is outdated or wrong."
                },
                {
                    "text": "Now Hollywood stars like Brad Pitt are facing off with conservative foes like the fast-growing Mormon church, the Church of Jesus Christ of Latter-day Saints, over Proposition 8, which would ban same-sex marriage.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'conservative foes' and the framing of the conflict as a battle between Hollywood stars and the Mormon church imply a judgment and a negative connotation towards the church's stance on the issue."
                },
                {
                    "text": "'This is the most important thing on the November 4th ballot,' said Tony Perkins, president of the conservative Family Research Council. 'We've made bad selections as presidents but survived as a nation. But if we move down the path towards the dissolution of marriage we cannot divorce ourselves from the consequences of that.'",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of dramatic language such as 'the dissolution of marriage' is designed to evoke strong emotions and exaggerate the potential consequences of legalizing same-sex marriage."
                },
                {
                    "text": "A ProtectMarriage.org flyer argues that gay marriage will be taught in schools if the ban fails, a position their opponents reject.",
                    "bias_type": "Speculation Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence engages in speculation about the future consequences of legalizing same-sex marriage, without concrete evidence, to influence the reader's perception."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the topic of same-sex marriage, with a general tendency towards promoting the acceptance of same-sex marriage by framing opposition in a negative light and using emotionally charged or speculative language."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.22580645161290322,
            "overall_rating": 0.4129032258064516
        },
        "combined_score": 0.0
    },
    {
        "Title": "Same-sex marriage ban stirs LA gay district protest",
        "URL": "Same-sex marriage ban stirs LA gay district protest.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    LOS ANGELES, Nov 8 (Reuters) - Several thousand people  gathered in Los Angeles on Saturday evening to protest a  voter-approved ballot measure that bans same-sex marriage in  California.      A diverse crowd, estimated at 5,000, stretched for blocks  in the Silver Lake district, east of Hollywood, carrying signs  and chanting against Proposition 8, a constitutional amendment  that bars the state from recognizing same-sex marriages.      'Equal rights,' the protesters chanted, 'When do we want it?  Now!'      The measure overturned a California Supreme Court ruling in  May that refusing homosexuals the right to marry violated the  state constitution. Voters in Florida and Arizona joined  California on Tuesday in banning same-sex marriages.      Dozens of states have similar laws. Only two U.S. states,  Massachusetts and Connecticut, allow same-sex marriage.      Many of the protesters' signs mocked the Mormon church, which  spent millions promoting the measure, helping make it one of the  most expensive ballot campaigns in U.S. history.      Others expressed despair the gay community had not benefited  from U.S. President-elect Barack Obama's lopsided election  victory.      'Yes we can (unless you're gay),' read one sign.      The march began at Sunset Junction, once a strip of bars  where the U.S. gay community first made a stand against police  harassment in the late 1960s.      The action was one of a number of largely peaceful protests  that took place across the state on Saturday, and have clogged  Los Angeles streets every night since the proposition passed.           HISTORIC PLACE      'This is a historic place for the  (lesbian-gay-bisexual-transgender) community,' said Ian  Thompson, spokesman for protest organizer the ANSWER Coalition.  'We are remembering the fact that the gay community started  standing up for itself here. People are just very angry.'      Activists, both gay and straight, listened to speakers and  marched about a 1 mile (1.6 km) through Silver Lake, watched by  police on horseback and several hovering helicopters.      Participants in the rally included Robin Tyler and Diane  Olson, a lesbian couple whose lawsuit led the state Supreme Court  to permit more than 18,000 couples to marry over the summer. Those  couples now find their unions in legal limbo. California state law  recognizes civil unions between gays and lesbians.      Supporters of the proposition argued that gay marriage  would be taught in schools if the ban failed, a position that  opponents of the ban reject.      Tyler and Olson had their attorney file a writ with the  high court on Wednesday challenging the initiative. Civil  rights groups have filed another lawsuit and leaders of some  California cities were contemplating joining those actions.      The ballot measure, whose campaign drew a record total of  $70 million in contributions from supporters and opponents,  amended the state constitution to add, 'Only marriage between a  man and a woman is valid or recognized in California.'   (Reporting by Gina Keating; Editing by Todd Eastham)   ((gina.keating@reuters.com; +1 213 955 6776; Reuters Messaging;  gina.keating.reuters.com@reuters.net))  Keywords: GAYMARRIAGE/CALIFORNIA       ",
        "Histogram": [
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0.6,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 19.502391815185547,
        "BiasReport": {
            "sentences": [
                {
                    "text": "'Equal rights,' the protesters chanted, 'When do we want it?  Now!'",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the phrase 'Equal rights' and the urgency expressed with 'When do we want it? Now!' implies a judgment about the current state of rights, suggesting that they are not equal and prompting an emotional response."
                },
                {
                    "text": "Many of the protesters' signs mocked the Mormon church, which  spent millions promoting the measure, helping make it one of the  most expensive ballot campaigns in U.S. history.",
                    "bias_type": "Ad Hominem Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The sentence targets the Mormon church's actions and the significant financial support it provided, suggesting a negative judgment on the church's involvement in the campaign through the use of the word 'mocked'."
                },
                {
                    "text": "'Yes we can (unless you're gay),' read one sign.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sign uses a play on words of a well-known slogan ('Yes we can') to evoke an emotional response, highlighting a perceived contradiction in the context of gay rights, which can be seen as provocative."
                }
            ],
            "overall_bias": {
                "conclusion": "The article is biased regarding the topic of same-sex marriage, showing a general bias tendency through the use of word choice, ad hominem attacks, and emotional sensationalism to support the protesters' cause."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.2,
            "overall_rating": 0.4
        },
        "combined_score": 0.0
    },
    {
        "Title": "FACTBOX-U.S. laws on gay marriage, civil unions",
        "URL": "FACTBOX-U.S. laws on gay marriage, civil unions.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    May 15 (Reuters) - The California Supreme Court ruled on  Thursday the state cannot bar same-sex marriages, marking a  major victory for gay rights advocates that may have national  implications.      Here is a look at laws on gay marriage and same-sex civil  unions in the United States:      * Massachusetts is the only U.S. state to allow gay  marriage. Its highest court ruled in 2003 that a ban on gay  marriage was unconstitutional, paving the way for America's  first same-sex marriages the following year.      * Connecticut, New Hampshire, New Jersey and Vermont permit  same-sex civil unions that grant largely the same state rights  as married couples -- from insurance coverage to tax benefits  and hospital visiting rights -- but lack the full, federal  legal protections of marriage.      * California, Maine, the District of Columbia, Hawaii and  Washington each offer gay couples some legal rights as  partners.      * Currently, 45 states have laws explicitly prohibiting  same-sex marriage, including 26 with constitutional amendments  restricting marriage to one man and one woman and 19 with  statutory laws barring same-sex unions.      * The patchwork of laws has caused some unusual  complications. Rhode Island's top court, for example, ruled in  December 2007 that a same-sex couple married in Massachusetts  could not legally divorce in Rhode Island, saying the state's  family court did not have authority over same-sex marriages.      * Massachusetts currently allows out-of-state same-sex  couples from just two states -- Rhode Island and New Mexico --  to marry there, since those states' laws do not clearly  prohibit gay marriage.      * More than 8,000 same-sex couples have married in  Massachusetts.      * The U.S. Supreme Court has not taken a case on gay  marriage, leaving states to decide the issue.      * The Arizona House of Representatives voted 33-25 on May  13 to put a proposed constitutional amendment to prohibit  same-sex marriage on the statewide ballot in November.      Sources: Reuters/Human Rights Campaign   (Writing by Paul Grant, Washington Editorial Reference Unit,  and Jason Szep in Boston; Editing by Cynthia Osterman)  ((paul.grant@reuters.com; +202 789 8015 Reuters Messaging:  paul.grant.reuters.com@reuters.net))  Keywords: RIGHTS GAYS/STATES        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 19.492488861083984,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it provides a factual overview of the laws on gay marriage and civil unions in the United States without employing any of the common bias types."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "U.S. battle over gay marriage shifts to Maine",
        "URL": "U.S. battle over gay marriage shifts to Maine.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Jason Szep      BOSTON, Jan 13 (Reuters) - A Maine lawmaker introduced a  bill on Tuesday to legalize same-sex marriage, but it looks set  to face tough opposition and bring a rancorous fight over the  definition of marriage to the rugged eastern state.      The legislation proposed by Democratic state Sen. Dennis  Damonck would make the state the nation's third to allow  same-sex marriage. It seeks to redefine marriage as the legal  union of two people rather than between a man and a women.      'Today I have submitted an act to end discrimination in  civil marriage and to affirm religious freedom,' he told a news  conference in the state capital Augusta.      As he spoke, Republican Rep. John Tardy was drafting  legislation to enshrine the definition of marriage as one man  and one woman into the state constitution. 'The language is  being worked on now,' his spokesman said.      The looming fight in Maine, a rural state of 1.3 million  people with a Democratic-controlled legislature, underlines a  concerted push for same-sex marriage recognition in New  England's six states by gay and lesbian advocates -- a bid that  would effectively create a regional niche for gay marriage.      In November, Connecticut became the second U.S. state to  allow legal same-sex weddings after Massachusetts' top court  ruled in 2003 that a ban on gay marriage was unconstitutional,  paving the way for same-sex marriages the following year.      On Friday, New Hampshire Rep. Jim Splaine signed off on  legislation proposing same-sex marriage in that state, which  borders both Maine and Massachusetts. He said he expected the  bill to come up for a public hearing in two or three weeks.      Five of New England's six states already offer same-sex  couples some form of legal recognition, with New Hampshire and  Vermont permitting same-sex civil unions that grant many of the  same rights as married couples but lack the full legal  protections of marriage.      'I think it is important to make our civil unions have full  marriage equality with the word 'marriage' so that it is clear  that we do not discriminate and that we welcome same-gendered  couples,' Splaine told Reuters in an interview.      Gay & Lesbian Advocates & Defenders, a group of lawyers who  led the legal fight for same-sex marriage in Massachusetts and  Connecticut, said on Tuesday similar legislation was being  drafted in Rhode Island and Vermont.      The group has set a target of bringing same-sex marriage   to all six New England states by 2012.      Some economists say carving out an economic niche for gay  and lesbian weddings -- and the spending that comes with them  -- makes sense at a time same-sex marriage has stalled in  California and a recession is deepening.      M.V. Lee Badgett, an economist at the University of  Massachusetts' Institute for Gay and Lesbian Strategic Studies,  led a study released in July that said over the next three  years about 32,200 same-sex couples would travel from other  states to marry in Massachusetts.      That would translate into 330 jobs and a $111 million boost  to the state's economy, the study projects.      (Editing by Cynthia Osterman)      ((jason.szep@thomsonreuters.com; +1 617 856 4343; Reuters  Messaging: jason.szep.reuters.com@reuters.net))  Keywords: GAYMARRIAGE/MAINE       ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0,
            0,
            0,
            0
        ],
        "Relevance": 19.48974609375,
        "BiasReport": {
            "sentences": [
                {
                    "text": "The looming fight in Maine, a rural state of 1.3 million people with a Democratic-controlled legislature, underlines a concerted push for same-sex marriage recognition in New England's six states by gay and lesbian advocates -- a bid that would effectively create a regional niche for gay marriage.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'looming fight' and 'rural state' with the context of 'Democratic-controlled legislature' implies a negative connotation towards the efforts for same-sex marriage, suggesting a contentious and possibly backward struggle in a less significant area."
                },
                {
                    "text": "Some economists say carving out an economic niche for gay and lesbian weddings -- and the spending that comes with them -- makes sense at a time same-sex marriage has stalled in California and a recession is deepening.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'carving out an economic niche' implies a deliberate and possibly controversial action, suggesting a bias towards viewing the promotion of gay and lesbian weddings as a strategic economic move rather than a matter of equality."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias through the use of word choice, particularly in framing the discussion around same-sex marriage in Maine and its economic implications. The bias tends to imply a negative or strategic connotation towards the efforts for same-sex marriage, suggesting a contentious struggle and a calculated economic move rather than a matter of equality."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.05263157894736842,
            "overall_rating": 0.3263157894736842
        },
        "combined_score": 0.0
    },
    {
        "Title": "Portuguese parliament rejects gay marriage",
        "URL": "Portuguese parliament rejects gay marriage.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Axel Bugge      LISBON, Oct 10 (Reuters) - Portugal's parliament rejected a  proposal on Friday to allow gay marriage, sparking anger among  gays who say they face discrimination in the conservative  Catholic country.      The proposal by the small Left Bloc and Green parties to  overturn an existing ban was overwhelmingly rejected as the  ruling Socialists, who hold a majority, joined the centre-right  opposition in opposing the move.      Parliament president Jaime Gaime did not give a final vote  breakdown but said the proposal had been rejected, the  legislature's television channel showed.      Outside parliament, about thirty gays protested by staging  two mock marriages.      'I am here because there are citizens who are full citizens  in their duties but not citizens in their rights and that is a  very serious mistake in a democracy,' Joana, a woman who married  her partner, told Reuters Television.      'Old homophobes!' a gay protester shouted inside the voting  chamber after the vote, before being led out by police.      Gays were encouraged that a referendum in Portugal last year  overturned a ban on abortion, hoping it would usher in what they  see as more progressive and modern values elsewhere in Europe.  Neighbouring Spain has allowed gay marriages since 2005.      But Catholic values still hold sway on many social issues in  Portugal. Cardinal Jose Policarpo, the patriarch of Lisbon,  warned that allowing gay marriages would be a violation of the  family.      'What is in question is breaking the profound conception of  the family,' he said on Radio Renascenca, a Catholic radio  station.      Alice Ferreira, a 70-year-old pensioner, told SIC television  that gays could have their own sexual preferences but they  should not be allowed to marry.      'I don't think they could be real marriages because  marriages are intended to create families,' she said.      Supporters of the change argue that the ban on gay marriage  included in Portugal's civil code is illegal under the 1975  constitution, which bans sexual discrimination.      Polls have shown under 30 percent of Portuguese approve of  gay marriage against an average around 45 percent in the  European Union, according to Eurobarometer.   (Additional reporting by Miguel Pereira; editing by Philippa  Fletcher)   ((Axel.Bugge@Reuters.Com, +351-213-509-201, Reuters Messaging:  axel.bugge.reuters.com@reuters.net))    Keywords: PORTUGAL GAY/        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0.6,
            0.6,
            0,
            0.6,
            0.6,
            0,
            0,
            0
        ],
        "Relevance": 19.472957611083984,
        "BiasReport": {
            "sentences": [
                {
                    "text": "'Old homophobes!' a gay protester shouted inside the voting chamber after the vote, before being led out by police.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the term 'homophobes' to describe the opposition carries a negative connotation and implies judgment, suggesting that those who voted against the proposal are inherently prejudiced."
                },
                {
                    "text": "But Catholic values still hold sway on many social issues in Portugal. Cardinal Jose Policarpo, the patriarch of Lisbon, warned that allowing gay marriages would be a violation of the family.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence presents the warning from Cardinal Jose Policarpo as a fact, without offering a counterpoint or acknowledging that this is a subjective opinion based on religious beliefs, blurring the line between objective reporting and personal perspective."
                },
                {
                    "text": "Alice Ferreira, a 70-year-old pensioner, told SIC television that gays could have their own sexual preferences but they should not be allowed to marry. 'I don't think they could be real marriages because marriages are intended to create families,' she said.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The inclusion of this individual's opinion, particularly the assertion that gay marriages are not 'real marriages,' without a contrasting viewpoint, reflects a subjective belief presented as a valid argument, contributing to an overall bias in the article."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the topic of gay marriage in Portugal, with a general tendency towards presenting subjective opinions and using word choices that imply judgment, particularly against those opposing the proposal."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.23529411764705882,
            "overall_rating": 0.41764705882352937
        },
        "combined_score": 0.0
    },
    {
        "Title": "UPDATE 3-Connecticut court allows gay marriage",
        "URL": "UPDATE 3-Connecticut court allows gay marriage.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": " (Updates with White House reaction, paragraphs 11-13)      By Ted Lorson      HARTFORD, Conn., Oct 10 (Reuters) - Connecticut's highest  court on Friday unexpectedly struck down a ban on gay and  lesbian marriage, making the New England state the third in the  nation to allow full-fledged marriage for same-sex couples.      After four years of legal wrangling in the state court  system, the Connecticut Supreme Court ruled 4-3 that a ban on  gay marriage constituted 'cognizable harm' and infringed on a  'fundamental right' of same-sex couples.      The decision, which overturns a lower court ruling, follows  the legalization of gay marriage in California this year and in  Massachusetts in 2003. It was hailed by gay rights advocates as  a proud day after battles over the culturally divisive issue in  several states.      Connecticut Gov. Jodi Rell, a Republican, disagreed with  the ruling but said she will uphold it.      'I continue to believe that marriage is the union of a man  and a woman,' Rell said. 'I do not believe their voice reflects  the majority of the people of Connecticut.'      She said she was convinced that any attempt to reverse the  decision, either legislatively or by amending the state  Constitution, would fail.      The decision came as a surprise after previous courts  upheld the ban and lawmakers wrote specific language into a  civil union measure defining marriage as between men and  women.      Connecticut was one of four U.S. states that permits  same-sex civil unions that grant rights such as insurance  coverage, tax benefits and hospital visitations. But these lack  the full, federal legal protections of marriage.      Opponents of gay marriage said they would seek to overturn  the ruling by persuading voters to support a ballot measure   next month that would open a state constitutional convention to  address the issue of same-sex marriage.      'Then we will put a question on the ballot to allow the  public, not our robed masters, to decide once and for all if  marriage will be protected in our state constitution as the  union between a man and a woman,' said Peter Wolfgang,  president of the Family Institute of Connecticut, a  conservative Christian group.      Karl Zinsmeister, President George W. Bush's assistant for  domestic policy, issued a statement criticizing the decision  late on Friday.      'President Bush has always believed that marriage is a  sacred institution between a man and a woman.      'It's unfortunate that activist judges continue to seek to  redefine marriage by court order without regard for the will of  the people. Today's decision by the Connecticut Supreme Court  illustrates that a federal constitutional amendment may be  needed if the people are to decide what marriage means.'        'WE ARE OVERJOYED'      The plaintiffs in the case -- eight same-sex couples --  challenged the lower court's ruling that civil unions give  same-sex couples the same rights and protections as marriage.      They argued that their constitutional rights were denied  when they were barred from getting marriage licenses.      'We are overjoyed to tell our twin boys that we will be  married, just like their friends' parents,' Beth Kerrigan and  Jodie Mock, two plaintiffs in the case, said in a statement.      The date when the decision takes effect depends on a trial  court order that is expected after Oct. 28, said Connecticut  Attorney General Richard Blumenthal.      'It won't take effect immediatel",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 19.43973731994629,
        "BiasReport": {
            "sentences": [
                {
                    "text": "'I continue to believe that marriage is the union of a man  and a woman,' Rell said. 'I do not believe their voice reflects  the majority of the people of Connecticut.'",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence reflects a personal opinion on marriage, implying a judgment on the court's decision and the majority's stance, blurring the line between fact and personal perspective."
                },
                {
                    "text": "'Then we will put a question on the ballot to allow the  public, not our robed masters, to decide once and for all if  marriage will be protected in our state constitution as the  union between a man and a woman,' said Peter Wolfgang,  president of the Family Institute of Connecticut, a  conservative Christian group.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'robed masters' to refer to judges introduces a negative connotation and implies a judgment about the judiciary, suggesting a biased perspective through the choice of words."
                },
                {
                    "text": "'It's unfortunate that activist judges continue to seek to  redefine marriage by court order without regard for the will of  the people. Today's decision by the Connecticut Supreme Court  illustrates that a federal constitutional amendment may be  needed if the people are to decide what marriage means.'",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The term 'activist judges' and the suggestion that they act 'without regard for the will of the people' introduces a negative and biased view of the judiciary's role in interpreting the law, implying a judgment through the choice of words."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the topic of same-sex marriage, particularly in the discussion of the court's decision in Connecticut. The biases identified include Opinionated Bias and Word Choice Bias, with a general tendency to imply judgments and negative connotations towards the court's decision and the involved parties' perspectives."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.2608695652173913,
            "overall_rating": 0.4304347826086956
        },
        "combined_score": 0.0
    }
]