[
    {
        "Title": "Illegal immigration needs political solution-pope",
        "URL": "Illegal immigration needs political solution-pope.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    CASTEL GANDOLFO, Italy, Aug 31 (Reuters) - Pope Benedict  called on Sunday for an effective political solution to deal  with the human problems of illegal immigration from Africa to  Europe.      The pope, speaking to pilgrims and tourists at his summer  residence south of Rome, said the hopes of illegal migrants  seeking a better life often ended in tragedy on the high seas.      He mentioned an accident last week in which some 70 Africa  migrants went missing and were believed killed in the central  Mediterranean when their rubber boat capsized.      'While it (illegal migration) reaches out for solidarity, at  the same time it also calls for efficient political responses,'  he said.      Each year tens of thousands of migrants from Africa, Asia  and the Middle East leave North African shores, often on craft  that are not seaworthy, trying to reach Italy, Malta and Spain.      They are often the victims of unscrupulous human traffickers  who charge large amounts for the risky voyage.      The pope said countries of origin should take measures to  eliminate the causes of illegal immigration and 'uproot all form  of criminality related to it'.      European countries had a duty to protect the human needs of  immigrants and all immigrants should respect national laws, he  said.   (Reporting by Philip Pullella, Editing by Angus MacSwan)   ((philip.pullella@reuters.com ; +39 06- 8522 4358; Reuters  Messaging: philip.pullella.reuters.com@reuters.net ))    Keywords: POPE IMMIGRATION/       ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 18.07009506225586,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides a factual report on Pope Benedict's call for a political solution to address the human problems of illegal immigration from Africa to Europe, without exhibiting any of the common forms of bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "FACTBOX-Illegal immigration in the United States",
        "URL": "FACTBOX-Illegal immigration in the United States.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    Jan 24 (Reuters) - Republican presidential contender Rudy  Giuliani defended his plans to curb illegal immigration to the  United States during a high-stakes debate on Thursday in  Florida.      Illegal immigration is a hot button issue in the  state-by-state battle to choose candidates for the November  2008 presidential election. Here are some facts on illegal  immigration in the United States:           * An estimated 11 million to 12 million undocumented  immigrants live and work in the United States, roughly one in  every 20 workers, according to a study by the Pew Hispanic  Center based on government figures.           * Some 880,000 people were arrested crossing the  U.S.-Mexico border illegally in 2007, most of them from Mexico  and Central America, down from 1.1 million a year earlier.           * The U.S. government had built 284 miles of pedestrian and  vehicular fencing along the 2,000 mile (3,200-km) U.S.-Mexico  border by the close of 2007, and aims to construct roughly 670  miles of fencing by the end of 2008.           * In 2006, President George W. Bush proposed an overhaul of  U.S. immigration laws, offering a path to citizenship for many  undocumented immigrants, together with a guest worker program,  and tougher border and workplace enforcement.           * The legislation was opposed by Republicans in the House  of Representatives who backed a tougher security program but  were against any effort to grant citizenship rights to illegal  immigrants.           * By late 2007, state legislatures across the United States  had proposed more than 1,560 immigration-related measures. Of  these, more than 240 have become law in 46 states, according to  the National Conference of State Legislatures.    (Writing by Tim Gaynor, editing by Todd Eastham)    (To read more about the U.S. political campaign, visit  Reuters 'Tales from the Trail: 2008' online at  http://blogs.reuters.com/category/events/trail08/)  Keywords: USA POLITICS/IMMIGRATION        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 18.005186080932617,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides factual information about illegal immigration in the United States and the related political context without exhibiting any of the common forms of bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Libya urges EU to revise illegal immigration rules",
        "URL": "Libya urges EU to revise illegal immigration rules.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    TRIPOLI, July 14 (Reuters) - Libya called on the European  Union to revise new rules against illegal immigration on Monday,  saying it would urge African Union members to take action if the  EU stuck by measures that treated African migrants as criminals.      EU ministers have backed French proposals for a European  pact to stem illegal immigration and attract highly skilled  job-seekers, weeks after the EU decided illegal immigrants could  be detained for up to 18 months and face a 5-year re-entry ban.      'Africa will not accept any law based on repression and in  dealing with African migrants, including children and disabled  people, as criminals,' Libya's Foreign Ministry said in a  statement carried by the official Libyan news agency Jana.      'If they insist to keep the stand unchanged, Libya will  consult with other African Union members to study this (EU) law  and its repercussions and take a unified position on the move,'  the ministry said.      Libya, one of North Africa's gateways for migrants hoping to  reach Europe, did not say what action it hoped the African Union  would take.      The Foreign Ministry said the days when countries decided  unilaterally the fate of other countries were over, apparently  referring to Western colonisation of African states.      The European Commission estimates there are up to 8 million  illegal immigrants in the 27-nation European Union. More than  200,000 were arrested in the EU in the first half of 2007 with  just under 90,000 expelled.      The 18-month detention limit is longer than the current  maximum period in two-thirds of the EU states. Although EU  states can keep a lower limit if they want, rights groups say it  will encourage authorities to lock up more illegal immigrants.      Under the migration pact, to be finalised in October, EU  states pledge to expel more illegal immigrants while promoting  legal migration and a common asylum police by 2010.   (Writing by Lamine Ghanmi; editing by Elizabeth Piper)   ((lamine.ghanmi@reuters.com; +212-37 720065))    Keywords: LIBYA EU/IMMIGRATION       ",
        "Histogram": [
            0,
            0,
            0.9,
            0,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 16.900062561035156,
        "BiasReport": {
            "sentences": [
                {
                    "text": "'Africa will not accept any law based on repression and in dealing with African migrants, including children and disabled people, as criminals,' Libya's Foreign Ministry said in a statement carried by the official Libyan news agency Jana.",
                    "bias_type": "Discriminatory Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This sentence promotes discriminatory bias by generalizing the treatment of African migrants, including vulnerable groups, as criminal based on the EU's immigration rules, reinforcing negative stereotypes and unequal representation."
                },
                {
                    "text": "The Foreign Ministry said the days when countries decided unilaterally the fate of other countries were over, apparently referring to Western colonisation of African states.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the phrase 'unilaterally the fate of other countries' and the reference to 'Western colonisation of African states' implies a negative connotation towards Western countries, suggesting a judgmental perspective and influencing perceptions."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the EU's immigration rules, particularly in the way it discusses the treatment of African migrants and the historical context of Western involvement in Africa. The general bias tendency leans towards discriminatory and word choice biases, highlighting negative portrayals and influencing perceptions."
            }
        },
        "Scores": {
            "average_bias_strength": 0.75,
            "percentage_of_biased_sentences": 0.08333333333333333,
            "overall_rating": 0.4166666666666667
        },
        "combined_score": 0.0
    },
    {
        "Title": "Africans condemn EU curbs on illegal immigration",
        "URL": "Africans condemn EU curbs on illegal immigration.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Ingrid Melander      DAKAR, July 9 (Reuters) - Senior African officials  criticised new European Union rules against illegal immigration  on Wednesday, accusing the wealthy bloc of failing to treat  migrants with dignity and of breaking pledges to cooperate.      EU ministers backed French proposals on Monday for a  European pact to stem illegal immigration and attract highly  skilled job-seekers, weeks after the EU decided illegal  immigrants could be detained for up to 18 months and face a  5-year re-entry ban.      'Senegal is surprised by this European initiative when we  had committed ourselves ... to another path, that of dialogue,'  Senegal's Foreign Minister Cheikh Tidiane Gadio told a  conference of EU and African migration experts in Dakar.      'The time has passed when Europe decided things on its own  and Africa fell in line,' he told reporters on the sidelines of  the meeting.      The detention rule agreed by the EU in June had sparked  outrage in Latin America, where Argentina's President Cristina  Fernandez said it recalled 'times of xenophobia' and Venezuelan  President Hugo Chavez said Europe had 'legalised barbarity.'      But Africa, from where thousands of would-be immigrants risk  their lives each year trying to reach Europe in rickety boats,  had so far been largely silent on the new EU measures.      'We are absolutely opposed to this repressive... attitude  and to treating undocumented migrants as if they were  criminals,' Gadio said on Wednesday.      'It's a pity that Africans did not react more quickly to  this situation,' Dominique Guerematchi, an ambassador from  Central African Republic, told Reuters.            'SENT HOME LIKE ANIMALS'      'It's not because people want to go to Europe that they  should be sent home like animals,' Guerematchi said at the Dakar  meeting. 'We are quite shocked by this situation.'      'We were outraged to see sanctions from another time,' Alice  Bienvenu Bayidikila, Congo Republic's director of border  security, said of the new EU law. 'Illegal migration must be  fought, but in a way that respects human dignity.'      The European Commission estimates there are up to 8 million  illegal immigrants in the 27-nation European Union. More than  200,000 were arrested in the EU in the first half of 2007 with  just under 90,000 expelled.      The 18-month detention limit is longer than the current  maximum period in two-thirds of the 27 EU states. Although EU  states can keep a lower limit if they want, rights groups say it  will encourage authorities to lock up more illegal immigrants.      Under the migration pact, to be finalised in October, EU  states pledge to expel more illegal immigrants while promoting  legal migration and a common asylum policy by 2010.      These initiatives are the latest steps by EU members to  address voter concerns over immigration and they follow efforts  to set up joint border patrols and biometric police databases.      Europeans and Africans had pledged at a first ministerial  conference on migration in Morocco two years ago to work  together to handle the sensitive issue. A follow-up conference  will take place in October in Paris.   (For full Reuters Africa coverage and to have your say on the  top issues, visit: http://africa.reuters.com/)   (Editing by Pascal Fletcher)   ((ingrid.melander@reuters.com; Dakar Newsroom +221 33 864 5076;  Reuters Messaging: ingrid.melander.reuters.com@reuters.net))    Keywords: AFRICA EU/IMMIGRATION       ",
        "Histogram": [
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0.6,
            0.6,
            0,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 16.753070831298828,
        "BiasReport": {
            "sentences": [
                {
                    "text": "'Senegal is surprised by this European initiative when we had committed ourselves ... to another path, that of dialogue,' Senegal's Foreign Minister Cheikh Tidiane Gadio told a conference of EU and African migration experts in Dakar.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the word 'surprised' implies a negative judgment towards the European initiative, suggesting that it was unexpected in a disapproving manner."
                },
                {
                    "text": "'The time has passed when Europe decided things on its own and Africa fell in line,' he told reporters on the sidelines of the meeting.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence implies a historical imbalance in the relationship between Europe and Africa, suggesting a negative connotation towards past actions of Europe."
                },
                {
                    "text": "'We are absolutely opposed to this repressive... attitude and to treating undocumented migrants as if they were criminals,' Gadio said on Wednesday.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'absolutely opposed' and 'repressive' conveys a strong negative judgment towards the EU's approach, framing it in a highly critical light."
                },
                {
                    "text": "'It's a pity that Africans did not react more quickly to this situation,' Dominique Guerematchi, an ambassador from Central African Republic, told Reuters.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'It's a pity' suggests a disapproving and somewhat condescending view towards the African response, implying that their reaction was inadequate."
                },
                {
                    "text": "'It's not because people want to go to Europe that they should be sent home like animals,' Guerematchi said at the Dakar meeting. 'We are quite shocked by this situation.'",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The comparison of migrants being 'sent home like animals' is a strong emotional appeal, designed to evoke a visceral reaction and highlight the perceived inhumane treatment."
                },
                {
                    "text": "'We were outraged to see sanctions from another time,' Alice Bienvenu Bayidikila, Congo Republic's director of border security, said of the new EU law. 'Illegal migration must be fought, but in a way that respects human dignity.'",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'outraged' and 'sanctions from another time' employs emotionally charged language to criticize the EU law, emphasizing the need for humane treatment."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the EU's immigration policies, particularly through the use of word choice and emotional sensationalism to convey a negative portrayal of the EU's actions and a sympathetic view towards the migrants' plight."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.42857142857142855,
            "overall_rating": 0.5142857142857142
        },
        "combined_score": 0.0
    },
    {
        "Title": "EU illegal immigration law faces knife-edge vote",
        "URL": "EU illegal immigration law faces knife-edge vote.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    STRASBOURG, June 17 (Reuters) - A law that allows illegal  immigrants to be detained for up to 18 months faced a knife-edge  vote in the European Parliament on Wednesday due to left-wing  opposition and doubts among other lawmakers, EU officials said.      After nearly three years of debate, European Union interior  ministers this month agreed the measure, which allows detention  without trial and means illegal immigrants would also face a  re-entry ban of up to 5 years.      The measure, which has been widely criticised by human  rights groups, now needs to be agreed by the European  Parliament.       Conservatives and liberals supported it in a debate on  Tuesday, giving the text a theoretical majority, while  socialists, greens and a communist-led group wanted to reduce  the detention length.      'There is a majority on paper, but there can always be  surprises, no one can predict the outcome,' one European  Parliament official said. 'It's going to be a knife-edge vote,'  another official said after the debate, adding that there would  be splits within political groups.      'This directive is a disgrace, it's an insult to  civilisation in Europe,' said Italian left-winger Giusto  Catania, saying illegal migrants should not be detained for 18  months without having committed a crime.      'We are building a Europe which is shutting down on itself,'  said fellow socialist Martine Roure, urging the bloc to take  steps to facilitate legal migration.      The 18-month limit is higher than the maximum detention in  two-thirds of the 27 EU states. Although EU states can keep a  lower limit if they want, rights groups and opponents say it  will encourage authorities to lock up more illegal migrants.      The EU executive estimates there are up to 8 million illegal  migrants in the bloc. More than 200,000 were arrested in the  first half of 2007 but less than 90,000 expelled.      EU Commissioner Jacques Barrot said on Tuesday the law was  needed to make the bloc's migration policies credible, a stance  backed by conservative and liberal lawmakers.      'It's a decisive step towards a necessary common policy on  immigration, an essential legal instrument to safeguard  fundamental rights for immigrants,' said Spanish conservative  Agustin Diaz de Mera Garcia.      'It raises standards in some member states,' British liberal  Sarah Ludford said, calling it an imperfect but necessary law.      Slovenia's interior minister Dragutin Mate warned lawmakers  that if they rejected the text it would take several more years  to reach an agreement.      The draft law allows children to be detained while saying  that should be for the shortest appropriate period of time.      Currently, illegal migrants cannot be detained for more than  40 days in Spain and a year in Hungary, according to European  Commission data. Germany already has an 18-month detention cap,  while eight EU countries, who have higher caps or none at all  would need to introduce the new EU limit.      Amnesty International's Secretary General, Irene Khan, urged  lawmakers to reject the text. 'The proposed directive is  unacceptable as an EU standard,' she said in a statement.  'Detention should only be used in very exceptional cases, always  for the shortest possible time.'   (Reporting by Ingrid Melander; Editing by Giles Elgood)   ((ingrid.melander@reuters.com; 32 2 287 6830; Reuters  Messaging: ingrid.melander.reuters.com@reuters.net))    Keywords: EU IMMIGRATION/DETENTION     ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            1.0,
            0.6,
            0,
            0,
            0,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0
        ],
        "Relevance": 15.040911674499512,
        "BiasReport": {
            "sentences": [
                {
                    "text": "'There is a majority on paper, but there can always be surprises, no one can predict the outcome,' one European Parliament official said. 'It's going to be a knife-edge vote,' another official said after the debate, adding that there would be splits within political groups.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of phrases like 'knife-edge vote' and 'no one can predict the outcome' introduces a sense of drama and uncertainty, potentially influencing the reader's perception towards expecting a contentious and dramatic event, rather than a standard legislative process."
                },
                {
                    "text": "'This directive is a disgrace, it's an insult to civilisation in Europe,' said Italian left-winger Giusto Catania, saying illegal migrants should not be detained for 18 months without having committed a crime.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 1.0,
                    "bias_description": "The strong, emotionally charged language such as 'disgrace' and 'insult to civilisation' is designed to provoke a strong emotional response, overshadowing a more balanced discussion on the complexities of immigration policy."
                },
                {
                    "text": "'We are building a Europe which is shutting down on itself,' said fellow socialist Martine Roure, urging the bloc to take steps to facilitate legal migration.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'shutting down on itself' conveys a dramatic and negative image, suggesting a regressive and isolationist Europe, which may oversimplify the challenges and policy considerations related to immigration."
                },
                {
                    "text": "EU Commissioner Jacques Barrot said on Tuesday the law was needed to make the bloc's migration policies credible, a stance backed by conservative and liberal lawmakers.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Presenting the law as 'needed to make the bloc's migration policies credible' without providing a balanced view or evidence to the contrary implies a subjective opinion on the necessity of the law, blurring the line between fact and personal perspective."
                },
                {
                    "text": "Amnesty International's Secretary General, Irene Khan, urged lawmakers to reject the text. 'The proposed directive is unacceptable as an EU standard,' she said in a statement. 'Detention should only be used in very exceptional cases, always for the shortest possible time.'",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of terms like 'unacceptable' and 'always for the shortest possible time' reflects a strong, subjective opinion on the matter, presented as a definitive stance without acknowledging the complexities or competing interests involved in immigration policy."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the discussion on the EU's immigration law, particularly in the portrayal of the legislative process and the emotional and opinionated language used by various stakeholders to influence the reader's perception towards a specific viewpoint."
            }
        },
        "Scores": {
            "average_bias_strength": 0.68,
            "percentage_of_biased_sentences": 0.30434782608695654,
            "overall_rating": 0.4921739130434783
        },
        "combined_score": 0.0
    },
    {
        "Title": "Berlusconi cabinet approves tough immigration rules",
        "URL": "Berlusconi cabinet approves tough immigration rules.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    NAPLES, May 21 (Reuters) - Italian Prime Minister Silvio  Berlusconi's cabinet approved on Wednesday a package of tough  measures against illegal immigration and crime which have raised  concern in the European Union that they could foment racism.      Interior Minister Roberto Maroni said the measures, which  need approval by parliament where the conservative government  has a solid majority, include making it a jailable offence to be  an illegal immigrant.      ((stephen.brown@reuters.com; +39 06 8522 4351; Reuters  Messaging: stephen.brown.reuters.com@reuters.net))    Keywords: ITALY IMMIGRATION/        ",
        "Histogram": [
            0.6,
            0,
            0
        ],
        "Relevance": 13.86951732635498,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Italian Prime Minister Silvio Berlusconi's cabinet approved on Wednesday a package of tough measures against illegal immigration and crime which have raised concern in the European Union that they could foment racism.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the phrase 'tough measures' and the suggestion that they could 'foment racism' implies a negative judgment and could influence the reader's perception negatively towards the policy without providing a balanced view."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias through the use of word choice, suggesting a negative connotation towards the immigration measures by framing them as 'tough' and implying they could 'foment racism.' This indicates a general bias tendency against the immigration policies of the Italian government."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.3333333333333333,
            "overall_rating": 0.4666666666666667
        },
        "combined_score": 0.0
    },
    {
        "Title": "Italy rejects criticism of immigration measures",
        "URL": "Italy rejects criticism of immigration measures.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    ROME, June 3 (Reuters) - Italy's foreign minister shrugged  off the latest criticism of draft legislation to make illegal  immigration a jailable offence, saying the country would be in  good company once it came into law.      Franco Frattini said illegal immigration was already a  criminal offence in France, Germany, Sweden and the United  Kingdom.      'Should the bill be approved, I will be in fine company  since the ... (measure) is already in force in important  countries of the (European) Union,' he said in an interview  published on Tuesday in Il Messaggero newspaper.      The proposal is part of a package of measures against  illegal immigration drafted by Silvio Berlusconi's government  which have caused concern in Europe that they might foment  racism.      It proposes to confiscate apartments rented to illegal  immigrants, speed up expulsions, extend the time they can be  held and turn some camps for immigrants into detention centres.      Outgoing United Nations human rights chief Louise Arbour  criticised the measures on Monday, describing them as an example  of repression and intolerance.      The Vatican also came out against them. Archbishop Agostino  Marchetti telling Radio Vaticana that illegal immigrants should  not be treated as criminals because those who worked were making  a contribution to society.   (Reporting by Gilles Castonguay; Editing by Charles Dick)   ((gilles.castonguay@reuters.com; +30 02 6612 9507; Reuters  Messaging: gilles.castonguay.reuters.com@reuters.net))    Keywords: ITALY IMMIGRANTS/       ",
        "Histogram": [
            0,
            0,
            0,
            0.6,
            0,
            0.6,
            0.6,
            0.6,
            0
        ],
        "Relevance": 13.822868347167969,
        "BiasReport": {
            "sentences": [
                {
                    "text": "The proposal is part of a package of measures against illegal immigration drafted by Silvio Berlusconi's government which have caused concern in Europe that they might foment racism.",
                    "bias_type": "Discriminatory Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence implies a link between the measures and the promotion of racism, without providing evidence for such a claim. It generalizes the impact of the measures on a broad group (Europeans) and suggests a negative consequence (fomenting racism) without a balanced perspective."
                },
                {
                    "text": "Outgoing United Nations human rights chief Louise Arbour criticised the measures on Monday, describing them as an example of repression and intolerance.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of words like 'repression' and 'intolerance' carries a negative connotation and implies a judgment about the nature of the measures without a neutral presentation of facts. This choice of language can influence the reader's perception towards viewing the measures negatively."
                },
                {
                    "text": "The Vatican also came out against them. Archbishop Agostino Marchetti telling Radio Vaticana that illegal immigrants should not be treated as criminals because those who worked were making a contribution to society.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence presents the opinion of Archbishop Agostino Marchetti as a counterpoint to the measures, framing it in a way that suggests a moral judgment on the treatment of illegal immigrants. By highlighting the contribution of illegal immigrants to society, it subtly promotes a specific viewpoint without a balanced discussion."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the topic of immigration measures in Italy, with a general tendency to frame the discussed measures in a negative light by implying links to racism, using negatively connoted words, and presenting specific opinions as counterpoints without a balanced perspective."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.2222222222222222,
            "overall_rating": 0.4111111111111111
        },
        "combined_score": 0.0
    },
    {
        "Title": "US immigration raids Ohio restaurants, arrests 58",
        "URL": "US immigration raids Ohio restaurants, arrests 58.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    CINCINNATI, July 23 (Reuters) - U.S. immigration agents  raided eight Mexican restaurants in northern Ohio on Wednesday  and arrested 58 employees as part of a criminal operation  against illegal immigrants, federal authorities said.      All those arrested were citizens of Mexico and working at  Casa Fiesta, a chain of Mexican restaurants in Ashland,  Fremont, Norwalk, Oberlin, Oregon, Sandusky, Vermillion and  Youngstown, Ohio, Immigration and Customs Enforcement said in a  statement.      It said the raid was the culmination of more than a  yearlong investigation.      Of the 58 arrested, 54 were men. Three of the four women  were released on their own recognizance on humanitarian  grounds, ICE said. They are still required to appear before a  federal immigration judge who will determine whether they have  a legal right to remain in the United States.      The raid was the latest targeting businesses employing  illegal workers.      In May, ICE arrested more than 300 workers at  Agriprocessors Inc, a kosher meat plant in Postville, Iowa. In  August 2007, hundreds of workers at a Koch Foods chicken plant  near Cincinnati were detained in raids, while hundreds more  were detained in December 2006 after a raid at Swift & Co meat  plants in six states.      ICE said it had made 949 criminal arrests in  worksite-related raids since October 2007, including the  arrests of 105 owners, managers, supervisors or human resources  employees who face charges ranging from harboring to knowingly  hiring illegal aliens.      Immigration, specifically what do about 12 million illegal  immigrants living in the United States, is a divisive national  issue.   (Reporting by Andrea Hopkins; Editing by Peter Cooney)   ((andrea.hopkins@thomsonreuters.com; +1 513 699 0045; Reuters  Messaging: andrea.hopkins.reuters.com@reuters.net))  Keywords: USA IMMIGRATION/       ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 13.679086685180664,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides factual information about U.S. immigration raids in Ohio without employing any of the common bias types."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Anti-immigration fervor may fade in U.S. election",
        "URL": "Anti-immigration fervor may fade in U.S. election.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Tim Gaynor      PHOENIX, Feb 8 (Reuters) - What a difference a few weeks  make -- at least when it comes to the U.S. presidential  campaign and the hot issue of immigration.      When the White House race began in earnest with the first  party nominating contests in Iowa in January, a broad field of  Republican candidates vied to demonstrate their toughness on  illegal immigration, pledging more border enforcement and a  crackdown on illegal workers.      But with a narrowing of the races to secure the Republican  and Democratic nominations ahead of November's general  election, the issue could slip lower down the agenda as far as  the candidates are concerned, analysts say.      'Looking forward to the general election, it's not that  immigration is going to be redefined, it's just going to go  away,' predicted Steven Camarota, research director of the  Center for Immigration Studies think-tank, which advocates  reduced immigration.       Sen. John McCain emerged from coast-to-coast 'Super  Tuesday' nominating contests as the most likely Republican  candidate and all but sealed the deal when his nearest rival,  Mitt Romney, pulled out on Thursday.      McCain -- viewed as soft on illegal immigration by his  conservative critics -- co-sponsored a comprehensive  immigration overhaul that was nixed by the Senate in June. His  position earned McCain the lasting enmity of many Republican  voters who will likely push him to take a harder line.      On the Democratic side, the race is down to Sen. Barack  Obama and Sen. Hillary Clinton, who fought to a virtual draw in  the Feb. 5 voting. They both favor measures set out in the  failed immigration bill, which sought to combine tougher border  security with a path to legal status for many of the 12 million  illegal immigrants living in the shadows.      Early Republican front-runner Romney, who ran terse  television advertisements promising get-tough measures on  illegal immigrants, is now out of the race. Mike Huckabee, who  got endorsement from the Minutemen civilian border patrol  group, is now seen as extremely unlikely to stop McCain.      'With Romney and Huckabee fading away, you essentially have  different flavors of the same proposal,' said Mark Jones, a  political science professor at Rice University in Texas.             TAKING THE MIDDLE GROUND      The question of what to do with millions of illegal  immigrants has been a hot-button topic for months in the United  States, and consistently ranks among the top three issues for  voters, alongside the economy and the war in Iraq.      Many Americans see illegal immigrants as a drain on jobs  and resources such as schools and health care. With a recession  looming, anti-immigrant feeling may intensify.      Others argue that most work illegal immigrants hard in  often low-paid jobs that would otherwise go unfilled.      The candidates who are eventually picked to run for  president by each party may try to avoid discussing  immigration, although they are unlikely to be successful. When  forced to address the issue, they could seek the hitherto  elusive middle ground, analysts said.      'Presidential candidates from both parties are going to  want to avoid it, and when they can't avoid it, they are going  to want to straddle,' said Tamar Jacoby, a senior research  fellow at the Manhattan Institute think-tank, who supported the  bipartisan Senate immigration bill.      'If you go too far in the restrictionist direction it's  going",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.5,
            0,
            0,
            0,
            0
        ],
        "Relevance": 13.676615715026855,
        "BiasReport": {
            "sentences": [
                {
                    "text": "With a recession looming, anti-immigrant feeling may intensify.",
                    "bias_type": "Discriminatory Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence implies a generalization that anti-immigrant sentiment will increase due to economic concerns, without acknowledging the complexity of immigration's impact on the economy or the diversity of opinions on the matter."
                },
                {
                    "text": "Others argue that most work illegal immigrants hard in often low-paid jobs that would otherwise go unfilled.",
                    "bias_type": "Generalization Bias",
                    "bias_strength": 0.5,
                    "bias_description": "This statement generalizes the positive impact of illegal immigrants' work without providing evidence for the claim or acknowledging differing perspectives on the issue."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the topic of immigration, with a general tendency towards discriminatory and generalization biases. It presents viewpoints that could reinforce stereotypes and oversimplify the complex issue of immigration's effects on the economy and society."
            }
        },
        "Scores": {
            "average_bias_strength": 0.55,
            "percentage_of_biased_sentences": 0.05,
            "overall_rating": 0.30000000000000004
        },
        "combined_score": 0.0
    },
    {
        "Title": "France says tough immigration policies are working",
        "URL": "France says tough immigration policies are working.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Gerard Bon      PARIS, June 19 (Reuters) - Tougher immigration policies  launched in President Nicolas Sarkozy's first year in office are  working, with more illegal migrants expelled and more skilled  workers let in, France's immigration minister said on Thursday.      France has said harmonising immigration policies at EU level  was one of its priorities for its six-month presidency of the  bloc that starts on July 1, and the ruling UMP party said the  data released on Thursday should help it persuade EU partners.      'The UMP would like to see our country's firm and just  policies become the policies of the whole of Europe on the  occasion of the French presidency,' the party said after  Immigration Minister Brice Hortefeux's statement.      Hortefeux said 14,660 illegal migrants were expelled from  France in the first five months of the year, up 80 percent  compared with the same period in 2007.      In the 12 months to May 2008, Sarkozy's first year in  office, almost 30,000 illegal migrants were expelled, up 31  percent year-on-year, Hortefeux said.      'Never have so many clandestine immigrants been taken back  to their own countries in a year,' Hortefeux told a news  conference at his ministry in Paris.      The number of illegal migrants in France, estimated between  200,000 and 400,000, is decreasing, he said.            CAMPAIGN PLEDGE      Tougher immigration policies were a key campaign promise by  Sarkozy, who has been criticised for setting Hortefeux annual  targets for the number of illegal migrants expelled from the  country. Human rights activists say such targets are arbitrary.      This year's expulsions target is 26,000, which Hortefeux  said he was confident would be reached.      Another target set by Sarkozy was to increase the proportion  of economic migrants, as opposed to those arriving to join  relatives, to 50 percent of new arrivals from 7 percent now.      Hortefeux said he was on course to achieve that goal, with  30,710 skilled workers allowed into the country in the 12 months  to May 31, up 36 percent compared with the previous 12 months.      So far this year, 13,429 work permits for foreigners have  been issued, and they represent 16 percent of total new arrivals  in the period, said Hortefeux.      France has been saying since last year that it would propose  an EU charter on immigration during its six-month stint as  president of the bloc, and it hoped to achieve an agreement on  the text by the end of the year.     (Writing by Estelle Shirbon)   ((estelle.shirbon@reuters.com, +33 1 4949 5342, Reuters  Messaging: estelle.shirbon.reuters.com@reuters.net))    Keywords: FRANCE IMMIGRATION/       ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0.6,
            0
        ],
        "Relevance": 13.514885902404785,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Tougher immigration policies were a key campaign promise by Sarkozy, who has been criticised for setting Hortefeux annual targets for the number of illegal migrants expelled from the country. Human rights activists say such targets are arbitrary.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence presents the criticism of Sarkozy's immigration policies in a way that implies a negative judgment on the use of annual targets, suggesting they are arbitrary and therefore not based on objective measures."
                },
                {
                    "text": "France has been saying since last year that it would propose an EU charter on immigration during its six-month stint as president of the bloc, and it hoped to achieve an agreement on the text by the end of the year.",
                    "bias_type": "Speculation Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The sentence speculates on the future success of France's proposal for an EU charter on immigration, implying a level of certainty about the outcome without concrete evidence."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding immigration policies in France, particularly in the way it presents the criticism of Sarkozy's policies and speculates on the success of France's proposal for an EU charter on immigration."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.13333333333333333,
            "overall_rating": 0.36666666666666664
        },
        "combined_score": 0.0
    },
    {
        "Title": "Activists protest immigration raids in Phoenix",
        "URL": "Activists protest immigration raids in Phoenix.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Tim Gaynor      PHOENIX, Feb 28 (Reuters) - Thousands of people protesting  a sweeping crackdown on illegal immigrants by an Arizona  sheriff marched through Phoenix on Saturday, toting placards  reading 'We Are Human' and 'Stop the Raids.'      Maricopa County Sheriff Joe Arpaio has dispatched deputies  into Hispanic communities in the Phoenix area where they stop  people and arrest anyone who cannot prove he or she is a legal  U.S. resident.      Under a deal allowing them to enforce federal immigration  laws, the deputies have arrested more than 1,500 people whom  they determined were in Arizona illegally.      Latino activists and lawmakers call his program a clear  case of racial profiling because only people who look Hispanic  are targeted. Arpaio steadfastly denies the charge.      Earlier this month, he stirred more controversy when he  marched 220 illegal immigrants in shackles and striped prison  garb through Phoenix under armed guard.      'Walking people through the streets in chains, public  shaming, it's medieval,' said Veronica Perez, 32, an  archeologist carrying signs reading 'No Human Is Illegal' and  'Stop the Raids.'      'Isn't cruel and unusual punishment against the U.S.  Constitution?' she asked.      The event was organized by activists from the National Day  Laborer Organizing Network and a group called El Puente  Arizona. Estimates of the number of participants ranged from  1,000 to 3,000.      Preparing for the march at a park in central Phoenix,  school district coordinator Sylvia Airington, 47, slammed  Arpaio's policies.      'Racial profiling, targeting the Hispanic community -- it's  an embarrassment to America,' she said.      What to do about an estimated 12 million illegal immigrants  in the United States is an explosive political issue. But it  has largely dropped out of the debate as concerns turn to the  economic crisis.      A bid to push comprehensive immigration reform through  Congress was rejected by Republican lawmakers two years ago.  President Barack Obama, who supported the measure, has yet to  address the matter.      'I voted for Obama for change,' said welder Oscar Camacho,  45. 'But with respect to immigration, I see no change at all.'      Around 100 counter-demonstrators waving American flags  turned out to support Arpaio on Saturday. Some carried  holstered pistols.      'He is the only one to uphold illegal immigration laws,'  said Dina Rose, 52, standing on sidewalk by the sheriff's  office in downtown Phoenix. 'The county sheriff is America's  last hope of protecting our freedoms.'   (Editing by Xavier Briand)   ((Tim.Gaynor@thomsonreuters.com; +1 480 588 5296))  Keywords: IMMIGRATION PROTEST/        ",
        "Histogram": [
            0,
            0,
            0.6,
            0.6,
            0.6,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0.5,
            0.5,
            0,
            0,
            0.9,
            0.9,
            0
        ],
        "Relevance": 13.496196746826172,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Under a deal allowing them to enforce federal immigration laws, the deputies have arrested more than 1,500 people whom they determined were in Arizona illegally.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the phrase 'whom they determined were in Arizona illegally' implies a definitive and unbiased judgment, potentially influencing the reader's perception without acknowledging the complexities of immigration status determination."
                },
                {
                    "text": "Latino activists and lawmakers call his program a clear case of racial profiling because only people who look Hispanic are targeted. Arpaio steadfastly denies the charge.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The sentence uses the phrase 'only people who look Hispanic are targeted' in a way that suggests a clear and unjust bias, which could influence the reader's perception without a balanced presentation of the evidence."
                },
                {
                    "text": "'Walking people through the streets in chains, public shaming, it's medieval,' said Veronica Perez, 32, an archeologist carrying signs reading 'No Human Is Illegal' and 'Stop the Raids.'",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of emotionally charged language such as 'medieval' and 'public shaming' is designed to evoke a strong emotional response, potentially overshadowing a more balanced discussion on the issue."
                },
                {
                    "text": "'Racial profiling, targeting the Hispanic community -- it's an embarrassment to America,' she said.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Describing the situation as 'an embarrassment to America' employs emotional sensationalism to convey disapproval, potentially leading the reader to a one-sided emotional response rather than a nuanced understanding of the complexities involved."
                },
                {
                    "text": "What to do about an estimated 12 million illegal immigrants in the United States is an explosive political issue. But it has largely dropped out of the debate as concerns turn to the economic crisis.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'explosive' to describe the political issue and the assertion that it has 'largely dropped out of the debate' due to economic concerns could suggest a dismissive attitude towards the complexity and ongoing relevance of the immigration issue."
                },
                {
                    "text": "'I voted for Obama for change,' said welder Oscar Camacho, 45. 'But with respect to immigration, I see no change at all.'",
                    "bias_type": "Anecdotal Evidence Bias",
                    "bias_strength": 0.5,
                    "bias_description": "Presenting the anecdotal experience of a single individual as representative of a broader issue can lead to an oversimplified and potentially biased understanding of the complexities involved in immigration policy and its implementation."
                },
                {
                    "text": "'He is the only one to uphold illegal immigration laws,' said Dina Rose, 52, standing on sidewalk by the sheriff's office in downtown Phoenix. 'The county sheriff is America's last hope of protecting our freedoms.'",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "The statement presents a highly subjective opinion as an unquestionable truth, suggesting a lack of objectivity and a strong bias in favor of the sheriff's actions without a balanced consideration of the legal and ethical dimensions of immigration enforcement."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the topic of immigration enforcement in Phoenix, particularly in its portrayal of the actions of Maricopa County Sheriff Joe Arpaio and the responses of activists and community members. The biases identified include Word Choice Bias, Emotional Sensationalism Bias, Anecdotal Evidence Bias, and Opinionated Bias, indicating a general bias tendency towards presenting a one-sided and emotionally charged perspective on the issue."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6285714285714287,
            "percentage_of_biased_sentences": 0.4,
            "overall_rating": 0.5142857142857143
        },
        "combined_score": 0.0
    },
    {
        "Title": "U.S. immigration agents nab 300 in factory swoop",
        "URL": "U.S. immigration agents nab 300 in factory swoop.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    PHOENIX, Oct 7 (Reuters) - U.S. immigration agents arrested  about 300 workers at a South Carolina poultry plant on Tuesday,  the latest in a series of workplace raids targeting illegal  immigrants and employers across the United States.      The Immigration and Customs Enforcement agency (ICE) said  federal agents arrested the workers at the Columbia Farms  poultry processing plant in Greenville.      The nationalities of those arrested were not immediately  clear.      The swoop followed a 10-month criminal investigation that  had already resulted in charges against 11 supervisors and one  human resources manager, ICE said in a statement.      'Today's enforcement operation is the latest step in a  comprehensive criminal investigation focused on identifying the  individuals involved in allowing unauthorized workers to gain  employment,' said Kenneth Smith, the ICE special agent in  charge in Atlanta, Georgia.      'ICE targets employers because the promise of employment  draws illegal workers across our borders. By holding employers  accountable, we are diminishing the magnet and discouraging  others from breaking the law.'      All of the arrested workers were interviewed, fingerprinted  and photographed by ICE agents and were due to be processed for  removal from the United States, ICE said.      Immigration, particularly the issue of what to do with some  12 million illegal immigrants, most of them Hispanic, stirs  strong passions in the United States.      The raid in Greenville was the latest by ICE, which has  stepped up operations targeting illegal immigrants and their  employers across the United States in recent months.      In late August, agents arrested 595 workers at the Howard  Industries Inc. factory in Laurel, Miss., in the largest  workplace immigration raid to date.   (Reporting by Tim Gaynor; Editing by John O'Callaghan)   ((Tim.Gaynor@thomsonreuters.com; +1 480 588 5296))  Keywords: IMMIGRATION USA/ARREST       ",
        "Histogram": [
            0,
            0,
            0.3,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0,
            0,
            0
        ],
        "Relevance": 13.364165306091309,
        "BiasReport": {
            "sentences": [
                {
                    "text": "The nationalities of those arrested were not immediately clear.",
                    "bias_type": "Ambiguous Attribution Bias",
                    "bias_strength": 0.3,
                    "bias_description": "This sentence creates ambiguity by not specifying the nationalities of the arrested workers, potentially leading to assumptions or generalizations about the group targeted by the raid."
                },
                {
                    "text": "Immigration, particularly the issue of what to do with some 12 million illegal immigrants, most of them Hispanic, stirs strong passions in the United States.",
                    "bias_type": "Generalization Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence generalizes the characteristics of a large group (12 million illegal immigrants) by attributing a specific nationality (Hispanic) to the majority, which can perpetuate stereotypes and oversimplify a complex issue."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding immigration, specifically through the use of generalization and ambiguous attribution, which can influence perceptions and attitudes towards the targeted groups."
            }
        },
        "Scores": {
            "average_bias_strength": 0.44999999999999996,
            "percentage_of_biased_sentences": 0.08333333333333333,
            "overall_rating": 0.26666666666666666
        },
        "combined_score": 0.0
    },
    {
        "Title": "UPDATE 1-Italy's Berlusconi rows back on immigration rules",
        "URL": "UPDATE 1-Italy's Berlusconi rows back on immigration rules.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": " (Adds Berlusconi comments)       By Silvia Aloisi      ROME, June 3 (Reuters) - Italy's Prime Minister Silvio  Berlusconi on Tuesday backtracked on a controversial bill that  would make illegal immigration a jailable offence after the  United Nations and the Vatican criticised the measure.      Berlusconi's new conservative government last month unveiled  tough measures aimed at fighting crime and illegal immigration  but which critics say risk fuelling xenophobia and racism.      One of the most controversial steps, still to be discussed  and approved by parliament, states that illegal entry into Italy  is a crime punishable by up to four years in jail.      However Berlusconi said on Tuesday that people should not be  prosecuted simply for being illegal immigrants, but their status  should be considered an aggravating circumstance if they  committed a crime.      'Personally, I don't think you can prosecute someone for  their illegal presence in our country,' Berlusconi said during a  joint news conference with French President Nicolas Sarkozy.      'Parliament is sovereign and will decide according to its  conscience and common sense,' he said.      The security package also proposes confiscating apartments  rented to illegal immigrants, speeding up expulsions and  extending the time they can be held in detention centres.      Outgoing United Nations human rights chief Louise Arbour on  Monday, describing the measures as an example of repression and  intolerance.      The Vatican also came out against them. Archbishop Agostino  Marchetti told Vatican radio that illegal immigrants should not  be treated as criminals because those who worked were making a  contribution to society.      Foreign Minister Franco Frattini shrugged off the criticism  earlier on Tuesday, saying illegal immigration was already a  criminal offence in France, Germany, Sweden and Britain.      Berlusconi was sworn in as prime minister last month after  decisively winning an April election on a law and order ticket.      Italy saw a record rise in immigration last year with  foreigners now totalling 3.5 million, and many Italians blame  immigrants -- especially Romanians and Roma people -- for crime.   (Additional reporting by Gilles Castonguay; Editing by Giles  Elgood)   ((silvia.aloisi@reuters.com; +39 0685 22 4392; Reuters  Messaging: silvia.aloisi.reuters.com@reuters.net))    Keywords: ITALY IMMIGRANTS/        ",
        "Histogram": [
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0.6,
            0,
            0,
            0.2,
            0,
            0,
            0
        ],
        "Relevance": 13.324054718017578,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Berlusconi's new conservative government last month unveiled tough measures aimed at fighting crime and illegal immigration but which critics say risk fuelling xenophobia and racism.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The sentence uses language that suggests the measures are inherently controversial and could exacerbate xenophobia and racism, without providing a balanced view or evidence."
                },
                {
                    "text": "One of the most controversial steps, still to be discussed and approved by parliament, states that illegal entry into Italy is a crime punishable by up to four years in jail.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'controversial' to describe the steps implies a negative judgment without presenting a neutral perspective, influencing the reader's perception."
                },
                {
                    "text": "Outgoing United Nations human rights chief Louise Arbour on Monday, describing the measures as an example of repression and intolerance.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The choice of words 'repression and intolerance' to characterize the measures strongly implies a negative and unjust approach, suggesting a biased perspective."
                },
                {
                    "text": "Foreign Minister Franco Frattini shrugged off the criticism earlier on Tuesday, saying illegal immigration was already a criminal offence in France, Germany, Sweden and Britain.",
                    "bias_type": "False Balance Bias",
                    "bias_strength": 0.2,
                    "bias_description": "This sentence presents a counterargument to the criticism without addressing the specific concerns raised, implying an equal validity to both perspectives when the context may warrant a more in-depth examination."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the topic of immigration in Italy, with a general tendency to use emotionally charged language, selective word choices, and a lack of balance in presenting opposing viewpoints."
            }
        },
        "Scores": {
            "average_bias_strength": 0.49999999999999994,
            "percentage_of_biased_sentences": 0.07142857142857142,
            "overall_rating": 0.2857142857142857
        },
        "combined_score": 0.0
    },
    {
        "Title": "FACTBOX-Italy clamps down on illegal immigrants, crime",
        "URL": "FACTBOX-Italy clamps down on illegal immigrants, crime.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    May 21 (Reuters) - Following are key points from tough new  measures against illegal immigration and crime announced by  Italian Prime Minister Silvio Berlusconi's government on  Wednesday.      Some of the measures will go into effect immediately through  a decree, which must later win approval from parliament to stay  in force. Others will be presented as draft legislation which  the government expects to push through parliament by end July.            ILLEGAL IMMIGRATION      * Makes illegal immigration a jailable offence, punishable  with sentences of between 6 months and four years       * Easier expulsion for illegal immigrants       * Confiscation of property rented to illegal immigrants      * Extends time required for foreign spouses to gain Italian  citizenship to two years if the person lives in Italy, three  years if not       * Makes it a crime punishable with up to 3 years in jail to  use minors to beg for money       * Obliges firms that carry out international cash transfers  to obtain a copy of client's identification       * Prolongs amount of time illegal immigrants can remain in   'Centres for Identification and Expulsion', after being detained  by authorities      * New rules for naturalised Italians who seek to bring  foreign relatives into Italy       * Verifies income of EU citizens staying in Italy         OTHER KEY MEASURES       * Prohibits plea bargaining during appeals for mafia-related  crimes      * Gives greater powers over security to mayors in emergency  situations       * Increases sentences for driving under the influence of  alcohol or drugs      (Writing by Phil Stewart)      ((phillip.stewart@reuters.com; +39 06 8522 4350;  phillip.stewart.reuters.com@reuters.net))situations       * Increases sentences for driving under the influence of  alcohol or drugs      (Writing by Phil Stewart)      ((phillip.stewart@reuters.com; +39 06 8522 4350;  phillip.stewart.reuters.com@reuters.net))              Keywords: ITALY IMMIGRATION/        ",
        "Histogram": [
            0,
            0,
            0,
            0.6
        ],
        "Relevance": 13.282968521118164,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Makes illegal immigration a jailable offence, punishable with sentences of between 6 months and four years",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the term 'jailable offence' and the specific range of sentences imply a strong negative connotation towards illegal immigration, suggesting a judgment about the severity of the action."
                },
                {
                    "text": "Easier expulsion for illegal immigrants",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The term 'easier expulsion' implies a positive change for the country, potentially biasing the reader towards viewing the policy as a necessary and beneficial measure without considering the complexities of immigration issues."
                },
                {
                    "text": "Confiscation of property rented to illegal immigrants",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'confiscation' suggests a punitive and forceful action, potentially evoking a sense of injustice or harshness towards landlords who may not have been aware of their tenants' immigration status."
                },
                {
                    "text": "Prohibits plea bargaining during appeals for mafia-related crimes",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The inclusion of 'mafia-related crimes' specifically targets a criminal organization, evoking strong negative connotations, and may lead to a biased perception that the government is taking a tough stance against organized crime, potentially overshadowing the broader implications of such a legal change."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding immigration and crime policies in Italy, with a general tendency to use word choice that implies judgment, severity, and a one-sided perspective on the issues discussed."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.25,
            "overall_rating": 0.425
        },
        "combined_score": 0.0
    },
    {
        "Title": "Kansas City official resigns over immigration flap",
        "URL": "Kansas City official resigns over immigration flap.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Carey Gillam      KANSAS CITY, Mo., Jan 22 (Reuters) - A Kansas City parks  official whose membership in an anti-illegal immigration group  sparked the cancellation of two conventions here has resigned.      Kansas City parks board commissioner Frances Semler, a  member of the Minuteman Civil Defense Corps (MCDC) which runs  patrols on the U.S. border with Mexico as part of its effort to  prompt more enforcement of U.S. immigration laws, resigned late  on Monday, the city said.      Her resignation marks the latest skirmish in an  increasingly emotional debate across America over illegal  immigration.      Although Kansas City is far from the Mexican border, the  focal point for arguments over how to handle illegal crossings  into the United States, the debate over Semler's views has  spotlighted deep divisions among Americans on the issue.      Last week, the Southern Christian Leadership Conference  said because of Semler's views it would join the National  Council of La Raza, a U.S. Hispanic advocacy group, in  rejecting Kansas City for national conventions previously  planned for the city.      Semler said frustration with a lack of enforcement of U.S.  immigration laws led her to join the Minuteman group in  December. She had planned to attend a meeting of the  organization planned for Kansas City on Feb. 1-2 but was warned  by Mayor Mark Funkhouser not to attend.      'Any individual or organization who speaks with concern of  the impact of the well-organized invasion of illegals in this  country is subjected to being called terms such as bigot or  racist,' Semler said in her resignation letter.      Southern Christian Leadership Conference CEO Charles Steele  Jr. also urged other civil rights groups to boycott the city.      Leaders of the organizations could not be reached for  comment on Tuesday, but in the past they and other critics said  the Minuteman group is a racist organization that uses guns and  intimidation against minorities.      In contrast, the group, which counts about 9,000 members  nationally, says it is a peaceful organization trying to uphold  U.S. law. Its has member patrols along the U.S. border with  Mexico and reports illegal crossings to law enforcement  agencies.      'Mayor Funkhouser is clearly running a sanctuary city (for  illegal immigrants) in Kansas City, and rather than demonstrate  some leadership by enforcing the laws, he has chosen to play  racial politics...' said Chris Simcox, Minuteman Civil Defense  Corps president.   (Reporting by Carey Gillam; Editing by Cynthia Osterman)   ((carey.gillam@reuters.com ; +1 913 663 2658; Reuters  Messaging: carey.gillam.reuters.com@reuters.net ))  Keywords: IMMIGRATION MISSOURI       ",
        "Histogram": [
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0,
            0
        ],
        "Relevance": 13.260684967041016,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Her resignation marks the latest skirmish in an increasingly emotional debate across America over illegal immigration.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'skirmish' and 'increasingly emotional' to describe the debate over illegal immigration introduces a hyperbolic and provocative tone, designed to evoke strong emotions and sensationalize the issue."
                },
                {
                    "text": "Although Kansas City is far from the Mexican border, the focal point for arguments over how to handle illegal crossings into the United States, the debate over Semler's views has spotlighted deep divisions among Americans on the issue.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'focal point' and the emphasis on 'deep divisions' suggest a judgment about the significance and intensity of the debate, implying that it is a more contentious issue than others."
                },
                {
                    "text": "'Any individual or organization who speaks with concern of the impact of the well-organized invasion of illegals in this country is subjected to being called terms such as bigot or racist,' Semler said in her resignation letter.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'invasion of illegals' carries a strong negative connotation and is a charged way to describe immigration, implying judgment and evoking a sense of threat or crisis."
                },
                {
                    "text": "Southern Christian Leadership Conference CEO Charles Steele Jr. also urged other civil rights groups to boycott the city.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The call for a boycott, especially from a prominent figure, is a provocative action that can escalate the emotional intensity of the issue, suggesting a dramatic response to the controversy."
                },
                {
                    "text": "Leaders of the organizations could not be reached for comment on Tuesday, but in the past they and other critics said the Minuteman group is a racist organization that uses guns and intimidation against minorities.",
                    "bias_type": "Unsubstantiated Claims Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The assertion that the Minuteman group is 'a racist organization that uses guns and intimidation against minorities' is presented without evidence, functioning as an unsubstantiated claim that could influence perceptions negatively."
                },
                {
                    "text": "'Mayor Funkhouser is clearly running a sanctuary city (for illegal immigrants) in Kansas City, and rather than demonstrate some leadership by enforcing the laws, he has chosen to play racial politics...' said Chris Simcox, Minuteman Civil Defense Corps president.",
                    "bias_type": "Political Bias",
                    "bias_strength": 0.8,
                    "bias_description": "This statement exhibits a clear political bias by accusing the mayor of 'playing racial politics' and running a 'sanctuary city,' using charged language to imply negligence and manipulation for political gain."
                }
            ],
            "overall_bias": {
                "conclusion": "The article is biased regarding the topic of illegal immigration, with a general bias tendency towards portraying the issue in a highly emotional and politically charged manner. The use of provocative language, unsubstantiated claims, and the framing of the debate as deeply divisive all contribute to a biased presentation."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6333333333333333,
            "percentage_of_biased_sentences": 0.21428571428571427,
            "overall_rating": 0.4238095238095238
        },
        "combined_score": 0.0
    },
    {
        "Title": "U.S. appeals court upholds Arizona immigration law",
        "URL": "U.S. appeals court upholds Arizona immigration law.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    LOS ANGELES, Sept 17 (Reuters) - A U.S. appeals court on  Wednesday upheld an Arizona law that targets employers who hire  illegal immigrants by revoking their licenses to do business in  the state.      The U.S. 9th Circuit Court of Appeals noted that the 2007  law, which has not been enforced, arose from 'rising  frustration with the United States Congress's failure to enact  comprehensive immigration reform.'      Some 12 million illegal immigrants are believed to live in  the United States; many work with false papers and the issue of  what to do with them has become a political hot potato.      It was not immediately clear whether Arizona would now  begin enforcing the law or if its opponents would appeal to the  U.S. Supreme Court.      Arizona passed the employer sanctions law after a federal  immigration overhaul died in the U.S. Congress in June 2007.      Immigration, business and civil rights groups challenged  the law, saying it was preempted by federal rules governing  immigration.      The groups also contended the law, called the Legal Arizona  Workers Act, violates employers' due process rights by denying  them the chance to challenge allegations that their workers are  illegal before their licenses are revoked.      But the appeals court ruled that federal law does not  preempt the Act or its requirement that employers to use an  electronic verification system to check the work-authorization  status of employees through federal records.      The court also ruled that the law 'can and should be  reasonably interpreted to allow employers, before any license  can be adversely affected, to present evidence to rebut the  presumption that an employee is unauthorized.'      Although the court upheld the law 'in all respects', it  noted that its opinion did not bar later challenges once it is  enforced.    (Reporting by Gina Keating; Editing by Tim Gaynor and Alan  Elsner)  ((gina.keating@thomsonreuters.com; +1 213 955 6776; Reuters  Messaging; gina.keating.reuters.com@reuters.net)) Keywords:  IMMIGRATION/APPEAL  Keywords: IMMIGRATION/APPEAL       ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 13.25955867767334,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to exhibit bias. It provides a factual report on the U.S. appeals court's decision to uphold an Arizona immigration law, presenting information on the law's background, legal challenges, and the court's ruling without introducing subjective or misleading elements."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "WRAPUP 3-Obama, McCain spar over immigration",
        "URL": "WRAPUP 3-Obama, McCain spar over immigration.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    *Obama and McCain court Hispanic vote      *Fastest growing minority is now 9 percent of electorate      *Obama says McCain flip-flopped on immigration policy           By John Whitesides and Jeff Mason      WASHINGTON, June 28 (Reuters) - Democrat Barack Obama and  Republican John McCain courted Hispanic support on Saturday,  and Obama accused his White House rival of backing away from  comprehensive U.S. immigration reform under pressure from his  party.      In separate appearances before a group of Latino public  officials, the two presidential contenders portrayed themselves  as dedicated champions for Hispanics -- a fast-growing and  critical swing voting bloc in November's election.      Obama took aim at McCain's approach to comprehensive  immigration reform and his change of emphasis on legislation to  offer a pathway to citizenship for the country's 12 million  illegal immigrants.      McCain, an Arizona senator, broke with his party and worked  for the plan, which ultimately failed in Congress amid heavy  Republican opposition.      But he shifted his approach during the fight for the  party's nomination to emphasize the need to secure U.S. borders  before addressing the status of illegal immigrants.      'One place where Senator McCain used to offer change was on  immigration. He was a champion of comprehensive reform, and I  admired him for it,' Obama, an Illinois senator who supported  the proposal, told the National Association of Latino Elected  and Appointed Officials.      'But when he was running for his party's nomination, he  walked away from that commitment. He said he wouldn't even  support his own legislation if it came up for a vote,' he said.  'If we are going to solve the challenges we face, we can't  vacillate, we can't shift depending on our politics.'      McCain, who appeared before the group ahead of Obama,  admitted the plan 'wasn't very popular with some in my party'  but said he would still work for a broad-based overhaul of U.S.  immigration laws.      'It'll be my top priority yesterday, today and tomorrow,'  McCain said when asked if immigration reform would be high on  his to-do list in his first 100 days in office.      A McCain spokesman accused Obama of voting for 'poison  pill' amendments that doomed the immigration deal.      'It was Obama himself who worked to kill the Senate's  bipartisan immigration reform compromise last year,' Brian  Rogers said in a statement.      The Obama campaign shot back that McCain had thanked Obama  for his support on the issue in 2006.      McCain told the Latino officials the proposal failed  because Americans were not confident Congress would protect  U.S. borders before dealing with the question of illegal  immigration.           'GOD'S CHILDREN'      'I want to assure you we will address this issue in a  humane and compassionate fashion,' he said, calling illegal  immigrants 'God's children.'      Hispanics are the fastest growing minority group in the  United States and account for about 9 percent of the national  electorate. They could be a critical swing voting bloc in  November battleground states like Florida and in the U.S.  Southwest.      In 2004, President George W. Bush won about 40 percent of  the Hispanic vote -- a Republican record -- in defeating  Democrat John Kerry. But opinion polls show Republicans have  been hurt with Hispanics by the debate over immigration  reform.      Obama has had his own problem with Hispanics, who heavily  suppo",
        "Histogram": [
            0,
            0,
            0.6,
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 13.226767539978027,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Obama took aim at McCain's approach to comprehensive immigration reform and his change of emphasis on legislation to offer a pathway to citizenship for the country's 12 million illegal immigrants.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'took aim' implies a confrontational or aggressive approach, suggesting a negative judgment about Obama's actions towards McCain."
                },
                {
                    "text": "'One place where Senator McCain used to offer change was on immigration. He was a champion of comprehensive reform, and I admired him for it,' Obama, an Illinois senator who supported the proposal, told the National Association of Latino Elected and Appointed Officials.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence includes Obama's subjective opinion ('I admired him for it') as a statement of fact, blurring the line between personal perspective and objective reporting."
                },
                {
                    "text": "A McCain spokesman accused Obama of voting for 'poison pill' amendments that doomed the immigration deal.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'poison pill' to describe the amendments introduces a negative connotation, implying that Obama's actions were deliberately harmful, without providing a neutral or objective description of the amendments' effects."
                },
                {
                    "text": "The Obama campaign shot back that McCain had thanked Obama for his support on the issue in 2006.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'shot back' suggests a defensive or aggressive response, framing the interaction between the Obama campaign and McCain in combative terms rather than neutral or cooperative ones."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias through the use of word choice and opinionated statements, particularly in the portrayal of the interactions between Obama and McCain regarding immigration reform. The general bias tendency leans towards presenting the candidates' actions and responses in a confrontational and judgmental light."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.13636363636363635,
            "overall_rating": 0.36818181818181817
        },
        "combined_score": 0.0
    },
    {
        "Title": "FEATURE-In U.S., some illegal immigrants are rich",
        "URL": "FEATURE-In U.S., some illegal immigrants are rich.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By John Buchanan      ATLANTA, Feb 6 (Reuters) - Many illegal immigrants in the  United States are manual laborers on low wages. But there's  another group that attracts much less attention: entrepreneurs who  have set up businesses, created jobs and grown affluent.      There are up to 20,000 illegal immigrants earning upward of  $100,000 a year as entrepreneurs, and their existence challenges  the stereotype that illegal immigrants are a drain on the U.S.  economy, according to immigration lawyers and academics.      Many say they are living the 'American Dream,' but almost none  trumpet their achievements because they fear deportation.      One example is a 38-year-old computer engineer who overstayed  his visa after arriving from Colombia in 1999. Not long after, he  founded a Web design firm in Miami that specializes in  e-commerce.      Today it's a fast-growing, tax-paying company that recently  developed a Web platform for online radio and television that  could be a breakthrough technology.      'We are at a good point now, making money,' said the man, who  spoke on condition of anonymity because of his immigration status.  'We are growing every month because our customers are happy. They  are U.S. companies making a lot of money from our Web sites.'      But the man is near the end of a long administrative process  that will likely lead to his deportation. Then his company would  close and workers, including Americans, would be laid off.      'I have always tried to look at things in a positive way but  now I am disappointed,' he said in a telephone interview.      Michael Bander, a Miami immigration lawyer who has represented  the man for six years, said his client's dilemma showed a larger  flaw in the immigration system.           SPECIAL STATUS?      It is not easy to determine the number of illegal immigrants  who earn six figure salaries, but there could be 20,000 of them  and a significant proportion earn up to $300,000 a year, said Jeff  Passel, lead demographer at the Pew Hispanic Center in  Washington.      Advocates see the group as trailblazers for the more than 12  million illegal immigrants estimated to be living in the United  States, most from Mexico or other Latin American countries.      'These people should be treated like heroes not criminals,'  said Felipe Korzenny, professor of marketing and communications at  Florida State University. Wealthy illegal immigrants also came  from India, China, Taiwan, Israel and South Africa, he said.      Congress should address their unique situation, not least  because they have more to lose than others, said George Tzamaras,  spokesman for the American Immigration Lawyers Association.      The United States runs a Green Card residence permit program  for investors but it does not apply to those already in the  country illegally.      But opponents of illegal immigration said the United States  should grant no special status according to wealth for people who  break the law.      'They should be deported as existing law dictates. We'd like  to see their assets seized to compensate American taxpayers who  are losing billions of dollars due to rampant illegal  immigration,' said William Gheen, president of Americans for Legal  Immigration.      'We need to send a strong message to people who would like to  come to the U.S. that disrespect for our laws will not lead to  prosperity,' said Gheen.           TEN-YEAR BAN      Under existing law, people who overstay their vi",
        "Histogram": [
            0,
            0.6,
            0.6,
            0.6,
            0.5,
            0.5,
            0,
            0.5,
            0.5,
            0.5,
            0.6,
            0.6,
            0,
            0.6,
            0,
            0.6,
            0,
            0.6,
            0.6,
            0.6,
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0
        ],
        "Relevance": 13.133014678955078,
        "BiasReport": {
            "sentences": [
                {
                    "text": "But there's  another group that attracts much less attention: entrepreneurs who  have set up businesses, created jobs and grown affluent.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'much less attention' implies a judgment that these entrepreneurs deserve more recognition, suggesting a positive bias towards their actions compared to the general perception of illegal immigrants."
                },
                {
                    "text": "There are up to 20,000 illegal immigrants earning upward of  $100,000 a year as entrepreneurs, and their existence challenges  the stereotype that illegal immigrants are a drain on the U.S.  economy, according to immigration lawyers and academics.",
                    "bias_type": "Generalization Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence generalizes the economic impact of illegal immigrants based on a specific group's success, implying that all illegal immigrants may have a similar positive impact, which oversimplifies a complex issue."
                },
                {
                    "text": "Many say they are living the 'American Dream,' but almost none  trumpet their achievements because they fear deportation.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the phrase 'living the American Dream' and the fear of deportation evokes an emotional response, emphasizing the personal struggle and sacrifice without providing a balanced view."
                },
                {
                    "text": "One example is a 38-year-old computer engineer who overstayed  his visa after arriving from Colombia in 1999. Not long after, he  founded a Web design firm in Miami that specializes in  e-commerce.",
                    "bias_type": "Anecdotal Evidence Bias",
                    "bias_strength": 0.5,
                    "bias_description": "This sentence relies on a single anecdote to illustrate the success of an illegal immigrant, potentially skewing the reader's perception by presenting a specific case as representative of a larger group."
                },
                {
                    "text": "'We are at a good point now, making money,' said the man, who  spoke on condition of anonymity because of his immigration status.  'We are growing every month because our customers are happy. They  are U.S. companies making a lot of money from our Web sites.'",
                    "bias_type": "Anecdotal Evidence Bias",
                    "bias_strength": 0.5,
                    "bias_description": "The direct quote further emphasizes the success story of the individual, reinforcing the use of anecdotal evidence to support a broader argument about the positive impact of illegal immigrant entrepreneurs."
                },
                {
                    "text": "But the man is near the end of a long administrative process  that will likely lead to his deportation. Then his company would  close and workers, including Americans, would be laid off.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence uses the potential negative consequences, such as American workers being laid off, to evoke an emotional response and highlight the perceived injustice of the deportation process."
                },
                {
                    "text": "Michael Bander, a Miami immigration lawyer who has represented  the man for six years, said his client's dilemma showed a larger  flaw in the immigration system.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The assertion that the case 'showed a larger flaw in the immigration system' is an opinion presented as a fact, suggesting that the immigration system is inherently flawed based on the experience of one individual."
                },
                {
                    "text": "It is not easy to determine the number of illegal immigrants  who earn six figure salaries, but there could be 20,000 of them  and a significant proportion earn up to $300,000 a year, said Jeff  Passel, lead demographer at the Pew Hispanic Center in  Washington.",
                    "bias_type": "Speculation Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of speculative language ('could be 20,000 of them') based on difficulty in determining the actual numbers introduces uncertainty and implies a potentially larger impact than the evidence supports."
                },
                {
                    "text": "'These people should be treated like heroes not criminals,'  said Felipe Korzenny, professor of marketing and communications at  Florida State University. Wealthy illegal immigrants also came  from India, China, Taiwan, Israel and South Africa, he said.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The statement advocating for treating wealthy illegal immigrants as 'heroes' and contrasting them with 'criminals' is a clear expression of opinion that frames the issue in a highly subjective and emotionally charged manner."
                },
                {
                    "text": "Congress should address their unique situation, not least  because they have more to lose than others, said George Tzamaras,  spokesman for the American Immigration Lawyers Association.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence presents a subjective opinion on the need for congressional action based on the perceived vulnerability of wealthy illegal immigrants, without providing a balanced perspective on the broader implications of such actions."
                },
                {
                    "text": "But opponents of illegal immigration said the United States  should grant no special status according to wealth for people who  break the law.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'according to wealth for people who break the law' frames the issue in a way that emphasizes the legal transgression of the individuals, suggesting a negative bias towards any consideration of their economic contributions."
                },
                {
                    "text": "'They should be deported as existing law dictates. We'd like  to see their assets seized to compensate American taxpayers who  are losing billions of dollars due to rampant illegal  immigration,' said William Gheen, president of Americans for Legal  Immigration.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The call for deportation and asset seizure, along with the use of the term 'rampant illegal immigration,' is designed to provoke an emotional response by highlighting the perceived economic harm and the need for strict enforcement."
                },
                {
                    "text": "'We need to send a strong message to people who would like to  come to the U.S. that disrespect for our laws will not lead to  prosperity,' said Gheen.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This statement uses the language of 'sending a strong message' and the juxtaposition of 'disrespect for our laws' with 'prosperity' to create a dramatic contrast, appealing to the reader's emotions rather than presenting a nuanced argument."
                }
            ],
            "overall_bias": {
                "conclusion": "The article is biased regarding the portrayal of wealthy illegal immigrants, particularly in the context of their economic contributions and the debate over their legal status. It exhibits a general bias tendency towards presenting these individuals in a positive light, emphasizing their successes and the potential negative consequences of deportation, while also critiquing the immigration system and advocating for special considerations based on wealth. This bias is manifested through the use of word choice, emotional sensationalism, opinionated statements, speculation, and anecdotal evidence, which collectively skew the presentation of the issue."
            }
        },
        "Scores": {
            "average_bias_strength": 0.5846153846153844,
            "percentage_of_biased_sentences": 0.46153846153846156,
            "overall_rating": 0.523076923076923
        },
        "combined_score": 0.0
    },
    {
        "Title": "France says no mass amnesty for illegal migrants",
        "URL": "France says no mass amnesty for illegal migrants.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    PARIS, April 24 (Reuters) - France will give work permits to  hundreds of illegal immigrants on a case-by-case basis but will  not offer a general amnesty, the government said on Thursday.      The powerful CGT trade union and the government say  negotiations are going smoothly over the fate of illegal  workers, some of whom have been on strike since last week to  demand legal status.      'Today... around 800 dossiers have been submitted, that  gives an indication of the number,' Immigration Minister Brice  Hortefeux told RTL radio. He also told Le Figaro newspaper there  would be 'no massive regularisation'.      Some restaurant and hotel industry groups say there will be  a crisis unless the government softens its stance on illegal  immigration, and the hotel sector has called for 50,000 to  100,000 work permits to be awarded.      Churches and rights groups regularly call for an end to  deportations, which have increased since President Nicolas  Sarkozy made clamping down on illegal immigration a priority  when he was interior minister in a previous government.      They also want clearer rules to govern illegal immigrants,  but Hortefeux says current measures are sufficient as they   allow local officials to issue work permits to applicants who  are already employed in sectors short of labour.      The far-right National Front rejects any granting of work  permits to illegal immigrants and has called for a protest on  Friday against the hotel industry's request.      Since the 1960s, France has given hundreds of thousands of  work permits to illegal immigrants, though the numbers have been  on a clear downward trend in recent years.      Sarkozy has spoken out against broad amnesties declared  unilaterally by some European Union countries, arguing that the  EU's open borders mean a single state's policy affects the bloc  as a whole.      In 2006, Italy granted residency to some 500,000 illegal  immigrants, while Spain legalised almost 570,000.      Sarkozy wants to harmonise EU immigration policy, a theme on  which he is likely to focus when France takes up the 27-member  bloc's rotating presidency in July.      (Reporting by Gerard Bon and Brian Rohan, editing by Mark  Trevelyan)   ((brian.rohan@reuters.com ; +33 14949 5188; Reuters Messaging:  brian.rohan.reuters.com@reuters.net))    Keywords: FRANCE IMMIGRANTS/       ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 13.057581901550293,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to exhibit bias regarding the topic of illegal immigration in France. The reporting appears to be factual and balanced, presenting various perspectives without promoting a particular viewpoint."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Italy tells Spain to stop meddling over immigration",
        "URL": "Italy tells Spain to stop meddling over immigration.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    ROME, May 19 (Reuters) - Italy's foreign minister said the  Spanish government's criticism of its immigration policies was  unacceptable and told Madrid on Monday to stay out of Italian  affairs.      'Declarations from ministers that interfere with the  activities of a government elected by the Italian citizens are  not acceptable, especially in areas like immigration which need  close cooperation between Spain and Italy,' Franco Frattini said  in a radio interview.      'Frankly, it's time to stop these (political) pitch  invasions,' he said.      Frattini was referring to comments on Friday by Spain's  deputy prime minister, Maria Teresa Fernandez de la Vega, who  criticised the immigration stance of the new Italian government  run by conservative Prime Minister Silvio Berlusconi.      'The government rejects violence, racism and xenophobia and  therefore cannot agree with what is happening in Italy,' she  said.      Berlusconi's government is discussing legislation that could  make illegal immigration a custodial offence. According to media  reports it might also hasten deportations and turn holding  centres into detention camps.      The policies come after an election where crime committed by  foreigners, especially Roma or gypsies, became a major political  issue. Police arrested some 400 suspected illegal immigrants  associated with crime in a crackdown last week.      Some Italians have taken the law into their own hands. An  illegal Roma camp in Naples had to be evacuated after local  people set fire to shacks after news of a Roma girl apparently  trying to kidnap an Italian baby.      A European human rights watchdog has criticised events in  Italy. The Office for Democratic Institutions and Human Rights  said it was 'troubled by the recent incidents of violence  against Roma in Italy'.   (Reporting by Robin Pomeroy; Editing by Matthew Jones)   ((robin.pomeroy@reuters.com; +39 06 8522 4394; Reuters  Messaging: robin.pomeroy.reuters.com@reuters.net))    Keywords: ITALY SPAIN/IMMIGRATION       ",
        "Histogram": [
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 13.042640686035156,
        "BiasReport": {
            "sentences": [
                {
                    "text": "'Declarations from ministers that interfere with the  activities of a government elected by the Italian citizens are  not acceptable, especially in areas like immigration which need  close cooperation between Spain and Italy,' Franco Frattini said  in a radio interview.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of phrases like 'not acceptable' and 'interfere' carries a negative connotation and implies judgment, suggesting that Spain's involvement in Italy's immigration policies is inherently wrong without providing a balanced perspective."
                },
                {
                    "text": "'Frankly, it's time to stop these (political) pitch  invasions,' he said.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'political pitch invasions' is emotionally charged and provocative, designed to evoke a strong reaction against Spain's actions, without a neutral or factual presentation of the situation."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the discussion of immigration policies between Italy and Spain, particularly through the use of emotionally charged language and negative word choices that imply judgment without a balanced perspective."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.14285714285714285,
            "overall_rating": 0.37142857142857144
        },
        "combined_score": 0.0
    }
]