[
    {
        "Title": "Does Michelle Obama Dislike America_.txt",
        "URL": "Does Michelle Obama Dislike America_.txt.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Fox_News_Channel_logo.svg/240px-Fox_News_Channel_logo.svg.png",
        "Text": "Does Michelle Obama dislike America? That is the subject of this evening's \"Talking Points Memo.\"\n\nCampaigning Monday for her husband in Wisconsin, Mrs. Obama said something that has caused major controversy, and she said it twice.\n\n(BEGIN VIDEO CLIP)\n\nMICHELLE OBAMA, BARACK OBAMA'S WIFE: Let me tell you something. For the first time in my adult life, I am proud of my country, because it feels like hope is finally making a comeback.\n\n(APPLAUSE)\n\nAnd let me tell you something. I need to believe that we live in that kind of nation, where hope and possibility and unity is still what drives us.\n\n(END VIDEO CLIP)\n\nNow, the problem with that statement is the words \"for the first time in my adult life I am proud of my country.\" Perhaps Michelle Obama simply misspoke. That happens all the time when you give speeches. But Mrs. Obama said it twice in two different speeches.\n\nNow I'm willing, I'm willing to give Mrs. Obama the benefit of the doubt if she wants that benefit. The problem is she's been silent, letting others speak for her.\n\n(BEGIN VIDEO CLIP)\n\nDAVID AXELROD, BARACK OBAMA'S CHIEF STRATEGIST: She gives this talk all the time, and I don't think she formulates the words quite that way generally. But if you look at the whole quote and read beyond it, she was plainly talking about this burst of participation, this sense of hope, the sense of possibility and so on. And she was talking about the politics of our country.\n\n(END VIDEO CLIP)\n\nOK, fine. But again, Michelle Obama should be explaining herself, not paid advisers.\n\nWhy is an explanation needed, you might ask? Well, because most Americans are proud of their country and don't like it see it run down in any way. Michelle Obama is a prominent person. What she says carries weight all over the world. Also, what she says can be used against her.\n\n(BEGIN VIDEO CLIP)\n\nCINDY MCCAIN, JOHN MCCAIN'S WIFE: I'm proud of my country. I don't know about you, if you heard those words earlier. I'm very proud of my country.\n\n(END VIDEO CLIP)\n\nWell, the fact that Michelle Obama has not clarified the situation is a major mistake for the Obama campaign.\n\nAgain, I don't believe Michelle Obama dislikes her country. I sincerely hope she does not, but this is a big deal. It is not going away. And the Obama campaign should understand that.\n\nAnd that's \"The Memo.\"\n\n— You can catch Bill O'Reilly's \"Talking Points Memo\" and \"Pinheads and Patriots\" weeknights at 8 and 11 p.m. ET on the FOX News Channel and any time on foxnews.com/oreilly. Send your comments to: oreilly@foxnews.com",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 24.181217193603516,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Now, the problem with that statement is the words \"for the first time in my adult life I am proud of my country.\" Perhaps Michelle Obama simply misspoke. That happens all the time when you give speeches. But Mrs. Obama said it twice in two different speeches.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the phrase 'for the first time in my adult life I am proud of my country' is framed in a way that implies a significant negative judgment about the country prior to this moment, suggesting a lack of pride. This choice of wording can influence the reader's perception of Michelle Obama's attitude towards America."
                },
                {
                    "text": "Now I'm willing, I'm willing to give Mrs. Obama the benefit of the doubt if she wants that benefit. The problem is she's been silent, letting others speak for her.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The author's opinion that Michelle Obama should explain herself, not rely on others to speak for her, is presented as a matter of fact rather than as a subjective viewpoint. This blurs the line between objective reporting and personal perspective."
                },
                {
                    "text": "Why is an explanation needed, you might ask? Well, because most Americans are proud of their country and don't like it see it run down in any way. Michelle Obama is a prominent person. What she says carries weight all over the world. Also, what she says can be used against her.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The assertion that 'most Americans are proud of their country' and the implication that Michelle Obama's words could 'run down' the country are presented as general truths without evidence, influencing the reader's perception through the choice of words and the framing of the argument."
                },
                {
                    "text": "Well, the fact that Michelle Obama has not clarified the situation is a major mistake for the Obama campaign.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Labeling Michelle Obama's lack of clarification as a 'major mistake' for the campaign is a subjective opinion presented as an objective assessment of the situation, suggesting a clear judgment on the campaign's strategy and the importance of this issue."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias through the use of word choice and opinionated statements, particularly regarding Michelle Obama's remarks about her pride in her country. The general bias tendency leans towards questioning and critiquing Michelle Obama's statement and her campaign's handling of the situation, implying a negative judgment without providing a balanced perspective."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.2571428571428571,
            "overall_rating": 0.42857142857142855
        },
        "combined_score": 0.0
    },
    {
        "Title": "Michelle Obama Takes Heat for Saying She_s _Proud of My Country_ for the First Time.txt",
        "URL": "Michelle Obama Takes Heat for Saying She_s _Proud of My Country_ for the First Time.txt.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Fox_News_Channel_logo.svg/240px-Fox_News_Channel_logo.svg.png",
        "Text": "Barack Obama’s wife, Michelle, is under fire for leaving the impression that she hasn’t been proud of her country until now, when Democrats are beginning to rally around her husband’s campaign.\n\nSpeaking in Milwaukee, Wis., on Monday, she said, “People in this country are ready for change and hungry for a different kind of politics and … for the first time in my adult life I am proud of my country because it feels like hope is finally making a comeback.”\n\nGreeted with rousing applause after making the comment in Milwaukee, Obama delivered an amended version of the speech later that day in Madison, Wis.\n\n“For the first time in my adult lifetime, I’m really proud of my country … not just because Barack has done well, but because I think people are hungry for change,” she said. “I have been desperate to see our country moving in that direction and just not feeling so alone in my frustration and disappointment.”\n\nObama was born in 1964, meaning her adult life began in 1982. Critics quickly seized on the newfound national pride.\n\n“I am proud of my country,” John McCain’s wife, Cindy, said at a campaign stop in Brookfield, Wis., Tuesday. “I don’t know if you heard those words earlier … but I am very proud of my country.”\n\nDuring a follow up press conference, the Arizona senator was asked if they were responding to Michelle Obama and he deferred to his wife.\n\nMcCain responded: “I just wanted to make the statement that I have and always will be proud of my country.”\n\nObama campaign spokeswoman Jen Psaki said the candidate’s wife wasn’t trying to knock her country, only underscore the meaning behind her husband’s campaign.\n\n“The point is that of course Michelle is proud of her country, which is why she and Barack talk constantly about how their story wouldn’t be possible in any other nation on Earth,” she said. “What she meant is that she’s really proud at this moment because for the first time in a long time, thousands of Americans who’ve never participated in politics before are coming out in record numbers to build a grassroots movement for change.”\n\nBut conservative outlets aren’t so ready to let her off the hook.\n\n“Can it really be there has not been a moment during that time when she felt proud of her country?” reads an article in Commentary magazine. “Forget matters like the victory in the Cold War; how about only things that have made liberals proud — all the accomplishments of inclusion? How about the passage of the Civil Rights Act of 1991? Or Ruth Bader Ginsburg’s elevation to the Supreme Court?”\n\nThe article then says Michelle Obama’s comments suggest “the pseudo-messianic nature of the Obama candidacy is very much a part of the way the Obamas themselves are feeling.”\n\nWeekly Standard Editor Bill Kristol said the comment “was sort of revealing.”\n\n“She was an adult when we won the Cold War without firing a shot. She was an adult for the last 25 years of economic progress, social progress,” he told FOX News. “I think the Democrats have to be careful … they’re running against the status quo … You have to be careful not to let that slide into a kind of indictment of America. Because I don’t think the American people think on the whole that the last 25 years of American history is a narrative of despair and nothing to be proud of.”\n\nDemocratic strategist Bob Beckel said Obama “shouldn’t have said it the way she said it” but she gets the benefit of his doubt. He added that she most likely was just referring to the grassroots movement that’s swelled to support her husband, but she needs to be more careful.\n\n“The Obama’s have to recognize they are now front-runners, and everything they say, it’s now open hunting season for people,” he said.\n\nClick here to see the video of Michelle Obama talking in Madison about being proud of her country for the first time.\n\nClick here to read the posting on the Commentary Web site.\n\nFOX News’ Mosheh Oinounou and Bonney Kapp contributed to this report.",
        "Histogram": [
            0.6,
            0,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 21.727115631103516,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Barack Obama’s wife, Michelle, is under fire for leaving the impression that she hasn’t been proud of her country until now, when Democrats are beginning to rally around her husband’s campaign.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'under fire' and the implication that her statement suggests a lack of pride until now introduces a negative connotation and judgment, implying that her previous feelings were wrong or inadequate."
                },
                {
                    "text": "Obama was born in 1964, meaning her adult life began in 1982. Critics quickly seized on the newfound national pride.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'seized on' suggests a negative and opportunistic interpretation of the critics' response, implying an overreaction or unfair criticism."
                },
                {
                    "text": "But conservative outlets aren’t so ready to let her off the hook.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'let her off the hook' implies that Michelle Obama has done something wrong or is guilty of something, suggesting a judgmental and critical stance towards her."
                },
                {
                    "text": "“Can it really be there has not been a moment during that time when she felt proud of her country?” reads an article in Commentary magazine. “Forget matters like the victory in the Cold War; how about only things that have made liberals proud — all the accomplishments of inclusion? How about the passage of the Civil Rights Act of 1991? Or Ruth Bader Ginsburg’s elevation to the Supreme Court?”",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The rhetorical questions and the dismissive tone towards Michelle Obama's statement imply a judgment that her perspective is narrow or unjustified, suggesting a bias through the choice of examples and the overall dismissive approach."
                },
                {
                    "text": "The article then says Michelle Obama’s comments suggest “the pseudo-messianic nature of the Obama candidacy is very much a part of the way the Obamas themselves are feeling.”",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Describing the Obama candidacy as 'pseudo-messianic' and attributing such a characterization to Michelle Obama's comments introduces a highly charged and negative framing, suggesting an overly idealized or false sense of messianic leadership."
                },
                {
                    "text": "Weekly Standard Editor Bill Kristol said the comment “was sort of revealing.”",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'sort of revealing' implies that there is a hidden or deeper meaning behind Michelle Obama's comment, suggesting a bias towards interpreting her words as indicative of something more negative or controversial than a straightforward reading would suggest."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias through the use of word choice, particularly in the framing of Michelle Obama's statement and the responses to it. The choice of phrases and the overall tone imply judgment, criticism, and a dismissive attitude towards her perspective, suggesting a general bias against her and the Obama campaign."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.23809523809523808,
            "overall_rating": 0.419047619047619
        },
        "combined_score": 0.0
    },
    {
        "Title": "Michelle Obama writes thank-you note to Laura Bush",
        "URL": "Michelle Obama writes thank-you note to Laura Bush.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    NEW YORK, June 18 (Reuters) - Michelle Obama wrote a  thank-you note to Laura Bush after the first lady spoke up in  defense of the wife of the Democratic presidential candidate,  Obama said on Wednesday.      Obama, who is married to Illinois Sen. Barack Obama,  created a controversy on the campaign trail in February when  she said, 'For the first time in my adult lifetime I am really  proud of my country.'      After critics questioned her patriotism because of the  remark, Obama has frequently said she is proud of her country.      During an appearance on ABC Television's 'The View' on  Wednesday, she re-stated her pride in the United States and  said her controversial comment was referring to being proud of  the political process this year.      Laura Bush came to Obama's defense earlier this month,  telling ABC's 'Good Morning America': 'I think she probably  meant, 'I'm more proud.' You have to be very careful in what  you say. Everything you say is looked at and in many cases  misconstrued.'      Obama said she appreciated Bush's comments and concern.      'I was touched by it and actually I sent her a note,' Obama  said on 'The View.' 'It took me a while to write it. Like, how  do I address her? I sent it to 'Madam First Lady.' I don't want  to talk about it because she might not have it yet.      'That's what I like about Laura Bush, her whole rational  approach to these issues. I am taking some cues. There's a  reason why people like her, because she doesn't sort of fuel  the fire.'   (Reporting by Daniel Trotta; Editing by Bill Trott)   ((nyc.buro@reuters.com; +1 646 223 6280; Reuters Messaging:  daniel.trotta.reuters.com@reuters.net))  Keywords: USA POLITICS/OBAMA MICHELLE       ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 21.409202575683594,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It presents a factual account of Michelle Obama's thank-you note to Laura Bush without introducing any subjective or misleading information."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "NEWSMAKER-Michelle Obama -- new style of US first lady",
        "URL": "NEWSMAKER-Michelle Obama -- new style of US first lady.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Matthew Bigg      ATLANTA, Nov 5 (Reuters) - Michelle Obama brings the skills  of a corporate lawyer to the White House as first lady to  President-elect Barack Obama, but she says her priority will be  her role as 'mom-in-chief' to the couple's two daughters.      Democrat Obama beat Republican John McCain in Tuesday's  election. He will be the first black U.S. president and his  wife the first black first lady.      Michelle Obama, 44, was a passionate advocate for her  husband's candidacy, but she says she would not want a direct  policy role in an Obama administration.      'My first job, in all honesty, is going to continue to be  'mom-in-chief,'' she said in a recent magazine interview  referring to daughters Malia, 10, and Sasha, 7.      She also says she hopes to focus ways women maintain a  work-family balance and the needs of military families, and she  could act as an informal adviser to her husband as she has been  during the campaign.      Obama, who grew up in a blue-collar neighborhood on the  south side of Chicago and went to public school, often talks  about her father -- who worked for the city's public water  system -- and the values instilled by her parents.      After winning scholarships to the elite universities of  Princeton and Harvard law school, Obama worked for a law firm  and in the Chicago mayor's office.      Her most recent job was vice president of the University of  Chicago hospitals, where she earned more than her husband. Even  though the Obamas are now well off, partly due to royalties  from Barack Obama's two books, Michelle Obama stresses the  values she learned growing up.      'When you are raised in a home ... (in which) you have love  and security and you have people who are sacrificing for you  ... you have an obligation to give back,' she said. 'That's why  community service has been such a big part of my life.'           'PROUD OF MY COUNTRY'      In his victory speech Tuesday night, Barack Obama described  his wife as 'my best friend for the last 16 years, the rock of  our family, the love of my life.' He says she has been a source  of strength and a gentle critic who keeps him grounded.      Their public displays of affection and her fashion sense --  she has been featured in magazines such as Vogue  and Essence  -- contribute to the candidate's youthful image.      In a widely praised speech at the Democratic National  Convention, Michelle Obama shared details of the couple's life  together and said her husband represented typical American  values.      'What struck me when I first met Barack was that even  though he had this funny name, and even though he'd grown up  all the way across the continent in Hawaii, his family was so  much like mine,' she said.      'He was raised by grandparents who were working-class folks  like my parents, and by a single mother who struggled to pay  the bills just like we did.'      Michelle Obama has receded from the limelight since the  convention, even though she draws large crowds while  campaigning solo for her husband.      She is immensely popular with Democrats who warm to the  strength and smartness she projects, but in February she  stirred controversy with comments she made on the campaign  trail.      'For the first time in my adult lifetime, I am really proud  of my country,' she told an audience in Wisconsin. 'And not  just because Barack has done well, but because I think people  are hungry for change.'      Conservatives criticized h",
        "Histogram": [
            0.6,
            0,
            0,
            0,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.5,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0
        ],
        "Relevance": 20.904142379760742,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Michelle Obama brings the skills of a corporate lawyer to the White House as first lady to President-elect Barack Obama, but she says her priority will be her role as 'mom-in-chief' to the couple's two daughters.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'mom-in-chief' alongside 'skills of a corporate lawyer' implies a judgment about the traditional role of a mother versus a corporate professional, suggesting a dichotomy that may undermine the complexity of her role."
                },
                {
                    "text": "She also says she hopes to focus ways women maintain a work-family balance and the needs of military families, and she could act as an informal adviser to her husband as she has been during the campaign.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The sentence implies a judgment on the importance of her potential role as an informal adviser, suggesting it as a secondary or less significant aspect of her responsibilities, which could undermine the value of her contributions."
                },
                {
                    "text": "Their public displays of affection and her fashion sense -- she has been featured in magazines such as Vogue and Essence -- contribute to the candidate's youthful image.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The emphasis on 'public displays of affection' and 'fashion sense' in relation to her appearance in magazines may suggest a trivialization of her role as a political figure, focusing on superficial aspects rather than her substantive contributions."
                },
                {
                    "text": "In a widely praised speech at the Democratic National Convention, Michelle Obama shared details of the couple's life together and said her husband represented typical American values.",
                    "bias_type": "Generalization Bias",
                    "bias_strength": 0.5,
                    "bias_description": "The assertion that her husband represents 'typical American values' without specifying or critically examining what these values entail could oversimplify and generalize the diversity of American perspectives and experiences."
                },
                {
                    "text": "Michelle Obama has receded from the limelight since the convention, even though she draws large crowds while campaigning solo for her husband.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'receded from the limelight' implies a judgment about her level of public visibility, suggesting a passive or diminished role, which may undermine the significance of her campaign efforts."
                },
                {
                    "text": "She is immensely popular with Democrats who warm to the strength and smartness she projects, but in February she stirred controversy with comments she made on the campaign trail.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The description of Democrats 'warming to the strength and smartness she projects' may imply a superficial or uncritical appreciation of her, suggesting that her popularity is based on image rather than substance."
                },
                {
                    "text": "'For the first time in my adult lifetime, I am really proud of my country,' she told an audience in Wisconsin. 'And not just because Barack has done well, but because I think people are hungry for change.'",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The framing of being 'really proud of my country' for the first time in her adult lifetime, alongside the assertion that 'people are hungry for change,' uses emotionally charged language to emphasize a dramatic shift, potentially oversimplifying complex national sentiments."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding Michelle Obama's portrayal, particularly in the way her roles as a mother, campaigner, and public figure are discussed. The biases identified include Word Choice Bias, Opinionated Bias, Generalization Bias, and Emotional Sensationalism Bias, suggesting a tendency to oversimplify, judge, or sensationalize her actions and statements."
            }
        },
        "Scores": {
            "average_bias_strength": 0.5857142857142856,
            "percentage_of_biased_sentences": 0.17391304347826086,
            "overall_rating": 0.37981366459627325
        },
        "combined_score": 0.0
    },
    {
        "Title": "NEWSMAKER-Michelle Obama softens image for US first lady role",
        "URL": "NEWSMAKER-Michelle Obama softens image for US first lady role.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Matthew Bigg      ATLANTA, Nov 1 (Reuters) - Michelle Obama will bring the  skills of a corporate lawyer to the White House if her husband  wins the U.S. presidency, but she says her priority will be her  role as 'mom-in-chief' to the couple's daughters.      Democrat Barack Obama faces Republican John McCain in  Tuesday's election. If the first-term Illinois senator wins, he  will become the first black U.S. president and his wife the  first black first lady.      Michelle Obama, 44, is a passionate advocate for her  husband's candidacy, but she says she would not want a direct  policy role in an Obama administration.      'My first job, in all honesty, is going to continue to be  'mom-in-chief,'' she said in a recent magazine interview  refering to daughters Malia, 10, and Sasha, 7.      She also says she hopes to focus ways women maintain a  work-family balance and the needs of military families and she  could act as an informal adviser to her husband as she has been  during the campaign.      Obama, who grew up in a blue-collar neighborhood on the  south side of Chicago and went to public school, often talks  about her father -- who worked for the city's public water  system -- and the values instilled by her parents.      After winning scholarships to the elite universities of  Princeton and Harvard law school, Obama worked for a law firm  and in the Chicago mayor's office.      Her most recent job was vice president of the University of  Chicago hospitals, where she earned more than her husband. Even  though the Obamas are now well off, partly due to royalties  from Barack Obama's two books, Michelle Obama stresses the  values she learned growing up.      'When you are raised in a home ... (in which) you have love  and security and you have people who are sacrificing for you  ... you have an obligation to give back,' she said. 'That's why  community service has been such a big part of my life.'           'PROUD OF MY COUNTRY'      Barack Obama describes his wife as his 'rock,' a source of  strength and a gentle critic who keeps him grounded. Their  public displays of affection and her fashion sense -- she has  been featured in magazines such as Vogue  and Essence --  contribute to the candidate's youthful image.      In a widely praised speech at the Democratic National  Convention, Michelle Obama shared details of the couple's life  together and said her husband represented typical American  values.      'What struck me when I first met Barack was that even  though he had this funny name, and even though he'd grown up  all the way across the continent in Hawaii, his family was so  much like mine,' she said.      'He was raised by grandparents who were working-class folks  like my parents, and by a single mother who struggled to pay  the bills just like we did.'      Michelle Obama has receded from the limelight since her  convention speech, even though she draws large crowds while  campaigning solo for her husband.      In February, she stirred controversy with comments she made  on the campaign trail.      'For the first time in my adult lifetime, I am really proud  of my country,' she told an audience in Wisconsin. 'And not  just because Barack has done well, but because I think people  are hungry for change.'      Conservatives criticized her as insufficiently patriotic  and the dispute angered some black Americans who said they are  held to a higher standard of patriotism. Resistance to racial  injustice, they said, ha",
        "Histogram": [
            0,
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0
        ],
        "Relevance": 19.16264533996582,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Michelle Obama, 44, is a passionate advocate for her husband's candidacy, but she says she would not want a direct policy role in an Obama administration.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence implies a judgment about Michelle Obama's stance on not wanting a direct policy role, suggesting it as a personal choice rather than a neutral fact."
                },
                {
                    "text": "'My first job, in all honesty, is going to continue to be 'mom-in-chief,'' she said in a recent magazine interview referring to daughters Malia, 10, and Sasha, 7.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the phrase 'in all honesty' and the term 'mom-in-chief' carry connotations that could influence the reader's perception of the importance and sincerity of Michelle Obama's role."
                },
                {
                    "text": "Barack Obama describes his wife as his 'rock,' a source of strength and a gentle critic who keeps him grounded. Their public displays of affection and her fashion sense -- she has been featured in magazines such as Vogue and Essence -- contribute to the candidate's youthful image.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The description of Michelle Obama as a 'rock' and the emphasis on her fashion sense and magazine features are word choices that could bias the reader by portraying her in a certain light."
                },
                {
                    "text": "In a widely praised speech at the Democratic National Convention, Michelle Obama shared details of the couple's life together and said her husband represented typical American values.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The assertion that her husband represents 'typical American values' is an opinion presented as a fact, blurring the line between objective reporting and personal perspective."
                },
                {
                    "text": "'What struck me when I first met Barack was that even though he had this funny name, and even though he'd grown up all the way across the continent in Hawaii, his family was so much like mine,' she said.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'funny name' and the emphasis on the geographical distance in this context could subtly influence the reader's perception of the Obamas' relatability."
                },
                {
                    "text": "Michelle Obama has receded from the limelight since her convention speech, even though she draws large crowds while campaigning solo for her husband.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'receded from the limelight' implies a deliberate action or a loss of popularity, which could bias the reader's perception of Michelle Obama's role in the campaign."
                },
                {
                    "text": "In February, she stirred controversy with comments she made on the campaign trail.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'stirred controversy' suggests a negative impact of Michelle Obama's comments, framing them in a way that could bias the reader against her."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias through the use of word choice and opinionated statements, particularly in its portrayal of Michelle Obama's personal and public roles. The biases are subtle but could influence the reader's perception of her character and actions."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.17391304347826086,
            "overall_rating": 0.3869565217391304
        },
        "combined_score": 0.0
    },
    {
        "Title": "Obama tells critics to leave his wife alone",
        "URL": "Obama tells critics to leave his wife alone.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    WASHINGTON, May 19 (Reuters) - Democratic presidential  hopeful Barack Obama said on Monday that Republican critics  should stop picking on his wife Michelle.      'These folks should lay off my wife,' Obama said in an  interview with ABC's 'Good Morning America.'      Obama was referring to a four-minute video posted on  YouTube by the Tennessee Republican Party last week during a  visit by Michelle Obama that portrayed a remark she made in  February in an unflattering manner.      Michelle Obama's remark that 'for first time in my adult  lifetime I'm proud of my country' stirred a controversy at the  time. Critics said it sounded unpatriotic and suggested she had  not been proud of her country before her husband's candidacy.      In the ABC interview, Obama, an Illinois senator and  Democratic front-runner to contest the November election  against Republican John McCain, called the video 'low class'  and said 'most of the American people would think that as  well.'      The Republican video repeatedly showed Michelle Obama  making the proud remark interspersed with comments by  Tennesseans about their own patriotism.      'Whoever is in charge of the Tennessee GOP needs to think  long and hard about the kind of campaign that they want to  run,' Obama said.      Michelle Obama joined her husband in the ABC interview and  said she believed voters were more focused on the issues.      'We are trusting that the American voters are ready to talk  about the issues and not talking about things that have nothing  to do with making people's lives better,' she said.      Obama has not formally won the Democratic presidential  nomination, but he leads against New York Sen. Hillary Clinton  in the pledged delegates to the August party convention that  will pick a candidate to run against McCain, an Arizona  senator. The Democratic candidates face off in primaries in  Oregon and Kentucky on Tuesday, and three more before the party  voting ends on June 3.   (Reporting by Donna Smith; editing by Mohammad Zargham)   (To read more about the U.S. political campaign, visit Reuters  'Tales from the Trail: 2008' online at  http:/blogs.reuters.com/trail08/)   ((For a TAKE A LOOK on the campaign, double-click on  [US/VOTE]))   ((donna.smith@reuters.com; +1 202-898-8391;Reuters Messaging:  donna.smith.reuters.com@reuters.net))  Keywords: USA POLITICS/OBAMA        ",
        "Histogram": [
            0,
            0.6,
            0.6,
            0,
            0,
            0.9,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 17.282838821411133,
        "BiasReport": {
            "sentences": [
                {
                    "text": "'These folks should lay off my wife,' Obama said in an interview with ABC's 'Good Morning America.'",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the phrase 'lay off' carries a negative connotation and implies a judgment about the actions of the critics, suggesting they are unjustly targeting Michelle Obama."
                },
                {
                    "text": "Obama was referring to a four-minute video posted on YouTube by the Tennessee Republican Party last week during a visit by Michelle Obama that portrayed a remark she made in February in an unflattering manner.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'unflattering manner' implies a subjective judgment about how the video presented Michelle Obama's remark, suggesting a negative portrayal without objective analysis."
                },
                {
                    "text": "In the ABC interview, Obama, an Illinois senator and Democratic front-runner to contest the November election against Republican John McCain, called the video 'low class' and said 'most of the American people would think that as well.'",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "Describing the video as 'low class' is a subjective opinion presented as a fact, and the assertion that 'most of the American people would think that as well' lacks evidence and implies a broad consensus that may not exist."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias through the use of word choice and opinionated statements, particularly in the context of defending Michelle Obama against criticism. The biases are directed towards portraying the critics in a negative light and asserting the righteousness of Obama's and his wife's positions."
            }
        },
        "Scores": {
            "average_bias_strength": 0.7000000000000001,
            "percentage_of_biased_sentences": 0.23076923076923078,
            "overall_rating": 0.4653846153846154
        },
        "combined_score": 0.0
    },
    {
        "Title": "FACTBOX-Michelle Obama's turn in the spotlight",
        "URL": "FACTBOX-Michelle Obama's turn in the spotlight.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    Aug 25 Reuters) - Michelle Obama, wife of Democratic  presidential candidate Barack Obama, will be the featured  speaker at the opening night of the party's nominating  convention on Monday.      Here are some facts about the woman who would be the first  African-American first lady if her husband is elected on Nov.  4:           * Obama, 44, met her husband through her work as a  corporate lawyer and is his closest adviser, although  associates have described her role as less of a policy-oriented  one than that of a confidante who provides a reality check.      * Educated at Princeton and Harvard, Obama was initially  reticent about getting involved in the election campaign, but  now draws large crowds of her own.      * Obama has taken time off from her job as a vice president  of community relations at the University of Chicago Hospitals  to campaign for her husband.      * Her first priority if she becomes first lady would be her  two young daughters, but she would also hope to focus on how  women can maintain a work-family balance.      * Critics seized on her comment that 'For the first time in  my adult life, I am proud of my country' as evidence of a lack  of patriotism, a charge her husband also has faced.      * Known for a sense of style, Obama has appeared in Vogue  and been compared to former first lady Jacqueline Kennedy. She  was widely praised by fashion writers for the violet sheath  dress she wore to her husband's Democratic nomination victory  rally.      * Asked in a CBS interview last week what his wife would  wear for her prime-time television appearance on Monday, Obama  replied: 'You know, there -- there are some things that even I  don't know. And what Michelle is going to wear is a tightly  held secret.'   (Editing by Howard Goller)      ((To read more about the U.S. political campaign, visit  Reuters 'Tales from the Trail: 2008' online at  http://blogs.reuters.com/trail08/))  Keywords: USA POLITICS/OBAMA MICHELLE        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 16.953887939453125,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Critics seized on her comment that 'For the first time in my adult life, I am proud of my country' as evidence of a lack of patriotism, a charge her husband also has faced.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the word 'seized' implies a negative and aggressive action towards her comment, suggesting an unfair or exaggerated reaction. This choice of word conveys a judgment about the critics' response, implying it is unwarranted or overblown."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits a Word Choice Bias in the sentence discussing critics' reaction to Michelle Obama's comment about her pride in her country. The use of the word 'seized' suggests an unfair or exaggerated response, implying a judgment about the critics' actions."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.09090909090909091,
            "overall_rating": 0.34545454545454546
        },
        "combined_score": 0.0
    },
    {
        "Title": "Once reticent Michelle Obama is big campaign asset",
        "URL": "Once reticent Michelle Obama is big campaign asset.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Deborah Charles      WASHINGTON, Feb 4 (Reuters) - Michelle Obama's fiery   campaign style belies the fact that she was hesitant at first  about getting involved in her husband Barack's bid to become  U.S. president.      Obama says she never expected to be on stage extolling her  husband's virtues, but she is revving up crowds as she tells  them he is the Democratic candidate who offers the best option  for change in the United States.      'I am very passionate about change in the country and  that's what you see,' the 44-year-old Princeton- and  Harvard-educated lawyer from Chicago told Reuters in an  interview last year.      The woman who would become America's first black first lady  if her husband wins the White House, has taken time off from  her job as a vice president of community relations at the  University of Chicago Hospitals to campaign.      She spends as much time as she can at home with daughters  Malia, 9, and Sasha, 6. She wants their lives to remain as  'normal' as possible, even though she has been hitting the  campaign trail for longer periods of time.      Though she joins her husband, 46, for major rallies, where  she is a popular warm-up act, Michelle Obama has her own  schedule of events -- usually in more intimate settings where  she can meet people and answer questions one-on-one.      'I am really worried that we won't make the right decision  this time around,' she said. 'And I'm really going to put  everything that I have into making sure that people understand  what's at stake and that we are thinking with our heads and not  with fear.'           'LOVE OF MY LIFE'      Barack Obama often speaks about her. In his victory  speeches in recent primaries he has given special thanks to  'the love of my life, the rock of the Obama family, the closer  on the campaign trail.'      In turn, Michelle Obama gets loud cheers when she appears  on stage with her husband, often predicting as she introduces  him: 'He's going to be the best president that we have seen in  a long time.'      Michelle Obama did her undergraduate studies at Princeton  University, where she earned a degree in sociology with a minor  in African-American studies.      She went on to Harvard Law School, then worked in a  corporate law firm in Chicago.      It was there she met Barack in 1988. Although he is three  years older, her husband spent several years working as a  community organizer before going to law school. As a new  lawyer, Michelle was assigned as his adviser.      They began dating soon after and were married in 1992.      Obama regularly says he is lucky his wife never decided to  run for office. In his book 'The Audacity of Hope,' he wrote,  'If I ever had to run against her for public office, she would  beat me without much difficulty.'   ((Editing by Stacey Joyce; deborah.charles@reuters.com;+1 202  789 8579; Reuters Messaging:  deborah.charles.reuters.com@reuters.net))  Keywords: USA POLITICS/OBAMA MICHELLE        ",
        "Histogram": [
            0.6,
            0,
            0.6,
            0.6,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0.9,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 16.79669761657715,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Michelle Obama's fiery campaign style belies the fact that she was hesitant at first about getting involved in her husband Barack's bid to become U.S. president.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the word 'fiery' to describe Michelle Obama's campaign style implies a positive and strong connotation, suggesting an endorsement of her approach. This choice of word could influence the reader's perception of her campaign without providing a neutral description."
                },
                {
                    "text": "'I am very passionate about change in the country and that's what you see,' the 44-year-old Princeton- and Harvard-educated lawyer from Chicago told Reuters in an interview last year.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Describing Michelle Obama as 'very passionate' about change in the country uses language that implies a positive judgment about her commitment, which could influence the reader's perception without offering a balanced view."
                },
                {
                    "text": "The woman who would become America's first black first lady if her husband wins the White House, has taken time off from her job as a vice president of community relations at the University of Chicago Hospitals to campaign.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The emphasis on Michelle Obama's potential historic role as the 'first black first lady' and her sacrifice of time off from her job uses language that could evoke a sense of admiration and support for her, potentially biasing the reader's perception."
                },
                {
                    "text": "She wants their lives to remain as 'normal' as possible, even though she has been hitting the campaign trail for longer periods of time.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of quotes around 'normal' suggests a judgment about what constitutes a normal life for her daughters, implying that her campaign activities may disrupt this normalcy. This choice of wording could lead the reader to sympathize with her personal struggle, introducing bias."
                },
                {
                    "text": "In turn, Michelle Obama gets loud cheers when she appears on stage with her husband, often predicting as she introduces him: 'He's going to be the best president that we have seen in a long time.'",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This sentence presents Michelle Obama's predictions about her husband's presidency as a matter of fact, without offering any counterbalancing viewpoints or evidence. It portrays her in a highly favorable light, suggesting an objective truth to her opinion."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias through the use of word choice and opinionated statements, particularly in its portrayal of Michelle Obama's campaign involvement and her husband's presidential prospects. The biases are subtle but present, tending towards favoring the Obamas without providing a fully balanced or neutral perspective."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6599999999999999,
            "percentage_of_biased_sentences": 0.19047619047619047,
            "overall_rating": 0.4252380952380952
        },
        "combined_score": 0.0
    },
    {
        "Title": "Obama win makes Oprah weep, DiCaprio proud",
        "URL": "Obama win makes Oprah weep, DiCaprio proud.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Jill Serjeant      LOS ANGELES, Nov 5 (Reuters) - Oprah Winfrey wept tears of  joy, Leonardo DiCaprio said he was proud to be an American and  several hip-hop music stars said Sen. Barack Obama's election  as the first black U.S. president fulfilled the dreams of  America's youth.      Celebrities played a large, and sometimes controversial,  role in Obama's election campaign, organizing fund-raisers,  performing at rallies and campaigning on his behalf.      Republican candidate John McCain used Obama's popularity  with actors and musicians during the campaign to mock the  Illinois senator as little more than a celebrity himself.      But when Obama was declared president-elect on Tuesday, his  A-list supporters spoke out again.      DiCaprio, in Rome for the Italian premiere of his movie  'Body of Lies', told reporters on Wednesday he had stayed up  all night watching the election.      'I couldn't be more proud of my country right now and proud  of being an American ... I feel overwhelmed and I feel a  tremendous weight has been lifted from my shoulders,' the  'Titanic' star said.      Talk-show host Winfrey, one of America's most influential   women, campaigned with Obama last year. On Tuesday night,  millions of TV viewers saw her in tears among the tens of  thousands gathered in Chicago for Obama's victory speech.      'It feels like America did the right thing,' Winfrey told  CNN. 'It feels like there's a shift in consciousness. It feels  like something really big and bold has happened here, like  nothing ever in our lifetimes did we expect this to happen.'      Hip-hop music and fashion mogul Russell Simmons said  Obama's election was 'a clear reflection of hip-hop politics.'      'While many older Americans, who marched and struggled so  hard so Senator Obama could run for president of the United  States never dared to believe in his candidacy's real  potential, young people, particularly the hip-hop community,  had faith and their imagination became our reality,' Simmons  said in a statement.           PEOPLE MAGAZINE      R&B singer Usher told Access Hollywood, 'Barack Obama  doesn't represent a color. He represents change.' Black music  producer and singer Sean Diddy Combs said, 'I felt like my vote  was the vote that put him into office ... And that may not be  true but that's how much power it felt like I had.'      People magazine, typically a place to read about Hollywood  stars such as Katie Holmes and Britney Spears, put Obama on its  front cover in a special edition marking his election.      Actor George Clooney said in a statement it was 'time to  begin unifying the country so we can take on the extraordinary  challenges that this generation faces.'      And poet Maya Angelou, 80, author of the influential book  'I Know Why the Caged Bird Sings', said she could barely talk  without weeping as she remembered all the African-Americans who  had struggled for civil rights in the past.      'We are growing up. My God, I'm so grateful,' Angelou told  'The Early Show' on CBS.      'We have elected a black man to talk for us, to speak for  us. We, blacks, whites, Asians, Spanish-speaking, Native  Americans, we have done it.'   (Additional reporting by Mark Egan, Claudia Parsons, Steve  Gorman, Phil Stewart; Editing by Bob Tourtellotte and Frances  Kerry)   ((jill.serjeant1@thomsonreuters.com; +1 213 955 6749))   (To read more about our entertainment news, visit our blog  'Fan Fare' online at http://blogs.reuters.com/",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 15.923686027526855,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides a factual account of the reactions of celebrities to Barack Obama's election as the first black U.S. president without introducing any form of bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "UPDATE 1-Once reticent Michelle Obama is big campaign asset",
        "URL": "UPDATE 1-Once reticent Michelle Obama is big campaign asset.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": " (adds quotes, paragraph 10-11)      By Deborah Charles      WASHINGTON, Feb 4 (Reuters) - Michelle Obama's fiery   campaign style belies the fact that she was hesitant at first  about getting involved in her husband Barack's bid to become  U.S. president.      Obama says she never expected to be on stage extolling her  husband's virtues, but she is revving up crowds as she tells  them he is the Democratic candidate who offers the best option  for change in the United States.      'I am very passionate about change in the country and  that's what you see,' the 44-year-old Princeton- and  Harvard-educated lawyer from Chicago told Reuters in an  interview last year.      The woman who would become America's first black first lady  if her husband wins the White House, has taken time off from  her job as a vice president of community relations at the  University of Chicago Hospitals to campaign.      She spends as much time as she can at home with daughters  Malia, 9, and Sasha, 6. She wants their lives to remain as normal  as possible, even though she has been hitting the campaign trail  for longer periods of time.      Though she joins her husband, 46, for major rallies, where  she is a popular warm-up act, Michelle Obama has her own  schedule of events -- usually in more intimate settings where  she can meet people and answer questions one-on-one.      'I am really worried that we won't make the right decision  this time around,' she said. 'And I'm really going to put  everything that I have into making sure that people understand  what's at stake and that we are thinking with our heads and not  with fear.'           'LOVE OF MY LIFE'      Barack Obama often speaks about her. In his victory  speeches in recent primaries he has given special thanks to  'the love of my life, the rock of the Obama family, the closer  on the campaign trail.'      In turn, Michelle Obama gets loud cheers when she appears  on stage with her husband, often predicting as she introduces  him: 'He's going to be the best president that we have seen in  a long time.'      In an interview on Monday, Michelle Obama was asked if she  would support Sen. Hillary Clinton if she won the Democratic  nomination.      'I have to think about that,' she said on ABC's Good  Morning America. 'I'd have to think about her policies, her  approach, her tone.'      Michelle Obama did her undergraduate studies at Princeton  University, where she earned a degree in sociology with a minor  in African-American studies.      She went on to Harvard Law School, then worked in a  corporate law firm in Chicago.      It was there she met Barack in 1988. Although he is three  years older, her husband spent several years working as a  community organizer before going to law school. As a new  lawyer, Michelle was assigned as his adviser.      They began dating soon after and were married in 1992.      Obama regularly says he is lucky his wife never decided to  run for office. In his book 'The Audacity of Hope,' he wrote,  'If I ever had to run against her for public office, she would  beat me without much difficulty.'       (To read more about the U.S. political campaign, visit  Reuters 'Tales from the Trail: 2008' online at  http://blogs.reuters.com/category/events/trail08/)      (Editing by Vicki Allen)       ((To read a factbox about the spouses of presidential  candidates, click on [ID:nN04459264]))      ((deborah.charles@reuters.com;+1 202 789 8579; Reuters  Messaging: deborah.charles.reuters",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 15.850028991699219,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides a factual account of Michelle Obama's involvement in her husband's presidential campaign without displaying any evident bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Michelle Obama graces cover of Vogue magazine",
        "URL": "Michelle Obama graces cover of Vogue magazine.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    LOS ANGELES, Feb 11 (Reuters) - Michelle Obama graces the  cover of next month's Vogue magazine, marking the second time a  U.S. first lady has appeared on the front of one of the world's  leading fashion magazines.      Obama, 45, who has been hailed by both U.S. retailers and  the media as a new fashion icon, donned a magenta sheath dress  for the cover photo. The dress was designed by Jason Wu, who  also created her white inaugural ball gown.      Famed photographer Annie Leibovitz took the cover photo and  several fashion shots featured inside the March edition of  Vogue.      With the exception of Bess Truman, every U.S. first lady  since Lou Hoover in the 1930s has been featured in Vogue, but  Obama is only the second presidential wife to appear on the  cover, Vogue said. Hillary Clinton did so in 1998.      Obama has won praise from fashionistas for mixing designer  pieces with off-the-rack American brands like J. Crew and Gap.       Vogue's editor-at-large, Andre Leon Talley said Obama  selected the outfits worn for the photo shoot herself, from her  own wardrobe, pairing designer wear with affordable clothes.      'She doesn't need any help. She loves fashion and knows  what works for her. She's never had a conversation with me  about, 'What do you think?' or 'How did this look?' And I'm  glad for that.'       Obama told Vogue she loved clothes, but said comfort and  fun was more important than following fashion.      'First and foremost, I wear what I love. That's what women  have to focus on: what makes them happy and what makes them  feel comfortable and beautiful. If I can have any impact, I  want women to feel good about themselves and have fun with  fashion,' she said.      While Obama discussed her views on fashion, she made clear  family was her first priority, particularly caring for  daughters Malia, 10, and Sasha, 7.      'I'm going to try to take them to school every morning, as  much as I can,' Obama told the magazine. 'But there's also a  measure of independence. And obviously there will be times I  won't be able to drop them off at all. I like to be a presence  in my kids' school. I want to know the teachers; I want to know  the other parents,' she said.   (Reporting by Jill Serjeant)   ((Editing by Stacey Joyce; jill.serjeant1@thomsonreuters.com;  +1 213 955 6749))    (To read more about our entertainment news, visit our blog  'Fan Fare' online at http://blogs.reuters.com/fanfare/)  Keywords: OBAMA VOGUE        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 15.261341094970703,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides a factual report on Michelle Obama's appearance on the cover of Vogue magazine and her views on fashion, without displaying any evident bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "WRAPUP 9-Backers of Hillary Clinton cloud Obama show",
        "URL": "WRAPUP 9-Backers of Hillary Clinton cloud Obama show.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    * Obama appears to convention on video screen      * Michelle Obama disputes elitist charge      * Edward Kennedy speech sets off celebration           By Steve Holland,      DENVER, Aug 25 (Reuters) - Democrats opening their national  convention tried to smooth over a rift with Hillary Clinton's  resentful supporters on Monday and portrayed Barack Obama as a  down-to-earth American patriot bidding to make history.      Chairman Howard Dean pounded a gavel to start the four-day  convention where Democrats say their presidential candidate  must unite the party, get tough on Republican rival John McCain  and back up soaring oratory with specific policies.       The aim of the first day was to frame Obama's personal  story, the son of a black man from Kenya and white woman from  Kansas who spent his early years in Hawaii and Indonesia,  worked his way through college and began his political career  as a community organizer in Chicago.       His wife, Michelle Obama, headlined the opening night. In  front of a huge crowd waving 'Michelle' signs, she said her  husband represented typical American values, rejecting  Republican charges that Obama is an aloof celebrity.      'What struck me when I first met Barack was that even  though he had this funny name, and even though he'd grown up  all the way across the continent in Hawaii, his family was so  much like mine,' she said.      'He was raised by grandparents who were working class folks  just like my parents, and by a single mother who struggled to  pay the bills just like we did,' she said.       Michelle Obama also put a gloss on her own assertive  personality. She has drawn fire from Republicans for saying she  only recently became proud of her country.      'I come here as a wife who loves my husband and believes he  will be an extraordinary president. I come here as a mom whose  girls are the heart of my heart and the center of my world,'  she said.      After she spoke, Obama himself appeared for the first time  to the convention, showing up on a large video screen to praise  his wife as she stood on stage with their two young daughters,  Malia and Sasha.      'Malia, Sasha, how did you think Mom did?' said Obama, who  spoke from Kansas City.      'I think she did good,' was the reply.      Speaking to reporters in Illinois, the first-term senator  tried to calm anxiety among some Democrats about a mild slide  in opinion polls that has left him in a dead heat with McCain  heading toward the Nov. 4 election.      He said his nomination acceptance speech on Thursday would  be 'workmanlike,' short on lofty words and long on policy  details.      He also played down divisions with the Clintons, Hillary  and Bill, the former president still stewing over having been  accused by Obama of trying to inject racial politics into the  Democrats' primary battle earlier this year.      'I am absolutely convinced that both Hillary Clinton and  Bill Clinton understand the stakes,' Obama told reporters in  Moline, Illinois.      In her speech, Michelle Obama praised Clinton for seeking  to advance the cause of American women 'so that our daughters  and sons can dream a little bigger and aim a little higher.'      In an emotional high point, Massachusetts Sen. Edward  Kennedy, 76, a symbol of Democratic liberalism who is battling  brain cancer, appeared before the cheering crowd after a  videotaped tribute to his long political life.      'My fellow Americans, it is so wonderful to be here,' said ",
        "Histogram": [
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 14.763751029968262,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Democrats opening their national convention tried to smooth over a rift with Hillary Clinton's resentful supporters on Monday and portrayed Barack Obama as a down-to-earth American patriot bidding to make history.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the word 'resentful' to describe Hillary Clinton's supporters implies a negative judgment and suggests an unjustified or irrational emotion, which could influence the reader's perception negatively towards these supporters."
                },
                {
                    "text": "Chairman Howard Dean pounded a gavel to start the four-day convention where Democrats say their presidential candidate must unite the party, get tough on Republican rival John McCain and back up soaring oratory with specific policies.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'soaring oratory' implies a positive, perhaps exaggerated, view of Obama's speaking abilities, which could bias the reader by suggesting that his speeches are more powerful or effective than they might objectively be."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias through the use of word choice, particularly in describing the emotions of Hillary Clinton's supporters and the characterization of Barack Obama's oratory skills. The general bias tendency leans towards portraying Obama and his campaign in a more positive light compared to his opposition, particularly through the use of positive language and subtle negative implications towards his critics."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.045454545454545456,
            "overall_rating": 0.3227272727272727
        },
        "combined_score": 0.0
    },
    {
        "Title": "Michelle Obama -- fashion's non-icon",
        "URL": "Michelle Obama -- fashion's non-icon.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Martinne Geller      NEW YORK, Feb 16 (Reuters) - First lady Michelle Obama is  widely hailed as a fashion icon, but industry insiders say  she's quite the opposite, and that's a good thing.      A fashion icon would have an eye-catching signature look  and, while the president's wife has the power to set trends,  her appeal is refreshingly not so defined and deliberate, said  fashion observers at the semi-annual Fashion Week in New York,  where designers are showing their Fall 2009 collections.      Michelle Obama 'is more real than iconic,' said David  Wolfe, creative director of the Doneger Group, which forecasts  trends. 'She doesn't have a locked-in fashion look. She  experiments, which is what fashion is about these days.'      References to Obama, 45, as an icon of fashion are  everywhere. Thin and statuesque, the attorney and mother of two  graces the cover of Vogue magazine's March issue.      She wins lavish attention from designers, editors and  stylists. Stores quickly sell out of the clothes she wears.      While Obama's style merits praise, she is not in the ranks  of such icons as actress Katharine Hepburn, with her tailored  menswear, or Jacqueline Kennedy with her pillbox hats and  wide-frame sunglasses, said Helen Job, a trend forecaster with  WGSN, a fashion research and analysis firm.      'When you think about a fashion icon, it's somebody who has  this ability to influence the public to such a degree ... to  change the direction (a style) is going in,' she said.      Kennedy's sense of style would be out of place among women  today, said Wolfe.      'Jackie Kennedy was locked into the Jackie Kennedy look and  never stepped out of it. That was great, but it certainly isn't  the way modern women dress,' he said.      Obama wears clothes by little-known designers and  mid-priced chains such as J Crew Group Inc <JCG.N>, helping  dispose of the idea that first ladies always must look formal.      'She's really set this new guideline, and I feel like the  White House will never be the same after this somehow,' said  Gloria Baume, fashion director for Teen Vogue.         DEMOCRATIC FASHION     Jason Wu, the young designer of Obama's white inaugural gown  and the magenta dress she wears in Vogue, credits the first  lady with reinvigorating the industry.     'In her own way, she is like a stimulus package for the  fashion industry,' Wu said.      Few first ladies deserved the title as fashion icons, said  Mandi Norwood, a former magazine editor writing a book on  Obama's style.      'We've been trying desperately to promote the first lady  into fashion icon status, but I'm not sure any of them have  truly deserved that title,' she said.      Obama does have some company in U.S. history, said Lisa  Kathleen Graddy, curator of 'The First Ladies at the  Smithsonian' exhibit.      Frances Cleveland's clothes and hairstyle were copied and  commented upon, and advertisers used her to sell products she  had never seen or used. The Victorian-era bustle even fell out  of U.S. fashion when it was reported she would no longer wear  the rear-enhancing gowns.      Another fashionable first lady was Grace Coolidge, who is  considered to have popularized fashion, said Graddy.      Grover Cleveland was president in the late 1800s. Calvin  Coolidge served in the 1920s.   (Additional reporting by Christine Kearney in New York and  Alexandria Sage in San Francisco; editing by Ellen Wulfhorst  and Philip Barbara)     ((Reuters Messaging",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 14.70997142791748,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to exhibit bias regarding any of the topics discussed. The focus is on discussing Michelle Obama's influence on fashion, comparing her to historical figures, and the industry's perspective on her impact, without showing a tendency towards any particular bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "WRAPUP 8-Backers of Hillary Clinton cloud Obama show",
        "URL": "WRAPUP 8-Backers of Hillary Clinton cloud Obama show.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    * Obama promises 'workman-like' acceptance speech      * Michelle Obama disputes elitist charge      * Edward Kennedy speech sets off celebration           By Steve Holland,      DENVER, Aug 25 (Reuters) - Democrats opening their national  convention tried to smooth over a rift with Hillary Clinton's  resentful supporters on Monday and portrayed Barack Obama as a  down-to-earth American patriot bidding to make history.      Chairman Howard Dean pounded a gavel to start the four-day  convention where Democrats say their presidential candidate  must unite the party, get tough on Republican rival John McCain  and back up soaring oratory with specific policies.       The aim of the first day was to frame Obama's personal  story, the son of a black man from Kenya and white woman from  Kansas who spent his early years in Hawaii and Indonesia,  worked his way through college and began his political career  as a community organizer in Chicago.       His wife, Michelle Obama, headlined the opening night. In  front of a huge crowd waving 'Michelle' signs, she said her  husband represented typical American values, rejecting  Republican charges that Obama is an aloof celebrity.      'What struck me when I first met Barack was that even  though he had this funny name, and even though he'd grown up  all the way across the continent in Hawaii, his family was so  much like mine,' she said.      'He was raised by grandparents who were working class folks  just like my parents, and by a single mother who struggled to  pay the bills just like we did,' she said.       Michelle Obama also put a gloss on her own assertive  personality. She has drawn fire from Republicans for saying she  only recently became proud of her country.      'I come here as a wife who loves my husband and believes he  will be an extraordinary president. I come here as a mom whose  girls are the heart of my heart and the center of my world,'  she said.      Speaking to reporters in Illinois, the first-term senator  tried to calm anxiety among some Democrats about a mild slide  in opinion polls that has left him in a dead heat with McCain  heading toward the Nov. 4 election.      He said his nomination acceptance speech on Thursday would  be 'workmanlike,' short on lofty words and long on policy  details.      He also played down divisions with the Clintons, Hillary  and Bill, the former president still stewing over having been  accused by Obama of trying to inject racial politics into the  Democrats' primary battle earlier this year.      'I am absolutely convinced that both Hillary Clinton and  Bill Clinton understand the stakes,' Obama told reporters in  Moline, Illinois.      In her speech, Michelle Obama praised Clinton for seeking  to advance the cause of American women 'so that our daughters  and sons can dream a little bigger and aim a little higher.'      In an emotional high point, Massachusetts Sen. Edward  Kennedy, 76, a symbol of Democratic liberalism who is battling  brain cancer, appeared before the cheering crowd after a  videotaped tribute to his long political life.      'My fellow Americans, it is so wonderful to be here,' said  Kennedy. 'And nothing -- nothing -- is going to keep me away  from this special gathering tonight.'      Otherwise, some Democrats were left wanting by the  convention's first day.      'If this party has a message, it's done a helluva job  hiding it tonight,' Democratic commentator and former Clinton  aide James Carville said on CNN.   ",
        "Histogram": [
            0.6,
            0.6,
            0,
            0,
            0.6,
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 14.625358581542969,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Democrats opening their national convention tried to smooth over a rift with Hillary Clinton's resentful supporters on Monday and portrayed Barack Obama as a down-to-earth American patriot bidding to make history.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the word 'resentful' to describe Hillary Clinton's supporters implies a negative judgment and suggests an unjustified emotional response, which could influence the reader's perception negatively towards these supporters."
                },
                {
                    "text": "Chairman Howard Dean pounded a gavel to start the four-day convention where Democrats say their presidential candidate must unite the party, get tough on Republican rival John McCain and back up soaring oratory with specific policies.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'soaring oratory' implies a judgment that the candidate's speeches are overly grand or dramatic without substance, suggesting a lack of credibility in his communication style."
                },
                {
                    "text": "Michelle Obama, headlined the opening night. In front of a huge crowd waving 'Michelle' signs, she said her husband represented typical American values, rejecting Republican charges that Obama is an aloof celebrity.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'rejecting Republican charges' frames the narrative in a way that suggests the opposition's criticisms are baseless or unfair, implying a defensive and possibly biased stance."
                },
                {
                    "text": "Michelle Obama also put a gloss on her own assertive personality. She has drawn fire from Republicans for saying she only recently became proud of her country.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Describing Michelle Obama's response to criticism as 'putting a gloss' on her personality implies a superficial or insincere attempt to improve her image, which could bias the reader against her."
                },
                {
                    "text": "Speaking to reporters in Illinois, the first-term senator tried to calm anxiety among some Democrats about a mild slide in opinion polls that has left him in a dead heat with McCain heading toward the Nov. 4 election.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'tried to calm anxiety' suggests a manipulative or insincere attempt to manage public perception, implying that the senator's actions are more about appearance than genuine concern."
                },
                {
                    "text": "He said his nomination acceptance speech on Thursday would be 'workmanlike,' short on lofty words and long on policy details.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Describing the speech as 'workmanlike' and contrasting it with 'lofty words' implies a criticism of typical political rhetoric as empty or insubstantial, suggesting a bias towards a more practical or mundane approach."
                },
                {
                    "text": "He also played down divisions with the Clintons, Hillary and Bill, the former president still stewing over having been accused by Obama of trying to inject racial politics into the Democrats' primary battle earlier this year.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'stewing' to describe Bill Clinton's reaction introduces a negative and emotionally charged word, suggesting that his response is irrational or overly emotional, which could bias the reader against him."
                },
                {
                    "text": "In her speech, Michelle Obama praised Clinton for seeking to advance the cause of American women 'so that our daughters and sons can dream a little bigger and aim a little higher.'",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "While this sentence itself is not biased, the context in which it is presented, focusing on the interactions and statements of the Obama family and their supporters, could imply a bias by omission, suggesting a selective and possibly skewed portrayal of events."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias through the use of word choice, particularly in framing the narratives of the Obama campaign and its supporters in a favorable light while subtly undermining the credibility or character of their opponents. The general bias tendency leans towards portraying the Obama campaign in a positive and sympathetic manner, while casting doubt or criticism on the actions and statements of their Republican counterparts."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.19047619047619047,
            "overall_rating": 0.3952380952380952
        },
        "combined_score": 0.0
    },
    {
        "Title": "UPDATE 3-Michelle Obama carries U.S. designers into spotlight",
        "URL": "UPDATE 3-Michelle Obama carries U.S. designers into spotlight.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "  (Recasts with details of inaugural ball dress, new quotes)      By Jill Serjeant      LOS ANGELES, Jan 20 (Reuters) - Michelle Obama officially  entered the world stage on Tuesday in outfits by U.S. designers  paired with off-the-rack accessories, mixing glamour with  practicality.      The first lady chose a sparkling sheath dress and matching  coat in yellow-gold by Cuban-born designer Isabel Toledo for  the swearing-in ceremony but added olive green gloves from  chain store J.Crew and Jimmy Choo shoes.      For the inaugural balls, she wore a white, one-shouldered  chiffon gown with a full skirt by Taiwan-born U.S. designer  Jason Wu, 26, whose dresses cost up to $6,000.      'How good looking is my wife?,' President Barack Obama  asked the crowd at the first of 10 inaugural balls attended by  the couple.      Michelle Obama's clothing choices were expected to provide  clues to the way she will undertake her role as first lady in a  time of deep recession.      A former lawyer, Michelle Obama, 45, has won kudos for her  chic, youthful style, mixing chain store garments with edgy  designers like Chicago's Mario Pinto and Narciso Rodriguez.      Her daughters, Malia, 10, and Sasha, 7, both wore J. Crew  coats to the presidential swearing-in ceremony.      Obama won praise in June by wearing a $148 black and white  off-the-rack dress for appearing on the TV chat show 'The  View.' It sold out nationwide overnight.      Her yellow swearing-in outfit was a departure from red,  white or blue tones often adopted by U.S. female politicians  and spouses. Yellow is seen in many parts of the world as a  symbol of hope and optimism.           'RADIATED HOPE AND OPTIMISM'      But Obama's choice did not get universal approval. An  online poll on the Us Weekly celebrity magazine site showed 55  percent of readers hated the outfit and 44 percent loved it.      Bonnie Fuller, former editor in chief of Glamour magazine,  called the outfit bold but wondered on www.huffingtonpost.com:  'Is she walking around in inaugural upholstery?'       New York-based designer Toledo, 47, said the coat and  dress were made of Swiss wool lace, backed with netting for  warmth and lined in French silk.      'For me yellow represents hope,' Toledo told Reuters. 'It  really feels like freshness to me. I wanted to capture  optimism, I wanted it to feel happy, I wanted it to feel  inclusive.'      Her ball gown, which will go on show at the Smithsonian,  received a mixed reaction with U.S. fashion bible Women's Wear  Daily saying it made the Obamas look like newlyweds.      'But Michelle Obama is rewriting the fashion rules and she  looks every inch the style icon she is becoming,' wrote the Los  Angeles Times.      In hard times, fashion commentators expected Obama to avoid  anything too glitzy or frivolous. But dressing down too much  could have attracted as much criticism as extravagance.      Former first lady Rosalynn Carter was criticized during the  1970s oil crisis for wearing her previously worn, off-the-rack  gown to the 1977 inaugural ball.      In 1981, Nancy Reagan was deemed 'too Hollywood' with her  white, one-shoulder, lace satin sheath with crystal beads.      Obama is already considered an ambassador for American  fashion. She was listed in Vanity Fair's magazine's '10 of the  World's Best Dressed People' in both 2007 and 2008 and has  drawn numerous comparisons with Jacqueline Kennedy.    (Additional reporting by Belinda Goldsmith and Alexandria  Sage; ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 14.593011856079102,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides a factual account of Michelle Obama's fashion choices and their reception without promoting a particular viewpoint or using language that implies judgment."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "UPDATE 2-Michelle Obama picks yellow for inauguration dress",
        "URL": "UPDATE 2-Michelle Obama picks yellow for inauguration dress.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "  (Adds new quotes from designer)      By Jill Serjeant      LOS ANGELES, Jan 20 (Reuters) - Michelle Obama, hailed by  many as America's new style icon, officially took her place on  the world stage on Tuesday wearing an outfit in the  nontraditional color of yellow and set fashionistas atwitter.      The new U.S. first lady, 45, chose a sparkling sheath dress  and matching coat in a yellow-gold hue by Cuban-born American  designer Isabel Toledo for the presidential swearing-in  ceremony. She matched it with a wide diamante necklace.      What she will wear to the formal inaugural ball later on   Tuesday remained a tightly held secret. But her choice is  expected to provide clues to her future balancing act as   glamorous first lady in a time of deep recession.      Michelle Obama, a former lawyer, has been credited with   bringing a chic, youthful style to U.S. politics and for mixing  comfortable chain store garments from the likes of Gap and J.  Crew with edgier new designers like Chicago's Mario Pinto and   Narciso Rodriguez.      Initially seen as slightly aloof, she won hearts in June by  wearing an affordable $148 black and white off-the-rack dress  for an appearance on the popular female TV chat show 'The  View.' It sold out nationwide overnight.      Her swearing-in outfit was a departure from the red, white  or blue tones often adopted by U.S. female politicians on  high-profile occasions.      Yellow is traditionally seen in many parts of the world as  a symbol of hope and optimism, style experts said.        'RADIATED HOPE AND OPTIMISM'      'Yellow is the color of optimism and confidence and hope  ... The whole ensemble radiated hope and optimism,' Mandi  Norwood, a former editor at Mademoiselle magazine who is  writing a book on Michelle Obama's style, told Reuters      But Obama's choice did not get a universal thumbs up. An  online poll on the Us Weekly celebrity magazine site showed 55  percent of readers hated the outfit and 44 percent loved it.      Bonnie Fuller, former editor in chief of Glamour magazine,  called it 'bold' but wondered, 'Is she walking around in  inaugural upholstery?' Fuller wrote in a blog on the  www.huffingtonpost.com Web site that she had heard one observer  quipping that the first lady was 'wearing a couch.'      New York-based designer Toledo said the coat and dress were  made of Swiss wool lace, backed with netting for warmth on the  bitterly cold Washington morning, and lined in French silk.      'For me yellow represents hope,' Toledo told Reuters. 'I  called it lemongrass because it's not exactly a yellow, it's  not a green, it's just in-between. It's full of sunshine. It  really feels like freshness to me.'      'I wanted to capture optimism, I wanted it to feel happy, I  wanted it to feel inclusive,' she said.      With home foreclosures and layoffs plaguing Americans  across the United States, fashion commentators expect Obama to  go for understated glamour at the 10 inauguration galas she  will attend, wearing nothing too glitzy or frivolous.      Dressing down too much could attract as much criticism as  extravagance.      Former first lady Rosalynn Carter was criticized during the  1970s oil crisis for wearing her previously worn, off-the-rack  gown to the 1977 inaugural ball.      In 1981, Nancy Reagan was deemed 'too Hollywood' with her  white, one-shoulder, lace satin sheath with crystal beads.      Los Angeles Times fashion critic Booth Moore doubted  Michelle Obama would take ",
        "Histogram": [
            0,
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0
        ],
        "Relevance": 14.076860427856445,
        "BiasReport": {
            "sentences": [
                {
                    "text": "What she will wear to the formal inaugural ball later on Tuesday remained a tightly held secret. But her choice is expected to provide clues to her future balancing act as glamorous first lady in a time of deep recession.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence implies a judgment about the role of the first lady during a recession, suggesting that her fashion choices will reveal how she balances glamour with the economic climate. It introduces a subjective opinion about the significance of her clothing in a time of hardship."
                },
                {
                    "text": "Initially seen as slightly aloof, she won hearts in June by wearing an affordable $148 black and white off-the-rack dress for an appearance on the popular female TV chat show 'The View.' It sold out nationwide overnight.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'slightly aloof' to describe Michelle Obama's initial perception carries a negative connotation, implying a distant or unfriendly demeanor. The subsequent contrast with her action of wearing an affordable dress is framed in a way to emphasize the positive impact, suggesting a deliberate choice of words to influence the reader's perception."
                },
                {
                    "text": "Her swearing-in outfit was a departure from the red, white or blue tones often adopted by U.S. female politicians on high-profile occasions.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Describing the choice of color as a 'departure' from tradition implies a deliberate and significant break from the norm, suggesting a level of importance or symbolism that may not be universally agreed upon. This choice of wording could influence the reader to perceive the decision as more groundbreaking than it might objectively be."
                },
                {
                    "text": "'RADIATED HOPE AND OPTIMISM' 'Yellow is the color of optimism and confidence and hope ... The whole ensemble radiated hope and optimism,' Mandi Norwood, a former editor at Mademoiselle magazine who is writing a book on Michelle Obama's style, told Reuters",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The emphatic statement about the color yellow and its association with hope and optimism, presented as an objective truth, reflects an opinionated bias. By quoting an individual's subjective interpretation of the outfit's symbolism without counterbalance, the article suggests a universal endorsement of this viewpoint."
                },
                {
                    "text": "But Obama's choice did not get a universal thumbs up. An online poll on the Us Weekly celebrity magazine site showed 55 percent of readers hated the outfit and 44 percent loved it.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'universal thumbs up' and 'hated' versus 'loved' introduces a word choice bias by framing the response to Michelle Obama's outfit in overly dramatic and polarizing terms. This could exaggerate the significance of the negative reactions and downplay the positive ones, skewing the reader's perception."
                },
                {
                    "text": "Bonnie Fuller, former editor in chief of Glamour magazine, called it 'bold' but wondered, 'Is she walking around in inaugural upholstery?' Fuller wrote in a blog on the www.huffingtonpost.com Web site that she had heard one observer quipping that the first lady was 'wearing a couch.'",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The comparison of Michelle Obama's outfit to 'inaugural upholstery' and 'a couch' employs a word choice bias by using derogatory and dismissive language to describe the attire. This type of colorful and negative metaphor can influence the reader's perception by introducing a humorous but ultimately belittling perspective on the outfit."
                },
                {
                    "text": "New York-based designer Toledo said the coat and dress were made of Swiss wool lace, backed with netting for warmth on the bitterly cold Washington morning, and lined in French silk.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The detailed description of the materials and their practical function, especially in the context of the weather, introduces a word choice bias by emphasizing the technical aspects over the aesthetic or symbolic. This could subtly undermine the significance of the outfit's design and color choice by redirecting the reader's attention to more mundane details."
                },
                {
                    "text": "With home foreclosures and layoffs plaguing Americans across the United States, fashion commentators expect Obama to go for understated glamour at the 10 inauguration galas she will attend, wearing nothing too glitzy or frivolous.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The juxtaposition of 'home foreclosures and layoffs' with 'glitzy or frivolous' fashion choices introduces an opinionated bias by suggesting a moral or ethical judgment about the appropriateness of certain types of attire during economic hardship. This framing implies that a certain level of restraint is expected or even required, based on the severity of the economic situation."
                },
                {
                    "text": "Dressing down too much could attract as much criticism as extravagance.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence introduces an opinionated bias by positing a false equivalence between 'dressing down' and 'extravagance' in terms of their susceptibility to criticism. The underlying assumption is that there is a correct, middle-ground approach to dressing for the galas, and deviations from this hypothetical standard are worthy of censure. This implies a normative stance on appropriate attire, which is subjective and context-dependent."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the significance and interpretation of Michelle Obama's choice of attire for the presidential swearing-in ceremony and the subsequent inaugural ball. The biases primarily manifest through word choice and opinionated statements, influencing the reader's perception of the outfit's symbolism, practicality, and social appropriateness, especially in the context of economic challenges. The general bias tendency leans towards overemphasizing the importance of fashion choices and their broader implications, particularly during times of national hardship."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.2962962962962963,
            "overall_rating": 0.44814814814814813
        },
        "combined_score": 0.0
    },
    {
        "Title": "UPDATE 1-Michelle Obama picks yellow for inauguration dress",
        "URL": "UPDATE 1-Michelle Obama picks yellow for inauguration dress.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": " (Adds further comments paragraphs 9-10)      By Jill Serjeant      LOS ANGELES, Jan 20 (Reuters) - Michelle Obama, hailed by  many as America's new style icon, officially took her place on  the world stage on Tuesday wearing an outfit in the  nontraditional color of yellow and set fashionistas atwitter.      The new U.S. first lady, 45, chose a sparkling sheath dress  and matching coat in a yellow-gold hue by Cuban-born American  designer Isabel Toledo for the presidential swearing-in  ceremony. She matched it with a wide diamante necklace.      What she will wear to the formal inaugural ball later on   Tuesday remained a tightly held secret. But her choice is  expected to provide clues to her future balancing act as   glamorous first lady in a time of deep recession.      Michelle Obama, a former lawyer, has been credited with   bringing a chic, youthful style to U.S. politics and for mixing  comfortable chain store garments from the likes of Gap and J.  Crew with edgier new designers like Chicago's Mario Pinto and   Narciso Rodriguez.      Initially seen as slightly aloof, she won hearts in June by  wearing an affordable $148 black and white off-the-rack dress  for an appearance on the popular female TV chat show 'The  View.' It sold out nationwide overnight.      Her swearing-in outfit was a departure from the red, white  or blue tones often adopted by U.S. female politicians on  high-profile occasions.      Yellow is traditionally seen in many parts of the world as  a symbol of hope and optimism, style experts said.        'RADIATED HOPE AND OPTIMISM'      'Yellow is the color of optimism and confidence and hope  ... The whole ensemble radiated hope and optimism,' Mandi  Norwood, a former editor at Mademoiselle magazine who is  writing a book on Michelle Obama's style, told Reuters      But Obama's choice did not get a universal thumbs up. An  online poll on the Us Weekly celebrity magazine site showed 55  percent of readers hated the outfit and 44 percent loved it.      Bonnie Fuller, former editor in chief of Glamour magazine,  called it 'bold' but wondered, 'Is she walking around in  inaugural upholstery?' Fuller wrote in a blog on the  www.huffingtonpost.com Web site that she had heard one observer  quipping that the first lady was 'wearing a couch.'      New York-based designer Toledo said the coat and dress were  made of Swiss wool lace, backed with netting for warmth on the  bitterly cold Washington morning, and lined in French silk.      'I wanted to pick a very optimistic color, that had  sunshine,' Toledo told New York Times fashion critic Cathy  Horyn on Tuesday. 'I wanted her to feel charmed, and in that  way would charm everybody.'      With home foreclosures and layoffs plaguing Americans  across the United States, fashion commentators expect Obama to  go for understated glamour at the 10 inauguration galas she  will attend, wearing nothing too glitzy or frivolous.      Dressing down too much could attract as much criticism as  extravagance.      Former first lady Rosalynn Carter was criticized during the  1970s oil crisis for wearing her previously worn, off-the-rack  gown to the 1977 inaugural ball.      In 1981, Nancy Reagan was deemed 'too Hollywood' with her  white, one-shoulder, lace satin sheath with crystal beads.      Los Angeles Times fashion critic Booth Moore doubted  Michelle Obama would take the Rosalyn Carter line for her  inaugural ball dress.      'At least for one night, we want our first lady to be ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0.6,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 14.072502136230469,
        "BiasReport": {
            "sentences": [
                {
                    "text": "But her choice is expected to provide clues to her future balancing act as glamorous first lady in a time of deep recession.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'balancing act as glamorous first lady in a time of deep recession' implies a judgment that being glamorous during a recession requires a delicate balance, suggesting a potential lack of sensitivity or appropriateness."
                },
                {
                    "text": "Initially seen as slightly aloof, she won hearts in June by wearing an affordable $148 black and white off-the-rack dress for an appearance on the popular female TV chat show 'The View.' It sold out nationwide overnight.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Describing Michelle Obama as 'initially seen as slightly aloof' and then 'won hearts' introduces a subjective opinion into what could be a straightforward account of an event, suggesting a bias towards portraying her in a certain light."
                },
                {
                    "text": "Her swearing-in outfit was a departure from the red, white or blue tones often adopted by U.S. female politicians on high-profile occasions.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'departure' and the comparison to 'U.S. female politicians' introduces a subtle bias by implying that Michelle Obama's choice is more significant or unconventional than it may be, suggesting a judgment on the typicality of political fashion."
                },
                {
                    "text": "But Obama's choice did not get a universal thumbs up. An online poll on the Us Weekly celebrity magazine site showed 55 percent of readers hated the outfit and 44 percent loved it.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Framing the response to Michelle Obama's outfit in terms of a 'universal thumbs up' or down and citing an online poll's results introduces a bias by emphasizing the controversy and implying a broader significance to individual opinions."
                },
                {
                    "text": "Bonnie Fuller, former editor in chief of Glamour magazine, called it 'bold' but wondered, 'Is she walking around in inaugural upholstery?' Fuller wrote in a blog on the www.huffingtonpost.com Web site that she had heard one observer quipping that the first lady was 'wearing a couch.'",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the phrases 'inaugural upholstery' and 'wearing a couch' to describe Michelle Obama's outfit introduces a bias through the use of derogatory and dismissive language, undermining the seriousness of the discussion."
                },
                {
                    "text": "New York-based designer Toledo said the coat and dress were made of Swiss wool lace, backed with netting for warmth on the bitterly cold Washington morning, and lined in French silk.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The detailed description of the materials used in the outfit, particularly in the context of defending it against criticism, introduces a bias by suggesting that the outfit's quality or appropriateness can be justified or explained through its luxurious components."
                },
                {
                    "text": "With home foreclosures and layoffs plaguing Americans across the United States, fashion commentators expect Obama to go for understated glamour at the 10 inauguration galas she will attend, wearing nothing too glitzy or frivolous.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The juxtaposition of 'home foreclosures and layoffs' with 'glamour' and 'glitzy or frivolous' introduces a bias by implying a judgment on the appropriateness of certain types of fashion choices during economic hardship, suggesting a lack of sensitivity or awareness."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding Michelle Obama's fashion choices, particularly in the context of her role as the first lady during a recession. The biases primarily manifest through word choice, implying judgments about the appropriateness, significance, and quality of her outfits, as well as suggesting a lack of sensitivity to economic hardships in the discussion of fashion."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.2,
            "overall_rating": 0.4
        },
        "combined_score": 0.0
    },
    {
        "Title": "WRAPUP 7-Backers of Hillary Clinton cloud Obama show",
        "URL": "WRAPUP 7-Backers of Hillary Clinton cloud Obama show.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    * Obama promises 'workmanlike' acceptance speech      * Michelle Obama disputes elitist charge      * Edward Kennedy speech sets off celebration           By Steve Holland,      DENVER, Aug 25 (Reuters) - Democrats opening their national  convention tried to heal a rift with Hillary Clinton's  resentful supporters on Monday and portrayed Barack Obama as a  down-to-earth American patriot bidding to make history.       Chairman Howard Dean pounded a gavel to start the four-day  convention where Democrats say their presidential candidate  must unite the party, get tough on Republican rival John McCain  and back up soaring oratory with specific policies.      The aim of the first day was to frame Obama's personal  story and the keynote speaker was his wife, Michelle Obama. In  excerpts from her prepared remarks, she seemed to want to  dispel Republican charges that Obama is an aloof celebrity.      'And in the end, after all that's happened these past 19  months, the Barack Obama I know today is the same man I fell in  love with 19 years ago,' she said.      Michelle Obama also put a gloss on her own assertive  personality. She has drawn fire from Republicans for saying she  only recently became proud of her country.      'I come here as a wife who loves my husband and believes he  will be an extraordinary president. I come here as a mom whose  girls are the heart of my heart and the center of my world,'  she said.      Speaking to reporters in Illinois, the first-term senator  tried to calm anxiety among some Democrats about a mild slide  in opinion polls that has left him in a dead heat with McCain  heading toward the Nov. 4 election.      He said his nomination acceptance speech on Thursday would  be 'workmanlike,' short on lofty words and long on policy  details.      He also played down divisions with the Clintons, Hillary  and Bill, the former president still stewing over having been  accused by Obama of trying to inject racial politics into the  Democrats' primary battle earlier this year.      'I am absolutely convinced that both Hillary Clinton and  Bill Clinton understand the stakes,' Obama told reporters in  Moline, Illinois.      In an emotional high point, Massachusetts Sen. Edward  Kennedy, 76, a symbol of Democratic liberalism who is battling  brain cancer, appeared before the cheering crowd after a  videotaped tribute to his long political life.      'My fellow Americans, it is so wonderful to be here,' said  Kennedy. 'And nothing -- nothing -- is going to keep me away  from this special gathering tonight.'      Casting a cloud over the convention was ongoing resentment  from supporters of New York Sen. Clinton, miffed that she lost  the nomination and upset that she was not picked as Obama's  vice presidential running mate. Obama chose veteran Delaware  Sen. Joe Biden, who arrived at the convention on Monday.      Clinton, speaking to sign-waving supporters from her home  state delegation before the convention began, urged party  unity.      'We are after all Democrats, so it may take a while,' she  said. 'We're not the fall-in-line party. We are diverse. But  make no mistake, we are unified,' she said.           ASSAULT ON MCCAIN BEGINS      Speakers began an assault on McCain, charging him with  wanting to maintain policies of unpopular President George W.  Bush.      'Republicans say that John McCain has experience,' said  House of Representatives Speaker Nancy Pelosi. 'We say that  John McCain has the experience of ",
        "Histogram": [
            0.6,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0.6,
            0,
            0
        ],
        "Relevance": 13.88161563873291,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Michelle Obama disputes elitist charge",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the word 'elitist' carries a negative connotation and implies judgment about Barack Obama, suggesting a bias through the choice of language."
                },
                {
                    "text": "Michelle Obama also put a gloss on her own assertive personality. She has drawn fire from Republicans for saying she only recently became proud of her country.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'put a gloss' and the use of 'drawn fire' both imply a negative judgment and bias through the choice of language, suggesting that Michelle Obama's statements are being misrepresented or unfairly criticized."
                },
                {
                    "text": "He said his nomination acceptance speech on Thursday would be 'workmanlike,' short on lofty words and long on policy details.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Describing the speech as 'workmanlike' and contrasting it with 'lofty words' implies a judgment that speeches with 'policy details' are superior, suggesting a bias through the choice of language that devalues or dismisses the importance of inspirational oratory."
                },
                {
                    "text": "Casting a cloud over the convention was ongoing resentment from supporters of New York Sen. Clinton, miffed that she lost the nomination and upset that she was not picked as Obama's vice presidential running mate. Obama chose veteran Delaware Sen. Joe Biden, who arrived at the convention on Monday.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'Casting a cloud over the convention' and the use of 'miffed' and 'upset' to describe Clinton's supporters' feelings introduce a negative tone and imply a judgment about the emotional responses of the supporters, suggesting a bias through the choice of language that diminishes the legitimacy of their concerns."
                },
                {
                    "text": "Clinton, speaking to sign-waving supporters from her home state delegation before the convention began, urged party unity.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The mention of 'sign-waving supporters' in a context that seems to downplay the significance of the event introduces a dismissive tone and implies a judgment about the nature of the support, suggesting a bias through the choice of language that diminishes the importance of the unity message."
                },
                {
                    "text": "Speakers began an assault on McCain, charging him with wanting to maintain policies of unpopular President George W. Bush.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'assault' to describe political criticism and the framing of McCain's positions as 'wanting to maintain' rather than 'supporting' policies of President Bush introduce a negative and confrontational tone, suggesting a bias through the choice of language that exaggerates the nature of the critique."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias through the use of word choice, particularly in the framing of certain individuals' actions and statements, which introduces a negative or dismissive tone and implies judgment about the subjects discussed. The biases are primarily directed towards portraying certain political figures and their supporters in a negative light, while also devaluing the importance of certain political strategies or positions."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.11538461538461539,
            "overall_rating": 0.3576923076923077
        },
        "combined_score": 0.0
    },
    {
        "Title": "Michelle Obama says White House \"feels so good\"",
        "URL": "Michelle Obama says White House \"feels so good\".txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    LOS ANGELES, Feb 25 (Reuters Life!) - Few things are as  sweet to a parent as family meals and bedtime with the kids,  and those are two reasons Michelle Obama says her new life at  the White House is comforting.      Well, those and a little exercise.      In an interview for the March 9 issue of People magazine,  the First Lady reveals some details of her family life in the  month since President Barack Obama was inaugurated, and they  moved their daughters, Malia, 10, and Sasha, 7 into 1600  Pennsylvania Ave. in Washington, D.C.      After more than a year living out of suitcases and in hotel  rooms on the campaign trail, Michelle Obama says the family now  has dinner together every night, where they talk about the  highs and lows of their day. Later the president is able to  tuck his children into bed before they drift off to sleep.      'We haven't had that kind of time together for (years), so  that explains a lot why we all feel so good in this space,' the  First Lady told People magazine.      Among their daily routine is exercise for her and her  husband at 5:30 in the morning and breakfast together before  their respective days begin. She said the secrets to their  successful marriage include being able to laugh together and  his ability to stay calm under stress.      But she stopped well short of saying they are a model of  married perfection. 'I don't want anybody to think it's easy.  It works because we really work at it ... We have a strong  marriage, but it's not perfect.'      She did say her husband has quit smoking, for now, and that  Malia and Sasha must still do their chores -- make their beds,  clean their rooms and clear the dishes from the dinner table.      'People (here) want to make your life easy, and when you  have small kids -- I've explained this to the staff -- they  don't need their lives to be easy. They're kids,' she said.      And what about the president's promise to get a dog for the  girls? The First Lady said it is on the way, but is waiting  until April, after the girls have had their spring break from  school. But she has a problem -- the name.      The girls have come up with several ideas, including Frank  and Moose, but mom Obama is not going for those. 'I'm like, no.  Come on. Let's work with the names a little bit,' she said.      (Editing by Jill Serjeant and Patricia Reaney)      ((bob.tourtellotte@thomsonreuters.com; 1 213-380-2014))      (To read more about our entertainment news, visit our blog  'Fan Fare' online at http://blogs.reuters.com/fanfare/)       Keywords: PEOPLE MICHELLEOBAMA       ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 13.704864501953125,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides a personal insight into Michelle Obama's family life in the White House without displaying any evident bias towards a particular viewpoint or group."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "FEATURE-Michelle Obama, Cindy McCain are study in contrast",
        "URL": "FEATURE-Michelle Obama, Cindy McCain are study in contrast.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Caren Bohan      WASHINGTON, June 10 (Reuters) - Michelle Obama and Cindy  McCain share a dislike of rough-edged U.S. politics. Each tried  to talk her spouse out of running for the White House.      Obama, wife of Democratic candidate Barack Obama, and  McCain, who is married to Republican John McCain, are both  known for an elegant sense of style, lending glamour to their  husbands' campaigns.      McCain posed in size zero jeans for the latest issue of  Vogue. Obama, who has also appeared in the fashion magazine,  was praised by style writers for the violet sheath dress she  wore to her husband's Democratic nomination victory rally and  has been compared to former first lady Jacqueline Kennedy.      But the aspiring first ladies have plenty of differences.      Obama, 44, is a Princeton- and Harvard-educated lawyer  raised by blue-collar parents on the working-class South Side  of Chicago. She would be the first African American U.S. first  lady.      Obama talks often on the campaign trail about being a  working mother. Until recently, she juggled a job as a hospital  executive with raising two young daughters and lending support  to her 46-year-old husband's political aspirations.      The strong-minded Obama exudes confidence and is an  accomplished public speaker. But her penchant for outspokenness  has also drawn some criticism.      McCain, 54, the Arizona senator's second wife, is reserved  and seems far less comfortable in the limelight when she  campaigns with her husband, who is 18 years her senior.           RODEO QUEEN      The blond, blue-eyed McCain is a former rodeo queen and  cheerleader who holds a master's degree in special education  from the University of Southern California. She grew up in a  wealthy family in Phoenix and is heiress to Hensley & Co, one  of the largest U.S. distributors for brewing giant  Anheuser-Busch.      Last month, she released a tax return showing she made  about $6 million in 2006.      McCain has raised four children, including a daughter  Bridget, 16, whom she adopted from Mother Teresa's orphanage in  Bangladesh. McCain has traveled the globe as part of her  charitable work.      McCain's deferential manner puts her in the company of more  traditional first ladies such as Nancy Reagan and Laura Bush.      'She is more in the classic mold of the candidate's wife on  the campaign trail,' said Calvin Jillson, a political scientist  at Southern Methodist University in Dallas.      He said McCain has her own version of the 'Nancy Reagan  stare,' the adoring gaze that the former first lady perfected.      'If you look at Michelle Obama, it appears that throughout  their married life, she and her husband have been very much  equals,' Jillson said. Her image as an equal partner was on  display with the celebratory fist-bump the Obamas shared on the  night he clinched the nomination last week.      America has had nontraditional first ladies before. They  included Rosalynn Carter, wife of Jimmy Carter who sat in on  Cabinet meetings, and Hillary Clinton, who was named by her  husband to lead a health-care task force.      Obama met her husband through her work as a corporate  lawyer and is his closest adviser, although associates have  described her role as less of a policy-oriented one than that  of a confidante who provides a reality check.      She has acquired an image as a tough-minded task-master.      In a favorite line on the campaign trail, the Illinois  senator says his wife of",
        "Histogram": [
            0,
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0.6,
            0,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 13.653419494628906,
        "BiasReport": {
            "sentences": [
                {
                    "text": "McCain posed in size zero jeans for the latest issue of Vogue. Obama, who has also appeared in the fashion magazine, was praised by style writers for the violet sheath dress she wore to her husband's Democratic nomination victory rally and has been compared to former first lady Jacqueline Kennedy.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The sentence uses word choice to emphasize the fashion and glamour aspects of the candidates' wives, implying a judgment about the significance of their appearances in the political context."
                },
                {
                    "text": "The strong-minded Obama exudes confidence and is an accomplished public speaker. But her penchant for outspokenness has also drawn some criticism.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Describing Michelle Obama as 'strong-minded' and highlighting her 'outspokenness' in a context where it may not be relevant introduces a subtle bias through word choice, suggesting a deviation from an expected or traditional demeanor for a first lady."
                },
                {
                    "text": "The blond, blue-eyed McCain is a former rodeo queen and cheerleader who holds a master's degree in special education from the University of Southern California. She grew up in a wealthy family in Phoenix and is heiress to Hensley & Co, one of the largest U.S. distributors for brewing giant Anheuser-Busch.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The detailed description of Cindy McCain's physical attributes and personal history, particularly the emphasis on her appearance and family wealth, introduces a bias through word choice, potentially framing her in a stereotypical or privileged light."
                },
                {
                    "text": "McCain's deferential manner puts her in the company of more traditional first ladies such as Nancy Reagan and Laura Bush. 'She is more in the classic mold of the candidate's wife on the campaign trail,' said Calvin Jillson, a political scientist at Southern Methodist University in Dallas. He said McCain has her own version of the 'Nancy Reagan stare,' the adoring gaze that the former first lady perfected.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Comparing Cindy McCain to 'more traditional first ladies' and specifically likening her mannerisms to the 'Nancy Reagan stare' introduces bias through word choice, implying a judgment about the appropriateness of her behavior and its conformity to historical norms."
                },
                {
                    "text": "If you look at Michelle Obama, it appears that throughout their married life, she and her husband have been very much equals,' Jillson said. Her image as an equal partner was on display with the celebratory fist-bump the Obamas shared on the night he clinched the nomination last week.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The assertion that Michelle Obama and her husband 'have been very much equals' and the reference to the 'celebratory fist-bump' as evidence of this equality introduces bias through word choice, suggesting that such displays are necessary to prove equality in a marriage."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the portrayal of Michelle Obama and Cindy McCain, particularly in the context of their roles as candidates' wives. The biases are primarily manifested through word choice, emphasizing certain aspects of their personal lives and appearances in a manner that implies judgment about their suitability for their roles."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.25,
            "overall_rating": 0.425
        },
        "combined_score": 0.0
    }
]