[
    {
        "Title": "Obama wants economic stimulus package passed quickly",
        "URL": "Obama wants economic stimulus package passed quickly.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    WASHINGTON, Nov 7 (Reuters) - U.S. President-elect Barack  Obama said on Friday he wanted Congress to pass another  stimulus package as soon as possible to stabilize the U.S.  economy.      'We are going to need to see a stimulus package passed  either before or after the inauguration (on Jan. 20). I want to  see a stimulus package sooner rather than later,' Obama told a  news conference in Chicago after meeting his economic  advisers.      (Writing by Ross Colvin, Editing by Chizu Nomiyama)  Keywords: USA ELECTION/OBAMA STIMULUS        ",
        "Histogram": [
            0,
            0,
            0,
            0
        ],
        "Relevance": 20.1358585357666,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it primarily reports on Barack Obama's statement regarding the need for a stimulus package to stabilize the U.S. economy without introducing any subjective or misleading information."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Obama: Optimistic that stimulus package to pass Congress",
        "URL": "Obama: Optimistic that stimulus package to pass Congress.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    WASHINGTON, Jan 28 (Reuters) - President Barack Obama said  on Wednesday he was confident that his economic stimulus  package would be passed by Congress.      'We're going to get it passed,' he told reporters at the  start of a meeting with corporate executives before a vote by  the House of Representatives on his $825 billion economic  package expected later on Wednesday.      Obama said it was important to act swiftly to boost the  troubled U.S. economy, adding that it was facing 'enormous  problems.'   ((Reuters Messaging: matt.spetalnick.reuters.com@reuters.net;  +1 202 898 8300))  Keywords: OBAMA/STIMULUS        ",
        "Histogram": [
            0,
            0,
            0,
            0
        ],
        "Relevance": 18.896448135375977,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides a straightforward report on President Barack Obama's confidence in the passage of his economic stimulus package without exhibiting any of the typical signs of bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Obama adviser pushes economic stimulus package",
        "URL": "Obama adviser pushes economic stimulus package.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    WASHINGTON, Dec 1 (Reuters) - A senior adviser to U.S.  President-elect Barack Obama said on Monday the news that the  United States has been in a recession for a year underscored  the need for an economic stimulus package.      Lawrence Summers, tapped by Obama to become director of the  White House National Economic Council, said the slump may be  worsening.      'While the economy has already lost 1.2 million jobs this  year, recent economic evidence suggests that the pace of this  downturn is accelerating. That is why President-elect Obama has  set as his top priority passing an economic recovery plan,'  Summers said in a statement.   (Reporting by Caren Bohan)   ((caren.bohan@thomsonreuters.com; Reuters messaging:  caren.bohan.reuters.com@reuters.net))  Keywords: USA OBAMA/RECESSION        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 18.37224578857422,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides a straightforward report on Lawrence Summers' statement regarding the need for an economic stimulus package in response to the recession, without exhibiting any of the typical signs of bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "RPT-Obama adviser pushes economic stimulus package",
        "URL": "RPT-Obama adviser pushes economic stimulus package.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": " (Repeats to attach story to news alerts)      WASHINGTON, Dec 1 (Reuters) - A senior adviser to U.S.  President-elect Barack Obama said on Monday the news that the  United States has been in a recession for a year underscored  the need for an economic stimulus package.      Lawrence Summers, tapped by Obama to become director of the  White House National Economic Council, said the slump may be  worsening.      'While the economy has already lost 1.2 million jobs this  year, recent economic evidence suggests that the pace of this  downturn is accelerating. That is why President-elect Obama has  set as his top priority passing an economic recovery plan,'  Summers said in a statement.   (Reporting by Caren Bohan)   ((caren.bohan@thomsonreuters.com; Reuters messaging:  caren.bohan.reuters.com@reuters.net))  Keywords: USA OBAMA/RECESSION        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 17.764862060546875,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it primarily reports on a statement made by Lawrence Summers regarding the need for an economic stimulus package in response to the recession in the United States. The information presented is factual and does not exhibit any of the typical signs of bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "WRAPUP 2-Obama meets with Republican on stimulus package",
        "URL": "WRAPUP 2-Obama meets with Republican on stimulus package.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": " (Updates with meeting begins)      By Caren Bohan and Thomas Ferraro      WASHINGTON, Jan 27 (Reuters) - President Barack Obama urged  skeptical Republicans to back his $825 billion economic  stimulus package on Tuesday during a visit to the U.S. Congress  on Capitol Hill.      Shortly before Obama arrived, House Minority Leader John  Boehner told fellow Republicans that in its current form, he  could not vote for the stimulus and encouraged fellow House  Republicans to vote against it, a Boehner spokesman said.      Obama conferred first with Republican members of the House  of Representatives and then was to go to the other side of the  Capitol to talk to Senate Republicans.      Republicans agree that the stumbling economy needs a rescue  package. But they complain the Democratic $550 billion spending  proposal is excessive while their proposal to cut taxes by  about $275 billion does not go far enough.      'We're anxious to help him. We think the country needs a  stimulus,' Senate Republican Leader Mitch McConnell said  earlier on Tuesday on NBC's 'Today Show.'      A week after taking office, Obama faces an economic crisis  that seems to worsen by the day. U.S. consumer confidence  slipped to a record low and major U.S. companies are cutting  tends of thousands of jobs as financial industry troubles  continue to mount.  [ID:nT114397]      Obama's meeting with the Republican lawmakers comes the day  after Treasury Secretary Timothy Geithner won Senate  confirmation and was sworn in.  [ID:nN26616671]      The Democratic-led House and Senate are expected to approve  the package by the middle of next month regardless of how many  Republicans embrace it.      McConnell said he believes Congress can hit the Democrats'  deadline of passing a rescue measure by mid-February. He said  Obama may have more difficulty with Democrats than Republicans  in getting a balanced package.      With the House set to vote on its version of the plan this  week, a co-chair of the coalition of fiscally conservative  Democrats said his 50-member group had concerns.  [ID:nN27437028]      Representative Charlie Melancon of Louisiana said his  colleagues want Obama to promise that the record federal  deficit is not further bloated by tax cuts or by increases in  mandatory government spending programs, like the Social  Security retirement program and Medicare health care program  for the elderly.      'The majority of us want to support the president and do a  stimulus package,' Melancon said. 'But we also have come to the  realization that every day that we don't get a commitment to  reel in this spending that we've been doing without paying for  it is a day ... that the problem gets worse.'           'WANTS TO HEAR THEIR IDEAS'      White House spokesman Robert Gibbs said Obama wants to  listen to Republicans as part of his vow to seek consensus and  end traditional partisan gridlock.      'He wants to hear their ideas. If there are good ideas --  and I think he assumes there will be -- that we will look at  those ideas,' Gibbs told reporters on Monday.      Obama's aides have said three-quarters of the proposed new  spending, on health care, education and building new roads and  bridges, would work its way into the economy within 18 months.      A report by the nonpartisan Congressional Budget Office  said it would take a bit longer. CBO estimated that about 64  percent of the stimulus package would be reach the economy  within 19 months. [ID:nN26508666]   ",
        "Histogram": [
            0,
            0.6,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0.5,
            0.5,
            0.5,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 17.564144134521484,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Shortly before Obama arrived, House Minority Leader John Boehner told fellow Republicans that in its current form, he could not vote for the stimulus and encouraged fellow House Republicans to vote against it, a Boehner spokesman said.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the word 'encouraged' to describe Boehner's actions implies a judgment that his stance is the correct or morally superior one, suggesting a negative connotation towards the stimulus package."
                },
                {
                    "text": "Republicans agree that the stumbling economy needs a rescue package. But they complain the Democratic $550 billion spending proposal is excessive while their proposal to cut taxes by about $275 billion does not go far enough.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The word 'complain' implies a dismissive attitude towards the concerns of the Republicans, suggesting a judgment that their objections are unwarranted or trivial, which introduces a bias."
                },
                {
                    "text": "McConnell said he believes Congress can hit the Democrats' deadline of passing a rescue measure by mid-February. He said Obama may have more difficulty with Democrats than Republicans in getting a balanced package.",
                    "bias_type": "Political Bias",
                    "bias_strength": 0.5,
                    "bias_description": "This sentence implies that Democrats are more resistant to a 'balanced package' than Republicans, suggesting a favorable view towards the Republicans' position and a negative view towards the Democrats' stance."
                },
                {
                    "text": "With the House set to vote on its version of the plan this week, a co-chair of the coalition of fiscally conservative Democrats said his 50-member group had concerns.",
                    "bias_type": "Political Bias",
                    "bias_strength": 0.5,
                    "bias_description": "The emphasis on 'fiscally conservative Democrats' and their concerns may suggest a bias by highlighting a specific faction within the Democratic party that aligns more with Republican views, potentially skewing the perception of the party's overall position."
                },
                {
                    "text": "Representative Charlie Melancon of Louisiana said his colleagues want Obama to promise that the record federal deficit is not further bloated by tax cuts or by increases in mandatory government spending programs, like the Social Security retirement program and Medicare health care program for the elderly.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the word 'bloated' to describe the potential impact of tax cuts or spending programs on the federal deficit introduces a negative connotation and bias, suggesting that these measures would unreasonably or excessively increase the deficit."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the discussion on the economic stimulus package, particularly in its portrayal of the positions and concerns of the Republican and Democratic parties. The biases identified include Word Choice Bias and Political Bias, with a general tendency to frame Republican objections and positions more favorably than those of the Democrats, and to use language that subtly undermines the Democratic perspective."
            }
        },
        "Scores": {
            "average_bias_strength": 0.56,
            "percentage_of_biased_sentences": 0.125,
            "overall_rating": 0.3425
        },
        "combined_score": 0.0
    },
    {
        "Title": "SCENARIOS-Can Obama forge consensus over stimulus package?",
        "URL": "SCENARIOS-Can Obama forge consensus over stimulus package?.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    WASHINGTON, Jan 22 (Reuters) - An $825 billion stimulus  bill aimed at reviving the U.S. economy presents an early test  of President Barack Obama's vow to overcome partisan politics  and forge consensus.      Following are scenarios on the political risks Obama and  his fellow Democrats in Congress as well as Republican  lawmakers face as they address the president's proposed package  of new federal spending and tax cuts.           RISKS FOR OBAMA AND DEMOCRATIC-LED CONGRESS      With Democrats in control of both Congress and the White  House for the first time since 1995, the stimulus package will  be their initial major test.      If the package proves effective, eases a deepening  recession and creates or saves millions of jobs, the new  president will be crowned a political hero. The same goes for  those who helped him turn the legislation into law.      If the package fails to jump-start the economy, a now  adoring public may turn against Obama and he could face a tough  time winning a second term in 2012.      Democrats in Congress could pay a price even sooner. The  entire House of Representatives and a third of the 100-member  Senate will be up for grabs in 2010. Unless the economy  improves markedly, expect Republicans to gain seats in both  chambers.           RISKS FOR OBAMA      Obama's main objective is to have the stimulus package  passed by Congress, a task helped by Democratic majorities in  both houses of Congress.      He also needs a bipartisan consensus of Republicans and  Democrats to pass it to bolster his image as a bridge builder.      Consensus will show voters that a campaign promise to end  overly partisan politics is being fulfilled.      If not, it will be seen as evidence that partisan divisions  defy Obama's ability to produce change, even during his  so-called honeymoon period.      In his inaugural address, he said, 'The old stale political  arguments that have consumed us for so long no longer apply.'      Commentators are watching for attempts by Republicans to  block the legislation through a filibuster in the Senate. Any  sustained attempt to do so would be read as defiance.      Obama also risks angering Democratic allies if they  perceive he works harder to satisfy Republican demands for a  bigger component of tax cuts in the bill than Democratic  objections.           RISKS FOR REPUBLICANS      Republican House Minority Leader John Boehner accused  Democrats on Thursday of wanting to push the stimulus bill  through without bothering to find common ground with  Republicans.      Some Republicans also fear the bill, which Democratic  leaders want passed by mid-February, is too big and is being  pushed through too fast.      But Republicans want to avoid been seen as obstructing a  bill that could revive the economy in a severe recession.      Their vote against former President George W. Bush's $700  billion bank bailout in October sent the stock market reeling  and hurt the presidential bid of Republican John McCain.      Republicans also want to push for tax cuts and resist  wanton government spending -- issues seen as core principles  for their party.      If they are perceived as being overly cooperative with  Democrats on those issues, they risk angering fiscally  conservative supporters.           RISKS FOR DEMOCRATS      Democratic lawmakers must peacefully resolve differences  within the economic package -- or risk riling members of their  own party, particularly those pushing for more ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 17.444366455078125,
        "BiasReport": {
            "sentences": [
                {
                    "text": "If the package proves effective, eases a deepening recession and creates or saves millions of jobs, the new president will be crowned a political hero. The same goes for those who helped him turn the legislation into law.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the phrase 'crowned a political hero' implies a strong positive judgment and could influence the reader's perception of the outcome without presenting a balanced view."
                },
                {
                    "text": "If the package fails to jump-start the economy, a now adoring public may turn against Obama and he could face a tough time winning a second term in 2012.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence uses emotionally charged language ('a now adoring public may turn against') to suggest a dramatic and negative consequence, potentially exaggerating the impact of the package's failure."
                },
                {
                    "text": "Obama's main objective is to have the stimulus package passed by Congress, a task helped by Democratic majorities in both houses of Congress.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'a task helped by Democratic majorities' implies a positive connotation towards the Democrats' role, suggesting an inherent advantage that may not be universally agreed upon."
                },
                {
                    "text": "He also needs a bipartisan consensus of Republicans and Democrats to pass it to bolster his image as a bridge builder.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Describing the need for bipartisan consensus to 'bolster his image as a bridge builder' implies a judgment about Obama's intentions and the significance of this consensus for his public image."
                },
                {
                    "text": "Consensus will show voters that a campaign promise to end overly partisan politics is being fulfilled.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence presents a subjective opinion as a fact, suggesting that the demonstration of consensus will definitively prove the fulfillment of a campaign promise, without acknowledging the complexity of political dynamics."
                },
                {
                    "text": "If not, it will be seen as evidence that partisan divisions defy Obama's ability to produce change, even during his so-called honeymoon period.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The assertion that the absence of consensus would be 'evidence that partisan divisions defy Obama's ability to produce change' is a subjective interpretation presented as a likely outcome, without acknowledging alternative perspectives."
                },
                {
                    "text": "In his inaugural address, he said, 'The old stale political arguments that have consumed us for so long no longer apply.'",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Quoting Obama's statement about 'old stale political arguments' without context could imply agreement with the characterization of previous political discourse, influencing the reader's perception of the current situation."
                },
                {
                    "text": "Commentators are watching for attempts by Republicans to block the legislation through a filibuster in the Senate. Any sustained attempt to do so would be read as defiance.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'defiance' to describe potential Republican actions introduces a negative connotation, suggesting that any opposition or procedural use of the filibuster would be unjustified resistance."
                },
                {
                    "text": "Obama also risks angering Democratic allies if they perceive he works harder to satisfy Republican demands for a bigger component of tax cuts in the bill than Democratic objections.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence implies a judgment about Obama's actions and priorities, suggesting that his efforts to accommodate Republican concerns over Democratic objections would be unfair or unbalanced, without presenting a neutral perspective."
                },
                {
                    "text": "Republican House Minority Leader John Boehner accused Democrats on Thursday of wanting to push the stimulus bill through without bothering to find common ground with Republicans.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'without bothering to find common ground' implies a dismissive attitude towards the Democrats' approach, suggesting a lack of effort or respect for bipartisan collaboration, which may not accurately reflect the complexities of the negotiation process."
                },
                {
                    "text": "Some Republicans also fear the bill, which Democratic leaders want passed by mid-February, is too big and is being pushed through too fast.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'pushed through too fast' introduces a subjective opinion about the speed of the legislative process, implying that the Democrats' timeline is unreasonable or indicative of a lack of thorough consideration, without acknowledging alternative reasons for the proposed timeline."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the discussion on the stimulus package, particularly in its portrayal of the potential outcomes for Obama and the political parties involved. The biases are primarily manifested through word choice, emotional sensationalism, and opinionated statements, influencing the reader's perception of the political dynamics and the significance of certain actions or outcomes."
            }
        },
        "Scores": {
            "average_bias_strength": 0.5999999999999999,
            "percentage_of_biased_sentences": 0.16,
            "overall_rating": 0.37999999999999995
        },
        "combined_score": 0.0
    },
    {
        "Title": "Obama tries to allay concerns over stimulus package",
        "URL": "Obama tries to allay concerns over stimulus package.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Caren Bohan and Jeremy Pelofsky      WASHINGTON, Jan 9 (Reuters) - President-elect Barack Obama,  said on Friday that the latest grim unemployment report added  urgency to the need to pass his $800 billion stimulus proposal,  even as his efforts ran into difficulties in the U.S.  Congress.      Obama's top aides visited Capitol Hill to allay lawmakers'  concerns about his proposal, which would combine tax cuts, aid  to states and public works projects. The measure is aimed at  lifting the economy out of a recession that has already lasted  a year.      'Our expectation is that we will continue to hone and  refine our package over the next several weeks,' Obama told a  news conference, noting that the effort to craft the stimulus  package would be a collaboration with Congress.      Several Senate Democrats have raised questions about  whether some of the tax cuts for individuals and businesses  would have the desired impact and have called for more energy  tax breaks.      New York Sen. Charles Schumer played down those  differences, saying there was an awareness that time was of the  essence in passing the bill.      'While it's certainly true that we in Congress will have  input, and we certainly provided some suggestions and comments  in that meeting yesterday, the urgency of this economic crisis  is going to limit any haggling over competing approaches,'  Schumer said.      The Labor Department reported earlier on Friday that U.S.  employers slashed more than half a million jobs from their  payrolls in December, pushing the unemployment rate to 7.2  percent from 6.8 percent in November.      It was the highest jobless rate in nearly 16 years and the  report said the ailing economy hemorrhaged 2.6 million jobs for  all of 2008, the most since 1945.           'STARK REMINDER'      Obama called the jobs report a 'stark reminder' that the  government needed to act. 'Clearly the situation is dire. It is  deteriorating and it demands urgent and immediate action,' he  said.      There is broad consensus among Democrats and Republicans  that bold steps are needed to address the economy's woes. Obama  is also benefiting from a reservoir of goodwill as he prepares  to take office on Jan. 20 with high public approval ratings.      Still, signs are emerging that his goal of securing package  of the measure by mid-February will prove challenging.      In addition to some of the questions about the structure of  the tax cuts, a report from the Congressional Budget Office has  added to nervousness about the impact of the stimulus on  already skyrocketing budget deficits.      The CBO this week forecast a $1.2 trillion deficit for this  year, even before factoring in the stimulus.      Clearly aware of the need to use the bully pulpit to press  for passage of the stimulus, Obama warned in a speech on  Thursday that the U.S. recession could linger for years in the  absence of aggressive steps to jump start growth.      After meeting with Larry Summers, the incoming director of  the White House National Economic Council, and other Obama  aides, congressional Democrats echoed Obama's descriptions of  the situation as one that required urgency.      House Speaker Nancy Pelosi said the stimulus plan would  help stem the kinds of job losses seen in the Labor  Department's report.      'We have to act very soon. We cannot wait until March. That  will be too late,' said Pelosi, a California Democrat.      House Majority Leader Steny Hoyer told repor",
        "Histogram": [
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0.6,
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0
        ],
        "Relevance": 17.35782814025879,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Obama's top aides visited Capitol Hill to allay lawmakers' concerns about his proposal, which would combine tax cuts, aid to states and public works projects. The measure is aimed at lifting the economy out of a recession that has already lasted a year.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the word 'allay' implies that lawmakers' concerns are unfounded or overly anxious, suggesting a judgment about the validity of their positions."
                },
                {
                    "text": "'Our expectation is that we will continue to hone and refine our package over the next several weeks,' Obama told a news conference, noting that the effort to craft the stimulus package would be a collaboration with Congress.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The choice of words 'hone and refine' implies that the package is already well-crafted and only needs minor adjustments, potentially downplaying the need for substantial changes."
                },
                {
                    "text": "Several Senate Democrats have raised questions about whether some of the tax cuts for individuals and businesses would have the desired impact and have called for more energy tax breaks.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence presents the concerns of Senate Democrats as subjective opinions rather than legitimate policy considerations, suggesting a dismissive attitude towards their viewpoints."
                },
                {
                    "text": "New York Sen. Charles Schumer played down those differences, saying there was an awareness that time was of the essence in passing the bill.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'played down' suggests that the concerns raised by the Senate Democrats are not significant or are being trivialized, indicating a judgment about the importance of the issues."
                },
                {
                    "text": "'While it's certainly true that we in Congress will have input, and we certainly provided some suggestions and comments in that meeting yesterday, the urgency of this economic crisis is going to limit any haggling over competing approaches,' Schumer said.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'haggling' to describe the deliberative process in Congress regarding the stimulus package implies that genuine policy discussions are merely petty negotiations, diminishing the seriousness of the legislative debate."
                },
                {
                    "text": "Obama called the jobs report a 'stark reminder' that the government needed to act. 'Clearly the situation is dire. It is deteriorating and it demands urgent and immediate action,' he said.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The language used, such as 'stark reminder', 'dire', 'deteriorating', and 'urgent and immediate action', is designed to evoke strong emotions, potentially overshadowing a more balanced discussion of the economic situation."
                },
                {
                    "text": "There is broad consensus among Democrats and Republicans that bold steps are needed to address the economy's woes. Obama is also benefiting from a reservoir of goodwill as he prepares to take office on Jan. 20 with high public approval ratings.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The assertion of 'broad consensus' and the mention of 'reservoir of goodwill' are subjective claims presented as objective facts, blurring the line between analysis and opinion."
                },
                {
                    "text": "Still, signs are emerging that his goal of securing package of the measure by mid-February will prove challenging.",
                    "bias_type": "Speculation Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence speculates on the future challenges without concrete evidence, suggesting a negative outcome without a balanced consideration of the factors involved."
                },
                {
                    "text": "Clearly aware of the need to use the bully pulpit to press for passage of the stimulus, Obama warned in a speech on Thursday that the U.S. recession could linger for years in the absence of aggressive steps to jump start growth.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'bully pulpit' and the warning about the recession lingering for years without aggressive steps use emotionally charged language to emphasize the urgency, potentially overshadowing a more nuanced discussion of economic policy."
                },
                {
                    "text": "House Speaker Nancy Pelosi said the stimulus plan would help stem the kinds of job losses seen in the Labor Department's report. 'We have to act very soon. We cannot wait until March. That will be too late,' said Pelosi, a California Democrat.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The urgency expressed by Pelosi, stating 'We have to act very soon. We cannot wait until March. That will be too late,' is a form of emotional sensationalism, designed to provoke a strong response without a full exploration of the complexities involved in the policy timeline."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the discussion of the stimulus package, particularly in the way it portrays the urgency and necessity of the proposed measures. The biases identified include Word Choice Bias, Opinionated Bias, Emotional Sensationalism Bias, and Speculation Bias, indicating a general tendency to use language and framing that may influence the reader's perception of the issue without presenting a fully balanced or evidence-based view."
            }
        },
        "Scores": {
            "average_bias_strength": 0.5999999999999999,
            "percentage_of_biased_sentences": 0.4166666666666667,
            "overall_rating": 0.5083333333333333
        },
        "combined_score": 0.0
    },
    {
        "Title": "Obama Stimulus Package Really Socialism_.txt",
        "URL": "Obama Stimulus Package Really Socialism_.txt.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Fox_News_Channel_logo.svg/240px-Fox_News_Channel_logo.svg.png",
        "Text": "Everyone else is talking about what's in the $825 billion stimulus package, but here's the one thing I want to know: How can we let the government get away with calling it a \"stimulus\" in the first place?\n\nLet's break down the numbers on this with the help of those non-partisan, radical hate-mongers over at the Congressional Budget Office.\n\nAccording to the CBO, only $26 billion — just over 3 percent — will be spent this year. Another $110 billion — or 13 percent — will be spent next year. Which means that by the time President Obama's term is halfway through, just 16 percent of the money will have been spent.\n\nI thought President Obama said this is supposed to be a quick \"jolt\" to the economy?\n\nThe president has also billed the stimulus as an investment in America's infrastructure. And if that were true, I'd be all for it. I mean, I-95 here on the East Coast isn't exactly the autobahn. Yet only 3 percent — just $30 billion — of this entire package is dedicated to road and highway spending.\n\nThen you have the promise about creating \"green jobs\" and clean energy.\n\nAgain, you want to seriously get wind and solar and nuclear power off the ground, I'm in. But this isn't serious. Only 2 percent of the money is earmarked for clean energy and only 1/7th of that will be spent over the next 2 years.\n\nThe CBO tells us that billions of dollars are going to buy new computers and replace government cars with new alternative fuel vehicles. In all, the money is going to 150 different federal programs — from Amtrak to the TSA — and it's not clear a single new job will be created.\n\nAmerica, let's call a spade a spade: This package isn't meant to stimulate the economy, it's meant to reshape it.\n\nIf President Obama, Nancy Pelosi and the rest of the progressives really believe that socialism is the best way out of this mess and the best way forward for America, then make the case. Let's debate it and allow the American people to decide.\n\nBut what they're doing now — using fear to promote long-term changes to the country — is exactly the kind of thing that has led to the biggest deficit of all: The deficit of trust we now have in our leaders.\n\nWhat do you think? Send your comments to: glennbeck@foxnews.com\n\n— Watch \"Glenn Beck\" weekdays at 5 p.m. ET on FOX News Channel",
        "Histogram": [
            0,
            1.0,
            0,
            0,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0.9,
            0.8,
            0.8,
            0,
            0,
            0,
            0
        ],
        "Relevance": 17.214271545410156,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Let's break down the numbers on this with the help of those non-partisan, radical hate-mongers over at the Congressional Budget Office.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 1.0,
                    "bias_description": "The use of 'radical hate-mongers' to describe the Congressional Budget Office is a clear example of Word Choice Bias, employing highly negative and charged language to discredit the organization."
                },
                {
                    "text": "I thought President Obama said this is supposed to be a quick 'jolt' to the economy?",
                    "bias_type": "Insinuative Questioning Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence uses insinuative questioning to imply that President Obama's statement about the stimulus being a quick 'jolt' to the economy was misleading or false, leading the reader towards a preconceived notion."
                },
                {
                    "text": "America, let's call a spade a spade: This package isn't meant to stimulate the economy, it's meant to reshape it.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "The assertion that the package is not meant to stimulate the economy but to reshape it is a subjective opinion presented as fact, blurring the line between objective reporting and personal perspective."
                },
                {
                    "text": "If President Obama, Nancy Pelosi and the rest of the progressives really believe that socialism is the best way out of this mess and the best way forward for America, then make the case. Let's debate it and allow the American people to decide.",
                    "bias_type": "Projection Bias",
                    "bias_strength": 0.8,
                    "bias_description": "This sentence attributes the belief in socialism as the best solution to the crisis to President Obama, Nancy Pelosi, and progressives without direct evidence, projecting this viewpoint onto them."
                }
            ],
            "overall_bias": {
                "conclusion": "The article is biased regarding the discussion of the stimulus package, showing a general bias tendency through the use of Word Choice Bias, Insinuative Questioning Bias, Opinionated Bias, and Projection Bias to discredit the package and its proponents."
            }
        },
        "Scores": {
            "average_bias_strength": 0.825,
            "percentage_of_biased_sentences": 0.08695652173913043,
            "overall_rating": 0.45597826086956517
        },
        "combined_score": 0.0
    },
    {
        "Title": "REFILE-WRAPUP 2-Obama meets with Republican on stimulus package",
        "URL": "REFILE-WRAPUP 2-Obama meets with Republican on stimulus package.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": " (Fixes typos, 6th and 16 paragraphs)      By Caren Bohan and Thomas Ferraro      WASHINGTON, Jan 27 (Reuters) - President Barack Obama urged  skeptical Republicans to back his $825 billion economic  stimulus package on Tuesday during a visit to the U.S. Congress  on Capitol Hill.      Shortly before Obama arrived, House Minority Leader John  Boehner told fellow Republicans that in its current form, he  could not vote for the stimulus and encouraged fellow House  Republicans to vote against it, a Boehner spokesman said.      Obama conferred first with Republican members of the House  of Representatives and then was to go to the other side of the  Capitol to talk to Senate Republicans.      Republicans agree that the stumbling economy needs a rescue  package. But they complain the Democratic $550 billion spending  proposal is excessive while their proposal to cut taxes by  about $275 billion does not go far enough.      'We're anxious to help him. We think the country needs a  stimulus,' Senate Republican Leader Mitch McConnell said  earlier on Tuesday on NBC's 'Today Show.'      A week after taking office, Obama faces an economic crisis  that seems to worsen by the day. U.S. consumer confidence  slipped to a record low and major U.S. companies are cutting  tens of thousands of jobs as financial industry troubles  continue to mount.  [ID:nT114397]      Obama's meeting with the Republican lawmakers comes the day  after Treasury Secretary Timothy Geithner won Senate  confirmation and was sworn in.  [ID:nN26616671]      The Democratic-led House and Senate are expected to approve  the package by the middle of next month regardless of how many  Republicans embrace it.      McConnell said he believes Congress can hit the Democrats'  deadline of passing a rescue measure by mid-February. He said  Obama may have more difficulty with Democrats than Republicans  in getting a balanced package.      With the House set to vote on its version of the plan this  week, a co-chair of the coalition of fiscally conservative  Democrats said his 50-member group had concerns.  [ID:nN27437028]      Representative Charlie Melancon of Louisiana said his  colleagues want Obama to promise that the record federal  deficit is not further bloated by tax cuts or by increases in  mandatory government spending programs, like the Social  Security retirement program and Medicare health care program  for the elderly.      'The majority of us want to support the president and do a  stimulus package,' Melancon said. 'But we also have come to the  realization that every day that we don't get a commitment to  reel in this spending that we've been doing without paying for  it is a day ... that the problem gets worse.'           'WANTS TO HEAR THEIR IDEAS'      White House spokesman Robert Gibbs said Obama wants to  listen to Republicans as part of his vow to seek consensus and  end traditional partisan gridlock.      'He wants to hear their ideas. If there are good ideas --  and I think he assumes there will be -- that we will look at  those ideas,' Gibbs told reporters on Monday.      Obama's aides have said three-quarters of the proposed new  spending, on health care, education and building new roads and  bridges, would work its way into the economy within 18 months.      A report by the nonpartisan Congressional Budget Office  said it would take a bit longer. CBO estimated that about 64  percent of the stimulus package would reach the economy within  19 months. [ID:nN26508666]",
        "Histogram": [
            0,
            0.6,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0.5,
            0.5,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 17.191970825195312,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Shortly before Obama arrived, House Minority Leader John Boehner told fellow Republicans that in its current form, he could not vote for the stimulus and encouraged fellow House Republicans to vote against it, a Boehner spokesman said.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the word 'encouraged' implies a judgment about Boehner's actions, suggesting a negative connotation towards his stance on the stimulus package."
                },
                {
                    "text": "Republicans agree that the stumbling economy needs a rescue package. But they complain the Democratic $550 billion spending proposal is excessive while their proposal to cut taxes by about $275 billion does not go far enough.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The word 'complain' implies a dismissive attitude towards the concerns raised by Republicans, suggesting a judgment about the validity of their critique on the size and composition of the stimulus package."
                },
                {
                    "text": "McConnell said he believes Congress can hit the Democrats' deadline of passing a rescue measure by mid-February. He said Obama may have more difficulty with Democrats than Republicans in getting a balanced package.",
                    "bias_type": "Political Bias",
                    "bias_strength": 0.5,
                    "bias_description": "This sentence implies that Democrats are more resistant to a 'balanced package' than Republicans, suggesting a favorable comparison of Republicans' willingness to cooperate, which could be seen as a political bias."
                },
                {
                    "text": "With the House set to vote on its version of the plan this week, a co-chair of the coalition of fiscally conservative Democrats said his 50-member group had concerns.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'concerns' suggests a measured and reasonable response, potentially downplaying any significant opposition within the Democratic coalition, which could be a form of word choice bias."
                },
                {
                    "text": "Representative Charlie Melancon of Louisiana said his colleagues want Obama to promise that the record federal deficit is not further bloated by tax cuts or by increases in mandatory government spending programs, like the Social Security retirement program and Medicare health care program for the elderly.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'not further bloated' carries a negative connotation towards the impact of tax cuts or increased spending on the federal deficit, suggesting a bias against these measures without a neutral presentation of the arguments."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the discussion on the economic stimulus package, particularly in the portrayal of Republican objections and concerns, the comparison of Democrats and Republicans' willingness to cooperate, and the framing of the impact of fiscal measures on the federal deficit. The general bias tendency leans towards a perspective that may favor certain aspects of the stimulus package over others, particularly in the language used to describe objections and the potential effects of the proposed measures."
            }
        },
        "Scores": {
            "average_bias_strength": 0.58,
            "percentage_of_biased_sentences": 0.125,
            "overall_rating": 0.3525
        },
        "combined_score": 0.0
    },
    {
        "Title": "Obama to push for stimulus package on Capitol Hill",
        "URL": "Obama to push for stimulus package on Capitol Hill.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Caren Bohan      WASHINGTON, Jan 27 (Reuters) - U.S. President Barack Obama  will visit Capitol Hill on Tuesday to try to build momentum for  an $825 billion package he says is urgently needed to keep the  U.S. economy from sinking into an even deeper recession.      A week after taking office, Obama is grappling with an  economic crisis that seems to worsen by the day. U.S. companies  such as the heavy-equipment maker Caterpillar Inc. are  announcing huge layoffs as troubles in the housing and  financial sectors mount.      But Obama's meeting with lawmakers comes after the  president achieved one victory on the economic front: the  confirmation of Treasury Secretary Timothy Geithner.      With his economic team in place, Obama hopes he can win  passage of the stimulus plan by mid-February.      The Capitol Hill meeting is somewhat unusual. Obama's  predecessor, former President George W. Bush rarely visited  Congress, preferring to send aides and sometimes his vice  president, Dick Cheney.      White House spokesman Robert Gibbs said Obama's meetings  with House of Representatives and Senate lawmakers would be  less negotiating sessions than a chance to gather input.      'He wants to hear their ideas. If there are good ideas --  and I think he assumes there will be -- that we will look at  those ideas,' Gibbs told reporters.      The House may begin debate on the stimulus bill on Tuesday,  though any votes would not take place until Wednesday.      While there is broad support in the Democratic-led U.S.  Congress for bold measures to jump-start the economy,  Republicans and some moderate Democrats are worried about the  measure's huge price tag at a time when U.S. budget deficits  are already projected to stretch into the trillions.           REPUBLICANS QUESTION CONTRACEPTIVE, TUITION SPENDING      Some $275 billion of the package would go toward tax cuts.  The other $550 billion would pay for public works projects,  alternative energy initiatives and the bolstering of  unemployment benefits and other safety-net programs.      Obama hopes to win bipartisan support for the plan, but  some Republicans disagree with Obama on how the tax cuts should  be structured and have questioned whether some spending  elements in the plan, including money for contraceptive  programs and college tuition assistance, would provide any kind  of short-term jolt to the economy.      Responding to criticism that the package contained too  little immediate help, Obama's aides have said three-quarters  of the spending would work its way into the economy within the  first 18 months.      According to a report issued late on Monday by the  nonpartisan Congressional Budget Office, about 64 percent of  the stimulus package would be poured into the economy within 19  months.      Obama has sought to emphasize that he wants to listen to  Republican and Democratic ideas.      The Democratic tax cut plan would direct benefits more  toward lower-income workers, even those who do not pay income  taxes, while the House Republicans would help all taxpayers.      When some Republicans pressed Obama on Friday to change  that part of the plan, he replied that he won the election and  was sticking to the plan he had campaigned on.      Gibbs said the comment was meant to be light-hearted and  was not an attempt to pursue 'cowboy diplomacy' in the  negotiations.      In addition to the stimulus package, another issue that  could come up at the Capitol Hill meeting is",
        "Histogram": [
            0,
            0.6,
            0.6,
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0.5,
            0,
            0,
            0.7,
            0,
            0,
            0,
            0,
            0.6,
            0,
            0
        ],
        "Relevance": 17.178022384643555,
        "BiasReport": {
            "sentences": [
                {
                    "text": "A week after taking office, Obama is grappling with an economic crisis that seems to worsen by the day. U.S. companies such as the heavy-equipment maker Caterpillar Inc. are announcing huge layoffs as troubles in the housing and financial sectors mount.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The sentence uses dramatic language ('economic crisis that seems to worsen by the day', 'announcing huge layoffs') to evoke strong emotions, potentially overshadowing a more balanced or nuanced view of the economic situation."
                },
                {
                    "text": "The Capitol Hill meeting is somewhat unusual. Obama's predecessor, former President George W. Bush rarely visited Congress, preferring to send aides and sometimes his vice president, Dick Cheney.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'somewhat unusual' and the comparison to George W. Bush's approach implies a judgment about the two presidents' styles of engagement with Congress, suggesting Obama's approach is more proactive or engaged."
                },
                {
                    "text": "While there is broad support in the Democratic-led U.S. Congress for bold measures to jump-start the economy, Republicans and some moderate Democrats are worried about the measure's huge price tag at a time when U.S. budget deficits are already projected to stretch into the trillions.",
                    "bias_type": "Political Bias",
                    "bias_strength": 0.5,
                    "bias_description": "This sentence implies that concerns about the stimulus package's cost are primarily from Republicans and some moderate Democrats, framing the issue as a partisan disagreement rather than a broader fiscal policy concern."
                },
                {
                    "text": "some Republicans disagree with Obama on how the tax cuts should be structured and have questioned whether some spending elements in the plan, including money for contraceptive programs and college tuition assistance, would provide any kind of short-term jolt to the economy.",
                    "bias_type": "Causal Misunderstanding Bias",
                    "bias_strength": 0.7,
                    "bias_description": "The inclusion of skepticism towards spending on contraceptive programs and college tuition assistance as providing short-term economic benefits suggests a narrow view of economic stimulus, overlooking potential indirect effects on consumer spending and workforce participation."
                },
                {
                    "text": "When some Republicans pressed Obama on Friday to change that part of the plan, he replied that he won the election and was sticking to the plan he had campaigned on.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The framing of the interaction between Republicans and Obama, particularly the choice of 'pressed' and the direct quote, emphasizes a confrontational narrative, suggesting a lack of compromise or openness to discussion."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the discussion of Obama's stimulus package, with instances of Emotional Sensationalism, Word Choice, Political Bias, and Causal Misunderstanding, indicating a general bias tendency towards portraying the stimulus package and its proponents in a more dramatic or confrontational light."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.13636363636363635,
            "overall_rating": 0.36818181818181817
        },
        "combined_score": 0.0
    },
    {
        "Title": "RPT-Obama tries to allay concerns over stimulus package",
        "URL": "RPT-Obama tries to allay concerns over stimulus package.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Caren Bohan and Jeremy Pelofsky      WASHINGTON, Jan 9 (Reuters) - President-elect Barack Obama  said on Friday that the latest grim unemployment report added  urgency to the need to pass his $800 billion stimulus proposal,  even as his efforts ran into difficulties in the U.S.  Congress.      Obama's top aides visited Capitol Hill to allay lawmakers'  concerns about his proposal, which would combine tax cuts, aid  to states and public works projects. The measure is aimed at  lifting the economy out of a recession that has already lasted  a year.      'Our expectation is that we will continue to hone and  refine our package over the next several weeks,' Obama told a  news conference, noting that the effort to craft the stimulus  package would be a collaboration with Congress.      Several Senate Democrats have raised questions about  whether some of the tax cuts for individuals and businesses  would have the desired impact and have called for more energy  tax breaks.      New York Sen. Charles Schumer played down those  differences, saying there was an awareness that time was of the  essence in passing the bill.      'While it's certainly true that we in Congress will have  input, and we certainly provided some suggestions and comments  in that meeting yesterday, the urgency of this economic crisis  is going to limit any haggling over competing approaches,'  Schumer said.      The Labor Department reported earlier on Friday that U.S.  employers slashed more than half a million jobs from their  payrolls in December, pushing the unemployment rate to 7.2  percent from 6.8 percent in November.      It was the highest jobless rate in nearly 16 years and the  report said the ailing economy hemorrhaged 2.6 million jobs for  all of 2008, the most since 1945.           'STARK REMINDER'      Obama called the jobs report a 'stark reminder' that the  government needed to act. 'Clearly the situation is dire. It is  deteriorating and it demands urgent and immediate action,' he  said.      There is broad consensus among Democrats and Republicans  that bold steps are needed to address the economy's woes. Obama  is also benefiting from a reservoir of goodwill as he prepares  to take office on Jan. 20 with high public approval ratings.      Still, signs are emerging that his goal of securing package  of the measure by mid-February will prove challenging.      In addition to some of the questions about the structure of  the tax cuts, a report from the Congressional Budget Office has  added to nervousness about the impact of the stimulus on  already skyrocketing budget deficits.      The CBO this week forecast a $1.2 trillion deficit for this  year, even before factoring in the stimulus.      Clearly aware of the need to use the bully pulpit to press  for passage of the stimulus, Obama warned in a speech on  Thursday that the U.S. recession could linger for years in the  absence of aggressive steps to jump start growth.      After meeting with Larry Summers, the incoming director of  the White House National Economic Council, and other Obama  aides, congressional Democrats echoed Obama's descriptions of  the situation as one that required urgency.      House Speaker Nancy Pelosi said the stimulus plan would  help stem the kinds of job losses seen in the Labor  Department's report.      'We have to act very soon. We cannot wait until March. That  will be too late,' said Pelosi, a California Democrat.      House Majority Leader Steny Hoyer told report",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 16.950605392456055,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides a factual overview of President-elect Barack Obama's efforts to pass an $800 billion stimulus proposal and the concerns and discussions surrounding it in the U.S. Congress."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "WRAPUP 2-Obama expects to have stimulus package by Feb. 16",
        "URL": "WRAPUP 2-Obama expects to have stimulus package by Feb. 16.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    * Bad economic news adds sense of urgency      * Republicans want greater say, add tax cut proposals       (Updates after meeting)      By Ross Colvin and Matt Spetalnick      WASHINGTON, Jan 23 (Reuters) - U.S. President Barack Obama  said on Friday he expected an $825 billion stimulus package for  the ailing U.S. economy to be approved by his target of  mid-February and personally urged congressional leaders to work  swiftly to pass it.      'We are experiencing an unprecedented economic crisis that  has to be dealt with and dealt with rapidly,' Obama told  reporters as he met with the lawmakers at the White House.      With new figures showing the U.S. economy sinking deeper  into recession, Obama is anxious to create bipartisan approach  to jolting the economy out of its worst crisis since the Great  Depression nearly 80 years ago.      Republicans, who have voiced concern over the shape of the  package and accuse Obama's majority Democrats of failing to  take their views into account, left the meeting saying they had  given Obama ideas of their own on new tax cuts.      Winning Republican support for the package will be an early  test of Obama's promise to forge consensus and overcome the  partisan politics that bitterly divided Washington under his  Republican predecessor George W. Bush.      'I recognize that there are still some difference around  the table and between the administration and members of  Congress about particular details on the plan,' Obama said.      But he added, 'It appears that we are on target to make our  Presidents Day weekend (goal for the stimulus plan).'      House of Representatives Speaker Nancy Pelosi said she too  believed Congress was on track to have a bill to be signed by  the president before the Presidents Day holiday on Feb. 16.  'Again, if not, there will be no recess,' Pelosi, a California  Democrat, told reporters after the meeting.           REPUBLICAN TAX PROPOSALS      Asked whether he was worried that Republicans would block  the stimulus package, Democratic Senate Majority Leader Harry  Reid said 'No.'      Senate Republican leader Mitch McConnell and House  Republican leader John Boehner also attended the meeting. They  said their proposals included tax cuts for workers and new tax  deductions for small businesses.      Republicans are upset at how the Obama administration plans  to spend the stimulus money, saying the $550 billion in  government spending would add too much to the deficit and that  the $275 billion earmarked for tax cuts is too little.      Obama says his plan aims to create or save 3 to 4 million  jobs in the U.S economy, which has been in a yearlong recession  since the collapse of the housing market sparked a global panic  over bank losses that in turn froze credit markets.      Wall Street was scrutinizing the outcome of the meeting   for signs that the stimulus package will be passed soon.      Worries over potential delays have helped push stocks  lower. Major U.S. indexes were down amid worries over corporate  profits and concerns that the global economic slowdown shows no  signs of ending.      The new president has said that rescuing the U.S. economy  is his No. 1 priority, and analysts say that, for now, his  first term was likely to be judged on his ability to restore  economic and financial stability.           DAILY ECONOMIC BRIEFING      In a change from Bush, Obama has added an economic   briefing to his daily schedule so that he can get the latest ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 16.798059463500977,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it primarily focuses on reporting the discussions and developments regarding the approval of the stimulus package for the U.S. economy without displaying any evident bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "WRAPUP 1-Obama to meet with Republicans on stimulus package",
        "URL": "WRAPUP 1-Obama to meet with Republicans on stimulus package.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": " (Incorporates OBAMA-ECONOMY/)      By Caren Bohan      WASHINGTON, Jan 27 (Reuters) - U.S. President Barack Obama  will visit Congress on Tuesday to try to persuade reluctant  Republicans to support a $825 billion package he says is  essential to resuscitate a plunging economy.      A week after taking office, Obama faces an economic crisis  that seems to worsen by the day. Major U.S. companies cut tens  of thousands of jobs on Monday and housing and financial  industry troubles continue to mount.   [ID:nT114397]      Obama's meeting with the Republican lawmakers comes after  Treasury Secretary Timothy Geithner won Senate confirmation,  although 34 although Senators voted against him.   [ID:nN26616671]      With his economic team in place, Obama hopes he can win  passage of the stimulus plan by mid-February.      Although the Democratic president does not need broad  Republican support, the minority party could put up procedural  hurdles to slow the plan's progress.      White House spokesman Robert Gibbs said Obama's meetings  with House of Representatives and Senate Republicans would be  less a negotiating session than a chance to gather input.      'He wants to hear their ideas. If there are good ideas, and  I think he assumes there will be, that we will look at those  ideas,' Gibbs told reporters.      The House and Senate are expected to approve the package by  the middle of next month regardless of how many Republicans  embrace it.      While there is strong support in the Democratic-led   Congress for bold measures to jump-start the economy,  Republicans differ with Obama on how the tax cuts should be  structured and have criticized his spending proposals at a time  of high budget deficits.      U.S. stocks opened higher on Tuesday, buoyed partly on  hopes for swift action by Geithner, the former head of the New  York Federal Reserve.  [ID:nLR704192]        REPUBLICAN QUESTIONS      Some $275 billion of the package would go toward tax cuts.  The other $550 billion would pay for public works projects,  alternative energy initiatives and would bolster unemployment  benefits and other safety-net programs.   [ID:nN27437028]      Republicans have seized on some spending items, including  money for contraceptive programs and college tuition assistance  which they say would not further create jobs in the near term.      Senate Minority Leader Mitch McConnell, speaking on NBC's  Today show, agreed it was important to throw the economy a  lifeline but said Democrats had tilted the package toward  excessive spending.      'We're anxious to help him. We think the country needs a  stimulus,' said McConnell, a Kentucky Republican.      'Listening to what he wanted we think we may be closer to  that, oddly enough, than the Democratic majority, which seems  to be pulling in the direction of less tax relief and things  like fixing up the (National) Mall.'      Obama's aides have said three-quarters of the spending  would work its way into the economy within 18 months.      According to a report issued late on Monday by the  Congressional Budget Office, about 64 percent of the stimulus  package would be poured into the economy within 19 months.      The Democratic tax cut plan would direct benefits more  toward lower-income workers, even non-income tax payers, while  the House Republicans would help all taxpayers.      When some Republicans pressed Obama on Friday to change  that part of the plan, he replied that he won the election and  was sti",
        "Histogram": [
            0,
            0.6,
            0.6,
            0,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0.5,
            0,
            0,
            0,
            0.6,
            0.6,
            0.5,
            0.5,
            0.6,
            0,
            0,
            0,
            0
        ],
        "Relevance": 16.36513900756836,
        "BiasReport": {
            "sentences": [
                {
                    "text": "A week after taking office, Obama faces an economic crisis that seems to worsen by the day. Major U.S. companies cut tens of thousands of jobs on Monday and housing and financial industry troubles continue to mount. [ID:nT114397]",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The sentence uses dramatic language to evoke a sense of urgency and crisis, focusing on negative events without providing a broader context."
                },
                {
                    "text": "Although the Democratic president does not need broad Republican support, the minority party could put up procedural hurdles to slow the plan's progress.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the word 'hurdles' implies a negative and obstructive stance by the Republican party, suggesting judgment and bias."
                },
                {
                    "text": "While there is strong support in the Democratic-led Congress for bold measures to jump-start the economy, Republicans differ with Obama on how the tax cuts should be structured and have criticized his spending proposals at a time of high budget deficits.",
                    "bias_type": "Political Bias",
                    "bias_strength": 0.5,
                    "bias_description": "This sentence implies that the Democratic measures are 'bold' and implies a positive connotation, while framing Republican opposition as mere disagreement, suggesting a bias towards the Democratic viewpoint."
                },
                {
                    "text": "Republicans have seized on some spending items, including money for contraceptive programs and college tuition assistance which they say would not further create jobs in the near term.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the word 'seized' suggests a negative and opportunistic framing of the Republican's opposition, implying a biased perspective on their concerns."
                },
                {
                    "text": "Senate Minority Leader Mitch McConnell, speaking on NBC's Today show, agreed it was important to throw the economy a lifeline but said Democrats had tilted the package toward excessive spending.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'tilted' and 'excessive spending' from the perspective of McConnell introduces a judgmental tone, suggesting bias in the portrayal of the Democrats' approach."
                },
                {
                    "text": "'We're anxious to help him. We think the country needs a stimulus,' said McConnell, a Kentucky Republican.",
                    "bias_type": "Political Bias",
                    "bias_strength": 0.5,
                    "bias_description": "This quote presents the Republican stance in a positive light, suggesting willingness to cooperate for the country's benefit, which contrasts with the earlier implication of obstructionism, indicating a bias in how the two parties' positions are presented."
                },
                {
                    "text": "Listening to what he wanted we think we may be closer to that, oddly enough, than the Democratic majority, which seems to be pulling in the direction of less tax relief and things like fixing up the (National) Mall.'",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'oddly enough' and the dismissive tone towards Democratic priorities introduce bias by suggesting that the Democratic majority's focus is misplaced or frivolous compared to the Republican approach."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the discussion on the stimulus package, with a general tendency to use emotionally charged language, politically biased word choices, and a framing that favors the Democratic perspective over the Republican opposition."
            }
        },
        "Scores": {
            "average_bias_strength": 0.5714285714285714,
            "percentage_of_biased_sentences": 0.2608695652173913,
            "overall_rating": 0.4161490683229814
        },
        "combined_score": 0.0
    },
    {
        "Title": "FINEWS-Obama wants economic stimulus passed quickly",
        "URL": "FINEWS-Obama wants economic stimulus passed quickly.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    U.S. President-elect Barack Obama said he wanted Congress  to pass another stimulus package as soon as possible to  stabilize the U.S. economy. 'We are going to need to see a  stimulus package passed either before or after the inauguration  (on Jan. 20, 2009). I want to see a stimulus package sooner  rather than later,' Obama told a news conference in Chicago  after meeting his economic advisers.      Reuters e-mail: chris.reese@thomsonreuters.com  ",
        "Histogram": [
            0,
            0,
            0,
            0
        ],
        "Relevance": 16.234169006347656,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it simply reports a statement made by U.S. President-elect Barack Obama regarding the passage of an economic stimulus package."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "REFILE-FACTBOX-Obama expected to offer stimulus package",
        "URL": "REFILE-FACTBOX-Obama expected to offer stimulus package.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": " (Refiling with updated headline)      Nov 5 (Reuters) - U.S. president-elect Barack Obama, hoping  to boost a struggling economy, has proposed a stimulus package  that some experts estimate could cost as much as $190 billion.      At the same time, the United States is facing record budget  deficits of at least $500 billion. Some analysts say the  deficit could go as high as $1 trillion next year.           Obama has said he would:      --Enact a windfall profits tax on oil companies to give  taxpayers an energy rebate.      --Give businesses a $3,000 refundable tax credit for each  new full-time employee hired in the United States over the next  two years.      --Allow small business to immediately write off up to  $250,000 in spending for new equipment and property through the  end of 2009. The stimulus package enacted earlier this year  provided for the $250,000 investment expensing limit only  through the end of this year.     --Eliminate capital gains taxes on investments in small  businesses.     --Make $25 billion immediately available for the  construction and repair of roads, bridges, schools and other  infrastructure.      --Provide $25 billion to states to help them cope with the  economic downturn without having to raise property taxes or cut  vital services.      --Make $50 billion in loan guarantees available and keep  other options open to help U.S. automobile manufacturers retool  and develop a new generation of fuel-efficient cars. Congress  has made $25 billion available.     --Implement a 90-day foreclosure moratorium for homeowners  making good faith efforts to pay their mortgage debt.     --Extend unemployment insurance for long-term jobless  workers who have exhausted their benefits, and temporarily  suspend taxes on those benefits.     --Temporarily allow penalty-free withdrawals of 15 percent  from tax-preferred retirement accounts up to $10,000.     --Suspend rules requiring retirees to begin withdrawing from  retirement accounts six months after they reach the age of 70.     --Increase home heating cost aid.     --Instruct the secretaries of the Treasury and Housing and  Urban Development to use their existing authority to more  aggressively modify the terms of mortgages.     --Reform the bankruptcy code to assist homeowners and remove  legal impediments to encouraging more mortgage restructuring.     --In the longer term, Obama would roll back some of Bush's  tax cuts for the wealthy. He proposed a permanent tax cut of  $500 for most individual workers and $1,000 for families. He  also would eliminate taxes for seniors making up to $50,000.      --To help jump-start the economy, the tax cuts would be  expedited through refunds based on 2007 tax returns. He would  also provide a 10 percent refundable tax credit for mortgage  interest to taxpayers who do not itemize their returns.     --On trade, Obama has promised to review the North American  Free Trade Agreement and use trade agreements to advance good  labor and environmental standards around the world. He has also  promised to end tax breaks that encourage companies to shift  U.S. jobs overseas.    (Reporting by Donna Smith; Editing by David Alexander and  Eric Walsh)    ((For full campaign coverage double click on [US/VOTE]))  Keywords: USA ELECTION/STIMULUS        ",
        "Histogram": [
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 16.196365356445312,
        "BiasReport": {
            "sentences": [
                {
                    "text": "At the same time, the United States is facing record budget  deficits of at least $500 billion. Some analysts say the  deficit could go as high as $1 trillion next year.",
                    "bias_type": "Speculation Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The sentence speculates on the future deficit without concrete evidence, potentially leading readers to an exaggerated understanding of the situation."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits a mild form of bias regarding the speculation on future budget deficits, which could influence readers' perceptions of the economic situation."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.07407407407407407,
            "overall_rating": 0.337037037037037
        },
        "combined_score": 0.0
    },
    {
        "Title": "Pelosi sees stimulus package by mid-Feb deadline",
        "URL": "Pelosi sees stimulus package by mid-Feb deadline.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    WASHINGTON, Jan 23 (Reuters) - U.S. House  of  Representatives Speaker Nancy Pelosi said on Friday she  believed Congress would meet a mid-February deadline to send an  economic stimulus package to President Barack Obama.      'We're on schedule for our timetable to have a bill on the  president's desk to be signed before the Presidents Day recess.  Again, if not, there will be no recess,' Pelosi, a California  Democrat, told reporters after a meeting between Obama and  congressional leaders from both parties.      The U.S. Presidents Day holiday is Feb. 16.      Asked whether he was worried that Republicans would block  the stimulus package, Democratic Senate Majority Leader Harry  Reid said 'No.'   ((Reuters Messaging: matt.spetalnick.reuters.com@reuters.net;  +1 202 898 8300))  Keywords: OBAMA/STIMULUS DEMOCRATS        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 16.177003860473633,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it primarily reports on statements made by political figures regarding the timeline for the economic stimulus package without introducing subjective or misleading information."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "TAKE A LOOK-US TRANSITION: Obama pushes stimulus package",
        "URL": "TAKE A LOOK-US TRANSITION: Obama pushes stimulus package.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "     Jan 9 (Reuters) - President-elect Barack Obama,  said on Friday that the latest grim unemployment report added  urgency to the need to pass his $800 billion stimulus proposal,  even as his efforts ran into difficulties in the U.S. Congress.      Obama's top aides visited Capitol Hill to allay lawmakers'  concerns about his proposal, which would combine tax cuts, aid to  states and public works projects. The measure is aimed at lifting  the economy out of a recession that has already lasted a year.         TOP STORIES  > Obama tries to allay concerns over stimulus bill[ID:nN09308003]  > Obama working on overhaul of financial rescue   [ID:nN09277196]  > Obama names Panetta, Blair to top spy posts     [ID:nN09293896]  > Jobs report shows urgent need for stimulus-Obama[ID:nN09296071]  > Obama labor pick vows to help combat recession  [ID:nN09304809]  > Obama gives outspoken ex-CIA chief W.House job  [ID:nN09307840]  > Obama pushes stimulus, warns on recession       [ID:nN08508944]  > Obama to meet Mexico's Calderon on Monday         [ID:nN082124]  > Daschle vows aggressive reform as health leader [ID:nN08540915]  > Obama, Bush dine with ex-presidents             [ID:nN07489375]  > US budget deficit to hit $1.2 trillion in FY2009[ID:nN07266602]  > Paulson: Obama will decide on rescue spending   [ID:nN07490222]  > New US Congress convenes, focused on recession  [ID:nN06417731]  > Top House Democrat sees stimulus passed in Feb. [ID:nN04341614]  > U.S. Senate Democrats move to seat Burris       [ID:nN07495185]      APPOINTMENTS  > Obama names Virginia gov. Democratic Party head [ID:nN08547366]  > Obama names law professor as regulatory czar    [ID:nN08533375]  > Obama names ex-Clinton officials for Pentagon   [ID:nWAT010750]  > Obama announces 'chief performance officer'     [ID:nWAT010731]  > Clinton Senate confirmation set for Jan. 13     [ID:nWAT010737]  > Smooth approval seen for healthcare nominee     [ID:nN07493526]  > Obama picks ex-Clinton aide Panetta for CIA     [ID:nN05388968]  > FACTBOX-Obama adds to Cabinet with CIA choice   [ID:nN05391331]  > Obama offers CNN's Gupta US surgeon general post[ID:nN06434936]  > FACTBOX-Richardson withdraws as Commerce Sec    [ID:nN04345843]  > FACTBOX-Senate sets hearings on Obama Cabinet   [ID:nN02350267]  > Senate panel to weigh Obama budget picks Jan. 13[ID:nN06449399]       ANALYSES AND ISSUES  > Tough times dim Wall Street's honeymoon with Obama [ID:nN08662]  > Obama's green energy plans build hopes, skeptics[ID:nN08121916]  > Obama proposes Fed to support muni market       [ID:nN08547776]  > FACTBOX-Details of possible U.S stimulus bill   [ID:nN08541017]  > FACTBOX-Which stimulus provides best return?    [ID:nN08528038]  > FACTBOX-Daschle to promote U.S. healthcare plan [ID:nN08537799]  > FACTBOX-Top goals of Obama in Congress          [ID:nN05400338]  > FACTBOX-Democrats will need Republican help     [ID:nN29277518]  > Congress faces historic challenges              [ID:nN03350685]  > ANALYSIS-Politics behind Obama's Gaza silence   [ID:nN04327314]  > UN looks for better times when Obama takes over [ID:nN29456600]  > Obama faces big challenges in Afghanistan       [ID:nN12275106]  > FACTBOX-Number-crunching Obama's inauguration   [ID:nN16272196]  > Obama sees financial reg plan by April-CNBC       [ID:nWEN2328]  > Obama backs extending digital TV cutoff date    [ID:nN08282983]     ((Compiled by World Desk, Americas; +1 202 898 8457))   ((For more about the U.S. political scene please visit",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 15.976066589355469,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to contain biased sentences. It primarily focuses on reporting President-elect Barack Obama's efforts to push his stimulus package and other related political developments without exhibiting a clear bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "TAKE A LOOK-OBAMA PRESIDENCY: Obama makes case for stimulus",
        "URL": "TAKE A LOOK-OBAMA PRESIDENCY: Obama makes case for stimulus.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    President Barack Obama took his case for a massive economic  stimulus package directly to the recession-weary American people  on Monday as he urged Congress to move swiftly on a final bill  before the crisis worsens.      Holding his first news conference since taking office, Obama  pressed lawmakers to 'act without delay in the coming week' to  resolve differences over an $800 billion-plus economic rescue plan  expected to help define his young presidency.    TOP STORIES  > Obama pitches economic plan to Americans        [ID:nN08349993]  > U.S. Treasury delays bank bailout announcement  [ID:nN08495108]  > U.S. linking bank aid to loan changes - sources [ID:nN07460053]  > US commanders favor slower Iraq pullout         [ID:nN07488724]  > Stimulus should have more education money-Obama [ID:nN09529679]         THE ECONOMY AND STIMULUS PLAN  > US recovery package clears key Senate hurdle    [ID:nN09513209]  > Obama's menu for financial stability            [ID:nN06446621]  > Houses of US Congress weigh stimulus bill       [ID:nN09525238]  > How Obama plan ranks against New Deal           [ID:nN09475586]  > Where has the U.S. bailout money gone?          [ID:nN07486213]       SECURITY AND FOREIGN POLICY  > Obama orders 60-day cybersecurity review        [ID:nN09544859]  > Biden vows break with Bush era foreign policy    [ID:nL7376501]  > Russia signals new optimism on ties with U.S.    [ID:nL8170753]  > Clinton to discuss markets turmoil on Asia trip [ID:nN05373873]       ANALYSIS AND ISSUES  > Obama, Pelosi in showdown on US stimulus bill   [ID:nN09543088]  > Obama: Renewable energy key to economic future  [Id:nN09291440]  > Obama's promised US healthcare overhaul delayed [ID:nN04296955]      SIDEBARS  > Obama grassroots network meets over stimulus    [ID:nN07326667]  > Working moms look to Michelle Obama for change  [ID:nN06442586]      NOMINEES  > Obama may get Supreme Court pick soon           [ID:nN05378872]  > Obama Cabinet still not finalized               [ID:nN21494602]  > Obama names economic advisory panel             [ID:nN06539926]  > Possible candidates for health secretary        [ID:nN03526718]      (Compiled by World Desk, Americas; +1 202 898 8457)    ((For more about the U.S. political scene please visit Reuters  'Front Row Washington' online at  http://blogs.reuters.com/trail08/))  Keywords: OBAMA/TAKEALOOK       ",
        "Histogram": [
            0,
            0,
            0,
            0
        ],
        "Relevance": 15.819286346435547,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it primarily reports on President Obama's efforts to address the economic crisis and other related policy matters without exhibiting any clear bias through the language or content."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Obama says stimulus package is right size, scope",
        "URL": "Obama says stimulus package is right size, scope.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    ELKHART, Indiana, Feb 9 (Reuters) - President Barack Obama  said on Monday that the economic stimulus bill being considered  by Congress is the right size and scope and warned that the  country's troubles will worsen if it is not passed promptly.      'It is the right size, it is the right scope. Broadly  speaking it has the right priorities to create jobs that will  jump-start our economy and transform it for the 21st century,'  Obama said of the more than $800 billion bill at a rally in  Elkhart, Indiana.      'I can say with complete confidence that endless delay or  paralysis in Washington in the face of this crisis will only  bring deepening disaster,' Obama said.      ((andy.sullivan@reuters.com; +1 202 898 8360; Reuters  Messaging: andy.sullivan.reuters.com@reuters.net))  Keywords: OBAMA/STIMULUS        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 15.755233764648438,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides a straightforward report on President Obama's statement regarding the economic stimulus package without exhibiting any of the typical signs of bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Obama says stimulus pricetag \"at high end\"",
        "URL": "Obama says stimulus pricetag \"at high end\".txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    WASHINGTON, Jan 7 (Reuters) - U.S. President-elect Barack  Obama said Wednesday he was still talking to congressional  leaders about his economic stimulus package and that the final  pricetag would likely be at the high end of estimates.      'We expect that it will be on the high end of our estimates  but will not be as high as some economists have recommended  because of the constraints and concerns we have about the  existing deficit,' Obama told a news conference.      Obama economic advisers have put a pricetag of around $775  billion on the package, but some economists have said it should  be as much as $1 trillion to be effective.      ((Washington newsroom +1 202 898 8300))  Keywords: USA OBAMA/STIMULUS        ",
        "Histogram": [
            0,
            0,
            0,
            0
        ],
        "Relevance": 15.59950065612793,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it primarily reports on a statement made by President-elect Barack Obama regarding the economic stimulus package without introducing any subjective or misleading information."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    }
]