[
    {
        "Title": "Obama_s to Blame for the Birther Movement.txt",
        "URL": "Obama_s to Blame for the Birther Movement.txt.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Fox_News_Channel_logo.svg/240px-Fox_News_Channel_logo.svg.png",
        "Text": "Trust but verify.\n\n-- Ronald Reagan\n\nIt's good practice to take a person at his word until someone shows you proof he is lying.\n\nBarack Obama says he was born in Hawaii, and since no one has shown any proof he was born in Kenya or elsewhere, it's OK to conclude he was born in Hawaii.\n\nSure his grammar school records show that he was enrolled as an Indonesian Muslim, but some people will say anything to get their kid in the right school. It doesn't really answer the question.\n\nIt's OK though for others not to use my deferential standard and continue to question whether Obama was born in Hawaii. We aren't talking about a 12-year-old qualifying to play Little League here. There is a Constitutional mandate that the President be a natural-born citizen, and if Obama is not one, he certainly will have committed the biggest fraud since the White Sox threw the World Series.\n\nThe reason why people still question Obama's citizen status is one-fold: \"President Transparency\" has refused to release any original documents on the matter. He can end the controversy in a day by releasing original documents, but for some inexplicable reason he refuses, and his love-struck media never asks him why he won't. The media instead spends hell-bent hours on making the Birther movement look like fringy, conspiracy-hungry kooks.\n\nYou have to admit though, even if you are a devout Obama-bot, Obama's refusal to release any original documents makes for a newsworthy story by itself.\n\nIf he really wants the Birthers to shut up, he has the power to do it by releasing the original documents. Why not just do it then? It's a simple task. Why not get rid of a conversation that has been with America since the campaign?\n\nThe issue is the subject of several lawsuits, which only seek a peek at original documents. Can anyone explain why it is smarter for Obama to spend tens of thousands of dollars and man-hours defending the suits when he can win the lawsuit for free by showing the original documents?\n\nBy defending the lawsuits and not showing the documents, Obama feeds the suspicion of those who already think he is lying. That's why this issue has the power to linger, and that's Obama's fault alone.\n\nLet's look at what Obama has released, and you will see they are hearsay documents and not best evidence.\n\nThe Birth Certificate: The certificate put on the Internet by Obama and held up by the media was created in 2007. In the lower left corner of the form there is reference to a Hawaiian statute that was revised in November of 2001, and if you look closely at the front you can see bleeding through from the back the date stamp from 2007 when the document was created. It's a certification that an original does exit.\n\nSo the the Birthers say: \"Fine. Then show us the original.\" Obama says, \"No.\" Why?\n\nThe Newspaper Announcements: Two birth announcements from Hawaiian local papers show Obama's birth. The Birthers have a couple of good arguments about them. First, Hawaii is where Obama's grandparents lived and it's not unusual for grandparents to announce a birth to their friends, even if the grandson lives elsewhere. Also, if Obama's parents lived in Hawaii then moved to Kenya when they birthed him, it wouldn't be unusual to announce the birth in the old neighborhood for friends to see.\n\nThe newspaper announcements cut against the Birthers, but they are hearsay documents and don't answer the citizen question any more than his grammar school records prove he is a Muslim. The original Birth Certificate will end it all.\n\nSchool Records: The Birthers believe that Obama's records from college and graduate school will show he matriculated as a foreign born student. This is easy -- shut them up by releasing them! Obama's response? \"No.\" Why?\n\nThis one reminds me of John Kerry not releasing his Yale records until after the election. During the campaign Kerry soaked in the warm media bath that swore he was the intellectual and George Bush the dolt. When the records came out later it was quietly reported that George Bush had a higher grade point average at Yale.\n\nMedia's penchant to cover for Democrat candidates fuels the Birther fire as well. See as an example John Edwards' love affair.\n\nFinancial Aid Records: Barack Obama relishes his own personal Sonia Sotomayor-like story of how he came from a broken home and pulled himself up by his own bootstraps. But he refuses to show how his very expensive tuition at Occidental College, Columbia University and Harvard Law School were paid for.\n\nThe Birthers believe the records will show Obama received financial aid as a foreign born student. Obama says they won't. Not to sound like a broken record, but releasing the records will end the controversy, and Obama refuses. Why?\n\nThe Birther movement is Obama's fault for not releasing the records. I hope the Birthers continue to bite his ankles until he releases the records. He deserves nothing less.\n\nRead more Tommy De Seno at www.JustifiedRight.com",
        "Histogram": [
            0,
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.9,
            0.9,
            0.9,
            0
        ],
        "Relevance": 18.038070678710938,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Sure his grammar school records show that he was enrolled as an Indonesian Muslim, but some people will say anything to get their kid in the right school. It doesn't really answer the question.",
                    "bias_type": "Unsubstantiated Claims Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence presents a claim about Barack Obama's past enrollment in school as an Indonesian Muslim without providing evidence, implying a negative judgment without substantiation."
                },
                {
                    "text": "The reason why people still question Obama's citizen status is one-fold: \"President Transparency\" has refused to release any original documents on the matter. He can end the controversy in a day by releasing original documents, but for some inexplicable reason he refuses, and his love-struck media never asks him why he won't. The media instead spends hell-bent hours on making the Birther movement look like fringy, conspiracy-hungry kooks.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of phrases like \"President Transparency\" and \"love-struck media\" carries a negative connotation and implies judgment, suggesting a biased perspective against Obama and the media."
                },
                {
                    "text": "You have to admit though, even if you are a devout Obama-bot, Obama's refusal to release any original documents makes for a newsworthy story by itself.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Referring to individuals as 'Obama-bots' employs a derogatory term to describe supporters of Obama, indicating a biased and dismissive attitude towards those who may trust Obama's statements."
                },
                {
                    "text": "If he really wants the Birthers to shut up, he has the power to do it by releasing the original documents. Why not just do it then? It's a simple task. Why not get rid of a conversation that has been with America since the campaign?",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence presents the author's opinion on what Obama should do regarding the Birther movement as a fact, without acknowledging the complexity of the issue or the potential reasons for Obama's actions."
                },
                {
                    "text": "The issue is the subject of several lawsuits, which only seek a peek at original documents. Can anyone explain why it is smarter for Obama to spend tens of thousands of dollars and man-hours defending the suits when he can win the lawsuit for free by showing the original documents?",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The author's framing of the situation implies a judgment on Obama's actions, suggesting that it is illogical for him to defend the lawsuits rather than simply presenting the documents, without considering potential legal or strategic reasons for his actions."
                },
                {
                    "text": "By defending the lawsuits and not showing the documents, Obama feeds the suspicion of those who already think he is lying. That's why this issue has the power to linger, and that's Obama's fault alone.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This statement unequivocally blames Obama for the persistence of the Birther issue, attributing it solely to his actions without acknowledging the role of the media, political opponents, or the complexity of addressing conspiracy theories."
                },
                {
                    "text": "Let's look at what Obama has released, and you will see they are hearsay documents and not best evidence.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The assertion that the documents released by Obama are 'hearsay' and 'not best evidence' is an opinion presented as a fact, suggesting a biased interpretation of the legal and evidentiary value of the documents."
                },
                {
                    "text": "The Birth Certificate: The certificate put on the Internet by Obama and held up by the media was created in 2007. In the lower left corner of the form there is reference to a Hawaiian statute that was revised in November of 2001, and if you look closely at the front you can see bleeding through from the back the date stamp from 2007 when the document was created. It's a certification that an original does exit. So the the Birthers say: \"Fine. Then show us the original.\" Obama says, \"No.\" Why?",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This passage questions the authenticity of Obama's birth certificate and his decision not to release the original, implying a suspicious motive without acknowledging the legal validity of the provided certificate or the potential reasons for not releasing the original."
                },
                {
                    "text": "The Newspaper Announcements: Two birth announcements from Hawaiian local papers show Obama's birth. The Birthers have a couple of good arguments about them. First, Hawaii is where Obama's grandparents lived and it's not unusual for grandparents to announce a birth to their friends, even if the grandson lives elsewhere. Also, if Obama's parents lived in Hawaii then moved to Kenya when they birthed him, it wouldn't be unusual to announce the birth in the old neighborhood for friends to see. The newspaper announcements cut against the Birthers, but they are hearsay documents and don't answer the citizen question any more than his grammar school records prove he is a Muslim. The original Birth Certificate will end it all.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This paragraph dismisses the significance of the newspaper announcements and asserts that only the original birth certificate can resolve the issue, presenting a biased perspective that undermines the legal and historical value of such announcements."
                },
                {
                    "text": "School Records: The Birthers believe that Obama's records from college and graduate school will show he matriculated as a foreign born student. This is easy -- shut them up by releasing them! Obama's response? \"No.\" Why?",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The author's framing of Obama's decision not to release his school records as a means to 'shut them up' implies a dismissive and confrontational attitude towards those who question Obama's background, suggesting a biased and oversimplified view of the issue."
                },
                {
                    "text": "This one reminds me of John Kerry not releasing his Yale records until after the election. During the campaign Kerry soaked in the warm media bath that swore he was the intellectual and George Bush the dolt. When the records came out later it was quietly reported that George Bush had a higher grade point average at Yale.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The comparison to John Kerry and the derogatory language used to describe the media's treatment of Kerry and Bush ('warm media bath', 'dolt') reflects a biased perspective through the use of negative connotations and oversimplified characterizations."
                },
                {
                    "text": "Media's penchant to cover for Democrat candidates fuels the Birther fire as well. See as an example John Edwards' love affair.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence accuses the media of bias in favor of Democratic candidates, using the example of John Edwards to suggest a general pattern of protective coverage, which implies a conspiratorial and one-sided view of media behavior."
                },
                {
                    "text": "The Birther movement is Obama's fault for not releasing the records. I hope the Birthers continue to bite his ankles until he releases the records. He deserves nothing less.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This strongly worded conclusion unequivocally blames Obama for the existence of the Birther movement and expresses a desire for its persistence as a form of punishment, reflecting a highly biased and emotionally charged perspective."
                }
            ],
            "overall_bias": {
                "conclusion": "The article is biased regarding the issue of Barack Obama's citizenship status, demonstrating a general bias tendency through the use of unsubstantiated claims, opinionated language, and word choice that implies judgment and dismissiveness towards Obama and his supporters."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6230769230769229,
            "percentage_of_biased_sentences": 0.5370370370370371,
            "overall_rating": 0.5800569800569799
        },
        "combined_score": 0.0
    },
    {
        "Title": "Obama phones Palestinian president on peace effort",
        "URL": "Obama phones Palestinian president on peace effort.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    RAMALLAH, West Bank, Jan 21 (Reuters) - U.S. President  Barack Obama pledged in a telephone call on Wednesday to  Palestinian President Mahmoud Abbas to try to achieve Middle  East peace, a Palestinian official said.      'Obama reiterated that he and his administration will work  in full partnership with President Abbas to achieve peace in the  region,' said Saeb Erekat, a senior Palestinian negotiator in  peace talks with Israel.      In Jerusalem, a spokesman for Prime Minister Ehud Olmert  said he was not immediately aware whether Obama, who has pledged  to pursue Israeli-Palestinian peace efforts early into his  administration, also had telephoned the Israeli leader.   (Reporting by Wafa Amr, Writing by Jeffrey Heller, Editing by  Ori Lewis)   ((jeffrey.heller@reuters.com ; +972 2 632 2202; Reuters  Messaging: jeffrey.heller.reuters.com@reuters.net))    Keywords: PALESTINIANS ISRAEL/OBAMA CALL       ",
        "Histogram": [
            0,
            0,
            0,
            0
        ],
        "Relevance": 11.349586486816406,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it primarily reports on a diplomatic phone call between U.S. President Barack Obama and Palestinian President Mahmoud Abbas regarding efforts for Middle East peace. The language used is neutral and does not exhibit any of the typical signs of bias discussed."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "TAKE A LOOK-OBAMA'S PRESIDENCY: Obama becomes US president",
        "URL": "TAKE A LOOK-OBAMA'S PRESIDENCY: Obama becomes US president.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    Barack Obama was sworn in on Tuesday as the first black U.S.  president, riding the optimism of millions of people into power  and inheriting a recession and two wars that will test his  skills.      Obama, 47, the son of a Kenyan father and a white mother from  Kansas, took the oath of office on the steps of the U.S. Capitol,  his hand placed on a Bible used by Abraham Lincoln at his first  inauguration in 1861.       Former Delaware Sen. Joe Biden was sworn in as Obama's  vice-president,       INAUGURATION  > Obama sworn in as U.S. president                [ID:nWBT010441]  > Joe Biden sworn in as U.S. vice president       [ID:nWBT010440]  > Obama poised to become 44th U.S. president      [ID:nN20398331]  > U.S. probes potential Obama inauguration threat [ID:nN20406]  > Black Americans ride buses to witness history   [ID:nN20313872]  > Obama faces challenges with inaugural address   [ID:nN18329049]  > War, crowds complicate Obama inaugural security [ID:nN15546480]  > FACTBOX-Barack Obama, 44th U.S. president       [ID:nN19373983]  > FACTBOX-Security for Obama's inauguration       [ID:nN16288150]  > FACTBOX-Obama's inauguration by the numbers     [ID:nN15525999]      CABINET APPOINTEES  > Obama to tap ex-Sen. Mitchell as Mideast envoy  [ID:nN20405438]  > Was Biden offered choice of two big jobs?       [ID:nN19370892]  > Foundation concerns could delay vote on Clinton [ID:nN19411014]  > Obama Cabinet headed toward quick Sen. approval [ID:nN16314979]  > Geithner tax flap calms, economic crisis deepens[ID:nN15538076]  > Fed nominee wants 'sensible' regulatory reform  [ID:nN15518989]      TOP FINANCIAL STORIES  > Obama to push bankers to resume lending         [ID:nN18329083]  > Summers says does not see jobless topping 10 pct[ID:nN18330685]  > Obama rolls into Washington, sees challenges    [ID:nN17456980]  > Obama team weighs government bank to ease crisis[ID:nN17323385]  > SCENARIOS-Obama facing battered economy         [ID:nN14449687]         ANALYSES AND ISSUES  > Obama to discuss Iraq troop drawdown Wednesday  [ID:nN20405853]  > Rescuing economy tops Obama's 100-day agenda    [ID:nN18335567]  > For Obama, high hopes and a global honeymoon    [ID:nN16477107]  > Inauguration turns page in US race relations    [ID:nN13397941]  > FACTBOX-The first 100 days of a U.S. presidency [ID:nN18335554]  > FACTBOX-Obama facing battered economy           [ID:nN18332193]  > FACTBOX-Foreign policy stands by Obama, Clinton [ID:nN13367911]  > SCENARIOS-Ailing economy rules domestic agenda  [ID:nN18335471]  > SCENARIOS-Obama faces wars; Iran, N.Korea aims  [ID:nN17309092]     (Compiled by World Desk, Americas; +1 202 898 8457)   ((For more about the U.S. political scene please visit Reuters  'Front Row Washington' online at  http://blogs.reuters.com/trail08/))  ",
        "Histogram": [
            0,
            0,
            0,
            0
        ],
        "Relevance": 11.185165405273438,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it primarily reports factual information about Barack Obama's presidential inauguration and the challenges he faced upon taking office."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Former U.S. President Carter to endorse Obama",
        "URL": "Former U.S. President Carter to endorse Obama.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    ATLANTA, June 3 (Reuters) - Former U.S. President Jimmy  Carter will endorse Sen. Barack Obama as the Democratic nominee  for president when polls close in two primaries later on  Tuesday, the Carter Center in Atlanta said.      Carter, a superdelegate, has remained neutral in the  nomination race but has hinted his support for Obama and has  said that members of his family supported the Illinois senator  who is poised to clinch the Democratic nomination.   (Reporting by Matt Bigg; Editing by Tom Brown)   ((matt.bigg@reuters.com; +1 404 992-5745; Reuters Messaging:  matt.bigg.reuters.com@reuters.net))  Keywords: USA POLITICS/CARTER        ",
        "Histogram": [
            0,
            0,
            0
        ],
        "Relevance": 10.936802864074707,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it simply reports on the endorsement of Sen. Barack Obama by Former U.S. President Jimmy Carter without introducing any subjective or misleading information."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Obama poised to become 44th U.S. president",
        "URL": "Obama poised to become 44th U.S. president.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    * 'Obama-mania' sweeps into Washington      * Enthusiasm tempered by grim economic news      * Cheney, Biden make news on eve of inauguration           By Steve Holland      WASHINGTON, Jan 20 (Reuters) - Barack Obama was poised to  make history on Tuesday as America's first black president,  riding the optimism of millions of people into power and  inheriting a recession and two wars that will test his skills.      Obama, 47, the son of a Kenyan father and a white mother  from Kansas, was set to take the oath of office at midday (0500  GMT) on the steps of the U.S. Capitol, his hand placed on a  Bible used by Abraham Lincoln at his first inauguration in  1861.      Obama's inauguration culminates the hopes and dreams of  generations of African-Americans who suffered slavery and then  racial segregation policies that made them second-class  citizens.      He assumes the mantle of power at a moment of great anxiety  among Americans who have seen hundreds of thousands of jobs  vanish in past months and left them fearful an economic  collapse could turn a crisis into a catastrophe.      The 'Obama-mania' that helped propel Obama into office was  alive on the streets of Washington.      A winter chill failed to dampen the spirits of more than 1  million people who swept into the U.S. capital to witness the  pomp and ceremony and revel in the festivities surrounding  Obama's inauguration as the 44th U.S. president.      'Slavery to History, The Obama Inauguration,' was the  slogan on a handwritten cardboard sign held by a smiling man on  a downtown sidewalk.      Thousands of security personnel were in place to maintain  order and guard against an attack. Much of the city center was  barricaded and shut down to vehicular traffic.      In an eagerly anticipated inauguration address he has been  working on for weeks, Obama will rally Americans to an era of  responsibility, urging them to join in a spirit of unity to  take on difficult issues.      'Government can only do so much,' he told participants in a  service project honoring slain civil rights leader Martin  Luther King Jr. on Monday. 'We're going to have to take  responsibility -- all of us.'      Obama in recent days has stressed that Americans should  expect even rougher economic times and that his plan to revive  the struggling economy will take time to work.           OBAMA HONORS MCCAIN, COLIN POWELL      The president-to-be appeared in a giddy mood on Monday  night as he spent the evening at dinners honoring former  Republican rival John McCain, former Secretary of State Colin  Powell and Vice President-elect Joe Biden.      At the event for McCain, he could not resist referring to  the sometimes testy campaign debates in which they took part.      'I'm here tonight to say a few words about an American hero  I have come to know very well and admire very much -- Senator  John McCain. And then, according to the rules agreed to by both  parties, John will have approximately 30 seconds to make a  rebuttal,' he said.      Crowds of people clapped as Obama's motorcade sped through  the city en route to the various dinners.      Favorable winds were blowing at Obama's back despite the  long to-do list he inherits from President George W. Bush. A  realclearpolitics.com average of recent polls showed a  remarkable 73 percent of Americans had a favorable view of  Obama.      By contrast, Bush leaves with sagging poll numbers, weighed  down by wars in Iraq and Afghanistan and the worst ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 10.926165580749512,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to exhibit bias. It provides a factual account of Barack Obama's historic inauguration as the 44th U.S. president, highlighting the optimism and challenges he faces without introducing any subjective or misleading information."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "FACTBOX-Barack Obama, 44th U.S. president",
        "URL": "FACTBOX-Barack Obama, 44th U.S. president.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    Jan 20 (Reuters) - Barack Obama will be sworn in as the  44th president of the United States at noon on Tuesday.      Here are some biographical facts about the first  African-American to hold the nation's highest office.        Age: 47      Birthdate: Aug. 4, 1961      Birthplace: Honolulu, Hawaii      Education: Columbia University; Harvard Law School      Wife: Michelle Robinson Obama      Children: Daughters Malia, 10, and Sasha, 7      Religious affiliation: United Church of Christ      Party: Democrat        Family: Barack Obama was born to a Kenyan father and a  white American mother. His father, Barack Obama Sr., married  his mother, Ann Dunham, while studying at the University of  Hawaii. The couple separated two years after Obama was born.  His father ultimately returned to Kenya, where he became a  noted economist. He died in a car accident in 1982.      Obama's mother's second marriage was to an Indonesian man  named Lolo Soetoro. The family moved to Indonesia and Obama  remained there until he was 10 when he moved back to Hawaii and  lived with his grandparents while studying on a scholarship at  the elite Punahou Academy.      He has seven half brothers and sisters in Kenya from his  father's other marriages, and a half-sister, Maya Soetoro-Ng,  from his mother's second marriage.        Career: After finishing college in 1983, Obama worked for a  New York financial consultancy and a consumer organization. He  landed a job in Chicago in 1985 as an organizer for Developing  Communities Project, a church-based group seeking to improve  living conditions in poor neighborhoods.      Three years later, Obama left to go to Harvard Law School,  where he became the first black president of the law review. He  worked as a summer associate at the Sidley Austin law firm in  Chicago, where he met his future wife. After graduation from  Harvard in 1991, Obama practiced civil rights law at a small  firm in Chicago, then became a lecturer in constitutional law  at the University of Chicago in 1993.        Elective office: Obama won a seat in the Illinois state  Senate in 1996. During his time in the Legislature, he worked  on welfare and ethics legislation, as well as a measure  requiring electronic recording of police interrogations and  confessions in homicide investigations.      Obama won a heavily contested U.S. Senate seat in 2004,  carrying 53 percent of the Democratic primary vote in an  eight-candidate race. He easily won the general election as  well. In the U.S. Senate he compiled a liberal voting record,  but was one of the few Democrats to back a measure on  class-action lawsuits. He opposed the appointment of Chief  Justice John Roberts and Justice Samuel Alito to the U.S.  Supreme Court.      The nonpartisan National Journal ranked him as the most  liberal member of the U.S. Senate early this year based on his  voting record in 2007. He was ranked 10th most liberal in 2006  and 16th most liberal in 2005.           Presidential campaign: Obama announced his presidential  candidacy on Feb. 10, 2007. Though New York Sen. Hillary  Clinton was initially seen as the front-runner for the  Democratic nomination, Obama quickly showed an ability to raise  large amounts of money and draw record-breaking crowds who were  attracted to his rhetorical skill, his opposition to the Iraq  war, and his promise to move beyond the divisive politics of  the past 40 years.      Obama won the first contest of the Democratic primary in  Iowa in",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 10.881879806518555,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides a factual and neutral overview of Barack Obama's background, career, and presidential campaign without exhibiting any of the typical signs of bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Obama-Iran should not wait for next U.S. president",
        "URL": "Obama-Iran should not wait for next U.S. president.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    PARIS, July 25 (Reuters) - U.S. presidential candidate  Barack Obama called on Iran on Friday to move quickly to accept  an offer of trade and technical incentives to halt its uranium  enrichment programme.      Speaking at a joint news conference with French President  Nicolas Sarkozy in Paris, Obama said Iran should not wait for  the next U.S. president to be elected to accept the offer from  the six world powers.      'Iran should accept the proposals that President Sarkozy and  the EU 3 plus 3 are presenting now. Don't wait for the next  president because the pressure, I think, is only going to  build,' he said.      ((Writing by James Mackenzie; Reuters Messaging  james.mackenzie.reuters.com@reuters.net, Paris Newsroom +33 1  4949 5339, paris.newsroom@reuters.com))    Keywords: USA OBAMA/IRAN        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 10.787291526794434,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it simply reports a statement made by Barack Obama urging Iran to accept an offer from world powers to halt its uranium enrichment program."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Rock star Springsteen backs Obama for US president",
        "URL": "Rock star Springsteen backs Obama for US president.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Ellen Wulfhorst      PHILADELPHIA, April 16 (Reuters) - Rock superstar Bruce  Springsteen on Wednesday endorsed Democratic Sen. Barack Obama  for U.S. president, saying he stands 'head and shoulders above  the rest.'      In a message posted on his Web site, the musician and  songwriter known as the Boss said the Illinois senator has 'the  depth, the reflectiveness and the resilience' to be the next  U.S. president.      'Like most of you, I've been following the campaign and I  have now seen and heard enough to know where I stand. Sen.  Obama, in my view, is head and shoulders above the rest,' he  wrote.      Many of Springsteen's rousing rock anthems and haunting  ballads celebrate working class Americans. His endorsement in  the November presidential election comes as Obama fends off  charges he is out of touch with working class voters.      The Obama campaign welcomed the endorsement. The America of  Springsteen's songs -- with its hardworking people and big  dreams -- is 'a story I know and a vision I share for our  future, and that's why I'm so honored to have his support in  this journey,' Obama said in a statement.      (Editing by Cynthia Osterman)      ((ellen.wulfhorst@reuters.com; +1 646 223 6283; Reuters  Messaging: ellen.wulfhorst.reuters.com@reuters.net))       Keywords: USA POLITICS/OBAMA SPRINGSTEEN       ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 10.770794868469238,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides a straightforward report on Bruce Springsteen's endorsement of Barack Obama for U.S. president without exhibiting any of the typical signs of media bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Obama sworn in as first black U.S. president",
        "URL": "Obama sworn in as first black U.S. president.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    WASHINGTON, Jan 20 (Reuters) - Barack Obama was sworn in on  Tuesday as the first black U.S. president, taking power to lead  anxious Americans through a severe economic recession and two  wars aboard.      (Writing by Steve Holland, Editing by Frances Kerry)      Keywords: OBAMA/OATH        ",
        "Histogram": [
            0,
            0
        ],
        "Relevance": 10.728032112121582,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it simply reports the factual event of Barack Obama being sworn in as the first black U.S. president without any indication of bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Obama meets Afghan president Karzai in Kabul",
        "URL": "Obama meets Afghan president Karzai in Kabul.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    KABUL, July 20 - (Reuters) - U.S. Democratic presidential  candidate Barack Obama met Afghan President Hamid Karzai in Kabul  on the second day of his visit to Afghanistan on Sunday, an  official from the presidential palace said.      'He is in the palace and in the process of meeting Karzai and  perhaps having lunch with him,' the palace official said on  condition of anonymity.    (Editing by Alex Richardson)    ((Kabul newsroom, +93 799 335 284))  Keywords: USA POLITICS/OBAMA KARZAI        ",
        "Histogram": [
            0,
            0,
            0
        ],
        "Relevance": 10.668850898742676,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it simply reports on the meeting between Barack Obama and Afghan President Hamid Karzai without any indication of subjective or prejudiced language."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "FACTBOX-Barack Obama, Democratic US President-elect",
        "URL": "FACTBOX-Barack Obama, Democratic US President-elect.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "(Refile to update headline)      Nov 5 (Reuters) - Barack Obama is the U.S. president-elect.  Following are some of his biographical details:        Age: 47      Birthdate: Aug. 4, 1961      Birthplace: Honolulu, Hawaii      Education: Columbia University; Harvard Law School      Wife: Michelle Robinson      Children: Two daughters      Religious affiliation: United Church of Christ        Family: Barack Obama was born in Hawaii to a Kenyan father  and a white American mother. His father, Barack Obama Sr.,  married his mother, Ann Dunham, while studying at the  University of Hawaii. The couple separated two years after  Obama was born. His father ultimately returned to Kenya, where  he became a noted economist. He died in a car accident in 1982.      Obama's mother's second marriage was to an Indonesian man  named Lolo Soetoro. The family moved to Indonesia and Obama  remained there until he was 10 when he moved back to Hawaii and  lived with his grandparents while studying on a scholarship at  the elite Punahou Academy.      He has seven half brothers and sisters in Kenya from his  father's other marriages, and a half-sister, Maya Soetoro-Ng,  from his mother's second marriage.        Career: After finishing college in 1983, Obama worked for a  New York financial consultant and a consumer organization. He  landed a job in Chicago in 1985 as an organizer for Developing  Communities Project, a church-based group seeking to improve  living conditions in poor neighborhoods.      Three years later, Obama left to go to Harvard Law School,  where he became the first black president of the law review. He  worked as a summer associate at the Sidley Austin law firm in  Chicago, where he met his future wife. After graduation from  Harvard in 1991, Obama practiced civil rights law at a small  firm in Chicago, then became a lecturer in constitutional law  at the University of Chicago in 1993.        Elective office: Obama won a seat in the Illinois state  Senate in 1996. During his time in the legislature, he worked  on welfare and ethics legislation, as well as a measure  requiring electronic recording of police interrogations and  confessions in homicide investigations.      Obama won a heavily contested U.S. Senate seat in 2004,  carrying 53 percent of the Democratic primary vote in an  eight-candidate race. He easily won the general election. In  the Senate he compiled a liberal voting record, but was one of  the few Democrats to back a measure on class-action lawsuits.  He opposed the appointment of Chief Justice John Roberts and  Justice Samuel Alito to the U.S. Supreme Court.      The nonpartisan National Journal ranked him as the most  liberal member of the Senate early this year based on his  voting record in 2007. He was ranked 10th most liberal in 2006  and 16th most liberal in 2005.     (Reporting by David Alexander)      (Sources: Reuters, Almanac of American Politics, 'The  Audacity of Hope' by Barack Obama)      ((david.alexander@reuters.com; 202 354-5866;  david.alexander.reuters.com@reuters.net))    Keywords: USA ELECTION/OBAMA        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 10.622441291809082,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides factual information about Barack Obama's background, education, career, and political positions without employing any of the common bias types."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Obama pledges new approach on Iran",
        "URL": "Obama pledges new approach on Iran.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    WASHINGTON, Jan 11 (Reuters) - U.S. President-elect Barack  Obama will take a new approach toward Iran that will both  emphasize respect for its people and spell out expectations for  its leaders, he said in remarks broadcast on Sunday.      'Iran is going to be one of our biggest challenges,' Obama  said in an interview with ABC's 'This Week with George  Stephanopoulos.'      Obama said he was concerned about the Islamic republic's  support of the Lebanese Shi'ite movement Hezbollah and about  Iran's nuclear enrichment, which he said could trigger a Middle  East arms race.      In a shift from President George W. Bush's policies, Obama  has said he would seek much broader engagement with Iran.      'We are going to have to take a new approach. And I've  outlined my belief that engagement is the place to start,' he  said. He takes office as president on Jan. 20.   (Reporting by Caren Bohan; Editing by Bill Trott)   ((World Desk Americas; +1 202 898 8457))   ((For more about the U.S. political scene please visit Reuters  'Front Row Washington' online at  http://blogs.reuters.com//frontrow/))   Keywords: USA OBAMA/IRAN        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 10.57898998260498,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides a straightforward report on U.S. President-elect Barack Obama's planned approach towards Iran, without exhibiting any of the typical signs of bias such as emotional sensationalism, unsubstantiated claims, or discriminatory language."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "U.S. President-elect Obama condemns India attacks",
        "URL": "U.S. President-elect Obama condemns India attacks.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    CHICAGO, Nov 26 (Reuters) - U.S. President-elect Barack  Obama condemned a series of attacks in India's financial  capital Mumbai on Wednesday in which gunmen killed at least 80  people.      'These coordinated attacks on innocent civilians  demonstrate the grave and urgent threat of terrorism. The  United States must continue to strengthen our partnerships with  India and nations around the world to root out and destroy  terrorist networks,' Obama's chief national security  spokesperson, Brooke Anderson, said in a statement.    (Reporting by Ross Colvin; editing by Todd Eastham)    ((Reuters messaging: ross.colvin@reuters.com))  Keywords: INDIA MUMBAI/USA OBAMA        ",
        "Histogram": [
            0,
            0,
            0,
            0
        ],
        "Relevance": 10.561391830444336,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it primarily reports on the condemnation of the attacks in India by U.S. President-elect Barack Obama without introducing any subjective or misleading information."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "WRAPUP 7-Obama becomes first black U.S. president",
        "URL": "WRAPUP 7-Obama becomes first black U.S. president.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    * Obama takes oath of office      * Hundreds of thousands witness history      * Obama says U.S. in midst of crisis           By Steve Holland and Caren Bohan      WASHINGTON, Jan 20 (Reuters) - Barack Obama became the  first black U.S. president on Tuesday, making history before a  sea of people and declaring the United States in the midst of a  crisis that can be defeated with a united sense of purpose.      'Today I say to you that the challenges we face are real,'  Obama said in his inaugural speech shortly after taking the  oath of office. 'They are serious and they are many. They will  not be met easily or in a short span of time. But know this,  America -- they will be met.'      Hundreds of thousands of people erupted in roars of  approval on the broad National Mall grounds as they watched  Obama stand with one hand raised, one hand on a Bible used to  swear in Abraham Lincoln in 1861, and repeat the brief oath to  become the 44th U.S. president and succeed George W. Bush.      The inauguration of Obama, 47, the son of a black Kenyan  father and a white mother from Kansas, was steeped in symbolic  meaning for African-Americans, who for generations suffered  slavery and then racial segregation that made them second-class  citizens.      Beaming broadly, the new president had kisses for his wife,  Michelle, and his school-age daughters, Malia and Sasha, then  he turned to the crowds stretching away into the distance on a  cold, wintry day.      'Obama, Obama,' the crowd cheered.       Dispatching quickly with pleasantries, Obama turned to the  task at hand and sought to temper the soaring optimism about  his leadership with reality. A Democrat, he took over from  Republican Bush, who served two terms and whose approval  ratings plumbed record lows.      Obama cited the worst U.S. economic conditions in 70 years  and U.S. involvement in wars in Iraq and Afghanistan as having  placed the country 'in the midst of crisis.'      'On this day, we gather because we have chosen hope over  fear, unity of purpose over conflict and discord,' he said.      He pledged bold and swift action on the 'badly weakened'  U.S. economy, a top priority as he works with the U.S. Congress  on an estimated $850 billion economic stimulus package aimed at  jolting the economy back to life.      U.S. stock indexes extended losses and hit session lows  after his speech, which provided few details on how to tackle  the crisis.[ID:nN20414587]             VOWS 'NEW WAY FORWARD' WITH MUSLIMS      After years of tense relations with Muslims following the  Sept. 11 attacks seven years ago that prompted Washington's  declared war on terrorism and deeply shaped Bush's policies,  Obama offered conciliatory words to the Islamic community while  issuing a warning to those who would wage terrorism.      In a message to the Muslim world, Obama said he would seek  a 'new way forward' based on mutual interest and mutual  respect.      He added: 'We will not apologize for our way of life, nor  will we waver in its defense, and for those who seek to advance  their aims by inducing terror and slaughtering innocents, we  say to you now that our spirit is stronger and cannot be  broken; you cannot outlast us, and we will defeat you.'      In his first act of business, the Obama White House issued  a proclamation declaring a national day of renewal and  reconciliation and calling on Americans to serve one another.      Highlighting the economic problems Obama will face, major ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 10.554718017578125,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides a factual account of Barack Obama's historic inauguration as the first black U.S. president and his initial actions and statements without exhibiting any evident bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Former president Carter hints at support for Obama",
        "URL": "Former president Carter hints at support for Obama.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    WASHINGTON, April 4 (Reuters) - Former U.S. President Jimmy  Carter, one of a handful of high-profile Democrats who has  remained neutral in his party's presidential primary battle,  has hinted that he supports Barack Obama over Hillary Clinton,  according to news reports on Friday.      Traveling in Nigeria, Carter said his home state of Georgia  and his hometown of Plains backed Obama in the state's Feb. 5  primary. His children, their spouses and his grandchildren  support Obama as well, he said.      'As a superdelegate, I would not disclose who I am rooting  for but I leave it to you to make that guess,' ABC News quoted  Carter as saying.      Democratic party rules allow elected officials and party  insiders, termed 'superdelegates,' to back whom they want at  the party's nominating convention.      Those who remain unaligned are being urgently courted by  both campaigns, as they could mean the difference between  victory and defeat in the hard-fought battle to win the party's  nomination and take on presumptive Republican nominee John  McCain in the November election.      Neither Obama, an Illinois senator who would be the first  black president, nor Clinton, a New York senator who would be  the first woman president, is likely to clinch the nomination  through the state-by-state primaries and caucuses that continue  through June.      Other prominent superdelegates who remain uncommitted  include U.S. House of Representatives Speaker Nancy Pelosi and  former Vice President Al Gore, the 2000 Democratic presidential  nominee.      (Reporting by Andy Sullivan, editing by Vicki Allen)      (To read more about the U.S. political campaign, visit  Reuters 'Tales from the Trail: 2008' online at  http://blogs.reuters.com/trail08/)      ((andy.sullivan@reuters.com; +1 202 898 8360; Reuters  Messaging: andy.sullivan.reuters.com@reuters.net))  Keywords: USA POLITICS/CARTER       ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 10.538141250610352,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides a factual report on former President Carter's hints at support for Barack Obama over Hillary Clinton in the U.S. presidential primary, without exhibiting any of the common forms of bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "ANALYSIS-Mr Co-President? Obama upstages Bush on economy",
        "URL": "ANALYSIS-Mr Co-President? Obama upstages Bush on economy.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Jeff Mason      CHICAGO, Nov 25 (Reuters) - There may be only one U.S.  president at a time, but you wouldn't know it by watching  Barack Obama this week.      The Democratic president-elect, who kept a low profile for  three weeks after his White House win, has swung into action  with a series of economic pronouncements and cabinet selections  that have overshadowed President George W. Bush.      If financial markets are clamoring for more leadership,  Obama got the message.      'There is a leadership vacuum. If Obama doesn't fill it,  more panic will result in (the) short run, and the problem will  become greater by the time he officially takes office,' said  Stephen Wayne, professor of government at Georgetown  University.      'It is still Bush's power to act now, but Obama's  obligation to tell jittery Americans what he plans to do.'      On Monday Obama held a news conference to announce his  economic team. Flanked by flags and new staff members, he vowed  to jolt the economy with an aggressive new stimulus package.      On Tuesday Obama held another press event, this time  announcing his pick to run the White House budget office and  intention to cut billions of dollars in wasteful spending.      Both days he took questions from reporters while his  heavyweight appointments -- including New York Federal Reserve  Chairman President Timothy Geithner as Treasury secretary --  stood behind him, silent. He has another news conference  scheduled for Wednesday.      Meanwhile, back in Washington, Bush had coffee with his  Treasury secretary, told reporters he was keeping his successor  apprised of steps to secure the financial system, and took a  trip to visit troops in Kentucky.      On the pressing issue of the day -- the economy -- the man  who will be the next president of the United States very much  upstaged the current White House occupant, prompting a question  on Tuesday about his oft-stated pronouncement that the country  only had one head of state at a time.      'Well, there is only one president at a time. That  president is George W. Bush, and he will be president until I'm  sworn in on January 20th,' Obama said, when asked how he  squared his involvement in the economy with that fact.      '(But) I think it is very important for the American people  to understand that we are putting together a first-class team  and for them to have clarity that we don't intend to stumble  into the next administration.'           LEADERSHIP VACUUM      No stumbling so far. Obama has drawn accolades for his  appointments, though his refusal to give his stimulus package a  price tag caused U.S. stocks to pare gains briefly on Monday.      Paul Beck, a professor of political science at Ohio State  University, said the current transition recalled the situation  in 1932 when Democrat Franklin Delano Roosevelt took over from  Republican Herbert Hoover in the midst of an economic  disaster.      'It is not normal that a president-elect would get involved  in this way, but these are not normal times,' he said, adding  that Bush's credibility had eroded to the point that he was not  taken seriously within the financial markets.      'The economy will not wait for the transition to be  completed. That was a problem in 1932, and subsequently we  moved the presidential inauguration from March to January.   Now, we are finding out that January is not early enough.'      Obama takes over from Bush on Jan. 20. He has urged the  next U.S. Congress",
        "Histogram": [
            0,
            0.6,
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 10.527677536010742,
        "BiasReport": {
            "sentences": [
                {
                    "text": "There may be only one U.S.  president at a time, but you wouldn't know it by watching  Barack Obama this week.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the phrase 'you wouldn't know it' implies a judgment that Barack Obama's actions are inappropriately encroaching on the current president's role, suggesting a lack of respect for the traditional transition of power."
                },
                {
                    "text": "'There is a leadership vacuum. If Obama doesn't fill it,  more panic will result in (the) short run, and the problem will  become greater by the time he officially takes office,' said  Stephen Wayne, professor of government at Georgetown  University.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This quote presents a subjective opinion about the necessity of Obama's immediate intervention as a fact, without acknowledging alternative viewpoints or the complexities of the situation."
                },
                {
                    "text": "On the pressing issue of the day -- the economy -- the man  who will be the next president of the United States very much  upstaged the current White House occupant, prompting a question  on Tuesday about his oft-stated pronouncement that the country  only had one head of state at a time.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'very much upstaged' and 'current White House occupant' carries a negative connotation towards President Bush, implying a judgment about his competence and Obama's superiority."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias through the use of word choice and opinionated statements, particularly in comparing the actions and leadership of Barack Obama and George W. Bush during a transitional period. The general bias tendency leans towards portraying Obama in a more favorable light compared to Bush regarding their handling of economic issues."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.11538461538461539,
            "overall_rating": 0.3576923076923077
        },
        "combined_score": 0.0
    },
    {
        "Title": "REFILE-WRAPUP 10-Obama becomes 1st black U.S. president",
        "URL": "REFILE-WRAPUP 10-Obama becomes 1st black U.S. president.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    * Hundreds of thousands witness history      * Record Inauguration Day slide on Wall St      * Sen. Kennedy collapses at luncheon           (Refiles to fix typos in paragraph 3)      By Steve Holland and Caren Bohan      WASHINGTON, Jan 20 (Reuters) - Barack Obama took power as  the first black U.S. president on Tuesday and quickly turned  the page on the Bush years, urging Americans to rally to end  the worst economic crisis in 70 years and repair the U.S. image  abroad.      'Starting today, we must pick ourselves up, dust ourselves  off, and begin again the work of remaking America,' Obama said,  addressing an exuberant sea of people in an inaugural speech  that was both optimistic but realistic about the challenges  ahead.      He pledged bold and swift action to bring new life to the  U.S. economy and declared to millions watching abroad that, 'We  are ready to lead once more.'      But illustrating the tough road ahead, Wall Street ushered  in the new presidency with the record Inauguration Day slide  amid signs the global banking crisis was far from over.  [ID:nN20429093]      Hundreds of thousands of people erupted in roars of  approval on Washington's broad National Mall grounds as they  watched Obama stand with one hand raised, one hand on a Bible  used to swear in Abraham Lincoln in 1861, and repeat the brief  oath to become the 44th U.S. president.      Beaming, the new president kissed his wife, Michelle, and  his school-age daughters, Malia and Sasha. Then he turned to  the crowds stretching into the distance on a cold, wintry day.      'Obama, Obama,' the crowd cheered.      Obama, a Democrat, replaced Republican George W. Bush, who  served two terms and left office having plumbed record lows in  approval ratings and leaving a legacy of two wars and an  economy in recession.           WALKING SOME OF THE WAY      During a triumphant ride down Pennsylvania Avenue to the  White House in a heavily armored limousine, Obama and his wife  thrilled wildly cheering crowds by getting out of the limo and  walking a part of the way on foot.      Security personnel -- part of a contingent that numbered in  the thousands -- kept close watch.      Obama has to hit the ground running given the state of the  economy and the U.S. Senate confirmed several key Obama  appointments, including Steven Chu as energy secretary and Tom  Vilsack for agriculture. The Senate Finance Committee is  expected to vote on Timothy Geithner as treasury secretary on  Thursday.      The inauguration of Obama, 47, the son of a black Kenyan  father and a white mother from Kansas, was steeped in symbolism  for African-Americans, who for generations suffered slavery and  then racial segregation that made them second-class citizens.      In a nod to that history, Obama lauded the people who built  the country from its foundation, including those who 'endured  the lash of the whip and plowed the hard earth.'      The jubilant mood was jolted by the collapse of  Massachusetts Democratic Senator Edward Kennedy at an inaugural  lunch honoring Obama on Capitol Hill. Kennedy, 76, who  underwent surgery in June for a brain tumor, appeared to suffer  convulsions, a congressional aide said.      Wheeled out on a stretcher, the respected brother of the  late President John F. Kennedy was driven away by an ambulance  to a hospital, where he was described as awake and answering  questions. [ID:nN20402184]        BOLD ACTION      The new president said the 'badly weakened' ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 10.518147468566895,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it primarily reports on the historic inauguration of Barack Obama and the challenges he faced upon taking office, without displaying any evident bias through the language or content."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "WRAPUP 4-Obama wins South Carolina Democratic president vote",
        "URL": "WRAPUP 4-Obama wins South Carolina Democratic president vote.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": " (Updates with Obama win in South Carolina)      By John Whitesides, Political Correspondent      COLUMBIA, S.C., Jan 26 (Reuters) - Barack Obama won a vital  contest in South Carolina on Saturday in his quest for the U.S.  Democratic presidential nomination, showing strength among  southern blacks who make up half the state's Democratic  voters.      After losses in New Hampshire and Nevada, the victory gave  Obama, who would be the first black president, a big lift  heading into the Super Tuesday contests on Feb. 5, when nearly  half of the U.S. states will pick Republican and Democratic  candidates for the November election.      South Carolina was the latest test for Obama, who would be  the first black U.S president, and Clinton, a New York senator,  in their escalating battle for the right to represent the  Democratic Party in November's presidential election.      After two consecutive losses, in New Hampshire and Nevada,  Obama needed a win on Saturday if he hopes to head into the  Feb. 5 'Super Tuesday' contests in two dozen states with a  realistic chance of victory.      The high stakes fueled a week of angry accusations, harsh  advertisements and increasingly personal jabs between the two  candidates, capped by a volley of attacks on Obama from  Clinton's husband, former President Bill Clinton.      Obama and Hillary Clinton visited with voters in South  Carolina during the day -- Obama visited a polling station and  a restaurant, while Clinton visited two restaurants.      Clinton left South Carolina before the polls closed, headed  to Tennessee -- which votes on Feb. 5 -- for a town hall  meeting in Nashville.      The other candidate in the Democratic race, former North  Carolina Sen. John Edwards, who won South Carolina during his  failed 2004 presidential bid, was in a battle with Clinton for  second place.   (Additional reporting by Ellen Wulfhorst, Tim Gaynor, Deborah  Charles, Jason Szep; Editing by Lori Santos)   (To read more about the U.S. political campaign, visit Reuters  'Tales from the Trail: 2008' online at  http://blogs.reuters.com/trail08/)   ((david.alexander@reuters.com; +1 202 354 5866; Reuters  Messaging: david.alexander.reuters.com@reuters.net))   ((For a TAKE A LOOK on the campaign [US/VOTE]))  Keywords: holdUSA POLITICS        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 10.427051544189453,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it primarily reports on the outcome of the South Carolina Democratic presidential contest and the subsequent strategies of the candidates for the upcoming Super Tuesday contests. The information is presented in a factual manner without exhibiting any of the common forms of bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Washington Post endorses Obama for U.S. president",
        "URL": "Washington Post endorses Obama for U.S. president.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    WASHINGTON, Oct 16 (Reuters) - Democrat Barack Obama won the  endorsement of The Washington Post in an editorial saying the  Illinois senator 'has the potential to become a great  president.'      The newspaper said its choice was made easy in part by the  'disappointing campaign' of Republican candidate John McCain and  his decision to pick Sarah Palin, the governor of Alaska, as his  vice presidential running mate for the Nov. 4 election.      'It is made easy in larger part, though, because of our  admiration for Mr. Obama and the impressive qualities he has  shown during this long race,' the Post said in the editorial for  its Friday editions published on its website on Thursday night.      The paper, which endorsed Democrats in the two previous  presidential elections, praised Obama as a 'man of supple  intelligence, with a nuanced grasp of complex issues and evident  skill at conciliation and consensus-building.'      It said Obama also has a sophisticated understanding of the  world and America's place in it and that he was committed to  maintaining U.S. leadership.      In endorsing Obama, the Post said a McCain presidency would  not equal four more years of Bush administration policies. But  the paper said McCain would draw on many of the same policymakers  who have brought the country to its current state.      'We believe they have richly earned, and might even benefit  from, some years in the political wilderness,' the editorial  said.   (Writing by JoAnne Allen; Editing by John O'Callaghan)   ((JoAnne Allen@ThomsonReuters.com;Reuters Messaging:  joanne.allen.reuters.com@reuters.net))  Keywords: USA POLITICS/OBAMA POST       ",
        "Histogram": [
            0,
            0.6,
            0,
            0,
            0,
            0.6,
            0.6,
            0,
            0
        ],
        "Relevance": 10.423724174499512,
        "BiasReport": {
            "sentences": [
                {
                    "text": "The newspaper said its choice was made easy in part by the 'disappointing campaign' of Republican candidate John McCain and his decision to pick Sarah Palin, the governor of Alaska, as his vice presidential running mate for the Nov. 4 election.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the word 'disappointing' to describe John McCain's campaign and the implication that Sarah Palin's selection was a negative decision reflects a negative judgment and implies a lack of qualification without providing a balanced view."
                },
                {
                    "text": "In endorsing Obama, the Post said a McCain presidency would not equal four more years of Bush administration policies. But the paper said McCain would draw on many of the same policymakers who have brought the country to its current state.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'many of the same policymakers who have brought the country to its current state' suggests a negative connotation towards McCain's team without providing specific evidence, influencing the reader's perception through the choice of words."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias through the use of word choice, particularly in negatively framing John McCain's campaign and his choice of Sarah Palin as his running mate. The general bias tendency leans towards favoring Barack Obama's candidacy over John McCain's, without providing a balanced or neutral perspective."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.2222222222222222,
            "overall_rating": 0.4111111111111111
        },
        "combined_score": 0.0
    },
    {
        "Title": "RPT-ANALYSIS-Mr Co-President? Obama upstages Bush on economy",
        "URL": "RPT-ANALYSIS-Mr Co-President? Obama upstages Bush on economy.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "(Repeats with no change in content)      By Jeff Mason      CHICAGO, Nov 26 (Reuters) - There may be only one U.S.  president at a time, but you wouldn't know it by watching  Barack Obama this week.      The Democratic president-elect, who kept a low profile for  three weeks after his White House win, has swung into action  with a series of economic pronouncements and cabinet selections  that have overshadowed President George W. Bush.      If financial markets are clamoring for more leadership,  Obama got the message.      'There is a leadership vacuum. If Obama doesn't fill it,  more panic will result in (the) short run, and the problem will  become greater by the time he officially takes office,' said  Stephen Wayne, professor of government at Georgetown  University.      'It is still Bush's power to act now, but Obama's  obligation to tell jittery Americans what he plans to do.'      On Monday Obama held a news conference to announce his  economic team. Flanked by flags and new staff members, he vowed  to jolt the economy with an aggressive new stimulus package.      On Tuesday Obama held another press event, this time  announcing his pick to run the White House budget office and  intention to cut billions of dollars in wasteful spending.      Both days he took questions from reporters while his  heavyweight appointments -- including New York Federal Reserve  Chairman President Timothy Geithner as Treasury secretary --  stood behind him, silent. He has another news conference  scheduled for Wednesday.      Meanwhile, back in Washington, Bush had coffee with his  Treasury secretary, told reporters he was keeping his successor  apprised of steps to secure the financial system, and took a  trip to visit troops in Kentucky.      On the pressing issue of the day -- the economy -- the man  who will be the next president of the United States very much  upstaged the current White House occupant, prompting a question  on Tuesday about his oft-stated pronouncement that the country  only had one head of state at a time.      'Well, there is only one president at a time. That  president is George W. Bush, and he will be president until I'm  sworn in on January 20th,' Obama said, when asked how he  squared his involvement in the economy with that fact.      '(But) I think it is very important for the American people  to understand that we are putting together a first-class team  and for them to have clarity that we don't intend to stumble  into the next administration.'           LEADERSHIP VACUUM      No stumbling so far. Obama has drawn accolades for his  appointments, though his refusal to give his stimulus package a  price tag caused U.S. stocks to pare gains briefly on Monday.      Paul Beck, a professor of political science at Ohio State  University, said the current transition recalled the situation  in 1932 when Democrat Franklin Delano Roosevelt took over from  Republican Herbert Hoover in the midst of an economic  disaster.      'It is not normal that a president-elect would get involved  in this way, but these are not normal times,' he said, adding  that Bush's credibility had eroded to the point that he was not  taken seriously within the financial markets.      'The economy will not wait for the transition to be  completed. That was a problem in 1932, and subsequently we  moved the presidential inauguration from March to January.   Now, we are finding out that January is not early enough.'      Obama takes over from Bush on Jan. 20.",
        "Histogram": [
            0,
            0.6,
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 10.298371315002441,
        "BiasReport": {
            "sentences": [
                {
                    "text": "There may be only one U.S.  president at a time, but you wouldn't know it by watching  Barack Obama this week.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the phrase 'you wouldn't know it' implies a judgment that Obama's actions are inappropriately overshadowing the current president, suggesting a lack of respect for the traditional transition of power."
                },
                {
                    "text": "'There is a leadership vacuum. If Obama doesn't fill it,  more panic will result in (the) short run, and the problem will  become greater by the time he officially takes office,' said  Stephen Wayne, professor of government at Georgetown  University.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This quote presents a subjective opinion about Obama's role in addressing the economic crisis as a fact, without providing evidence for the existence of a 'leadership vacuum' or the direct consequences mentioned."
                },
                {
                    "text": "On the pressing issue of the day -- the economy -- the man  who will be the next president of the United States very much  upstaged the current White House occupant, prompting a question  on Tuesday about his oft-stated pronouncement that the country  only had one head of state at a time.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'very much upstaged' and 'the current White House occupant' employs language that implies a judgment about Obama's actions being intentionally disruptive or disrespectful to the current administration."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias through the use of word choice and opinionated statements, particularly in its portrayal of Barack Obama's actions during the transition period. The general bias tendency leans towards undermining the traditional respect for the current administration's authority during the transition of power."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.12,
            "overall_rating": 0.36
        },
        "combined_score": 0.0
    }
]