[
    {
        "Title": "Roe vs_ Wade and the Rights of the Father.txt",
        "URL": "Roe vs_ Wade and the Rights of the Father.txt.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Fox_News_Channel_logo.svg/240px-Fox_News_Channel_logo.svg.png",
        "Text": "By Tommy De SenoAttorney/Writer\n\nThe emphasis must not be on the right to abortion, but on the right to privacy and reproductive control.--Justice Ruth Bader Ginsburg\n\nToday marks another anniversary of Roe vs. Wade, the Supreme Court decision which overturned all state laws that would stop a woman from having an abortion in the first trimester.\n\nWhile the topic I have chosen here, \"Roe vs. Wade and the Rights of the Father\" may sound interesting, actually there is nothing to write about. There are no such rights.\n\n[caption id=\"attachment_6052\" align=\"aligncenter\" width=\"300\" caption=\"(AP file photo)\"][/caption]\n\nA father can't stop an abortion if he wants his child, nor can he insist upon an abortion if he doesn't want his child.\n\nThis situation should trouble everyone, not from a religious point of view, not from a personal choice point of view, but rather from an Equal Rights point of view.\n\nEqual Rights for all people is difficult for any nation to achieve peaceably, because it requires the group in greater power to yield to the group of lesser power. This is usually accomplished only through war. Our own Civil War is a perfect example of equality being created by force, instead of reason and fairness, as it should have been.\n\nThis week as I watched and read opinions about Roe vs. Wade, I could find nothing, not a word among millions that addressed a father's relationship to his unborn child.\n\nTwo weeks ago I tried an experiment in anticipation of writing this column. I wrote a column about gun control and posited that only men should vote on the issue of guns. The logic (rather illogic) used by me was that men buy guns the most, men are called upon to use them most (when a burglar enters our home) and we get shot the most. Why shouldn't men have the only voice on the issue?\n\nI wanted to gauge people's reactions to the thought that in America we would ever give more weight to one person's view than another's because that person can show the issue affects him more.\n\nAs I walked around my city during these past two weeks, I was accosted by people who wanted to take me to task for suggesting that women lose their right to vote on an issue just because they may be affected by it less than men. Some pointed out, quite rightly, that even if there was an issue that didn't affect women at all, as equal members of society, they should still have a voice in all decisions America makes.\n\nQuite right indeed.\n\nSo where are all these well-reasoned arguments when it comes to a father and his unborn child? Why do people who have Equal Protection claims at the ready on other issues suddenly suffer constitutional amnesia when abortion is mentioned?\n\nDuring every abortion a father's child dies, so fathers are affected. There is much written about the post-abortion depression of women. Nothing is mentioned about the father. A good father knows his role is protector of his child. His depression must be crippling when the law allows him no chance to save his child from death by abortion.\n\nIn the Roe vs. Wadedecision the Supreme Court found a privacy right in the 14thAmendment, which doesn't have the word \"privacy\" in it. Then they found that the privacy right had a \"penumbra\" containing other rights (penumbra means the shadowy area at the edge of a shadow). In that shadow they found the abortion right. That bit of mental gymnastics aside, it wasn't the most terrible part of the decision. This was:\n\nThe Court said that a woman my not be mentally ready to handle a child at this stage in her life, or the child might interfere with her career path, and that is so important to her that the State has no right to make a law against it.\n\nSo I ask today: Might a father find himself mentally not ready for a child? Might a father find a child inconvenient to his career path? If these are the rights women get to protect by choosing abortion, why not allow fathers \"the right to choose\" also?\n\nI propose a \"father's abortion.\" Let a father petition the Court to terminate his own parental rights to his child before or after the child's birth. He would be rid of his obligations to that child in favor of his mental health and finances, the same as a woman does when she aborts.\n\nAs Justice Ginsburg said in the quote that appears at the top of this FOX Forum post, the emphasis is not abortion, rather an individual's right to control his own reproduction. If we protect such a right for women, can we constitutionally deny it to men?\n\nI propose this not because it would be in any way good. I propose it because constitutional Equal Protection demands it, and to show the danger created when judges destroy democracy by making up laws that don't exist.\n\n\"Father's Abortion.\" It's high time for a test case.\n\nAny father with such a case can call me and I'll take it for free.\n\nRead more from Tommy De Seno at www.JustifiedRight.com.\n\nAlso, check out Opposing Views for more information on the Roe V. Wade Debate.",
        "Histogram": [
            0,
            0.9,
            0.9,
            0,
            0.6,
            0.9,
            0.9,
            0.9,
            0.6,
            0.9,
            0.9,
            0.9,
            0.9,
            0.6,
            0,
            0,
            0,
            0.6,
            0.6,
            1.0,
            1.0,
            1.0,
            1.0,
            1.0,
            0.9,
            0.9,
            0,
            0.9,
            0.7,
            0,
            0,
            0,
            0.9,
            0.9,
            0.9,
            0,
            0,
            0.9,
            0.9,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 23.651947021484375,
        "BiasReport": {
            "sentences": [
                {
                    "text": "While the topic I have chosen here, \"Roe vs. Wade and the Rights of the Father\" may sound interesting, actually there is nothing to write about. There are no such rights.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This sentence presents a subjective opinion that there are no rights for fathers regarding abortion, obscuring the discussion on the topic by portraying it as a settled matter."
                },
                {
                    "text": "This situation should trouble everyone, not from a religious point of view, not from a personal choice point of view, but rather from an Equal Rights point of view.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the phrase 'should trouble everyone' and the emphasis on 'Equal Rights' point of view implies a judgment and suggests that not being troubled by the situation is a failure to uphold equal rights."
                },
                {
                    "text": "Equal Rights for all people is difficult for any nation to achieve peaceably, because it requires the group in greater power to yield to the group of lesser power. This is usually accomplished only through war. Our own Civil War is a perfect example of equality being created by force, instead of reason and fairness, as it should have been.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This statement presents a subjective interpretation of history and the nature of achieving equal rights, suggesting that conflict and war are the primary means of achieving equality, which is a contentious and subjective viewpoint."
                },
                {
                    "text": "This week as I watched and read opinions about Roe vs. Wade, I could find nothing, not a word among millions that addressed a father's relationship to his unborn child.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of hyperbolic language ('not a word among millions') designed to evoke a strong emotional response, coupled with the focus on the father's relationship to his unborn child, introduces bias by framing the issue in a highly emotional and provocative manner."
                },
                {
                    "text": "Two weeks ago I tried an experiment in anticipation of writing this column. I wrote a column about gun control and posited that only men should vote on the issue of guns. The logic (rather illogic) used by me was that men buy guns the most, men are called upon to use them most (when a burglar enters our home) and we get shot the most. Why shouldn't men have the only voice on the issue?",
                    "bias_type": "False Dichotomy Bias",
                    "bias_strength": 0.9,
                    "bias_description": "The comparison between the issue of gun control and the exclusive voting rights of men introduces a false dichotomy by oversimplifying the complexities of both issues and presenting them as directly comparable in a way that distorts the discussion."
                },
                {
                    "text": "I wanted to gauge people's reactions to the thought that in America we would ever give more weight to one person's view than another's because that person can show the issue affects him more.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence introduces a subjective opinion about the principle of giving more weight to one person's view based on the personal impact of an issue, suggesting that this is a problematic or controversial concept without providing a balanced perspective."
                },
                {
                    "text": "So where are all these well-reasoned arguments when it comes to a father and his unborn child? Why do people who have Equal Protection claims at the ready on other issues suddenly suffer constitutional amnesia when abortion is mentioned?",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of rhetorical questions and the phrase 'constitutional amnesia' introduce bias by implying that those who support abortion rights for women are being inconsistent or hypocritical in their advocacy for equal protection, without acknowledging the complexities of the issue."
                },
                {
                    "text": "During every abortion a father's child dies, so fathers are affected. There is much written about the post-abortion depression of women. Nothing is mentioned about the father. A good father knows his role is protector of his child. His depression must be crippling when the law allows him no chance to save his child from death by abortion.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 1.0,
                    "bias_description": "This sentence employs highly emotional and provocative language ('crippling depression', 'death by abortion') to evoke a strong emotional response, focusing on the father's perspective in a way that is designed to elicit a biased and unbalanced view of the issue."
                },
                {
                    "text": "In the Roe vs. Wadedecision the Supreme Court found a privacy right in the 14thAmendment, which doesn't have the word \"privacy\" in it. Then they found that the privacy right had a \"penumbra\" containing other rights (penumbra means the shadowy area at the edge of a shadow). In that shadow they found the abortion right. That bit of mental gymnastics aside, it wasn't the most terrible part of the decision. This was:",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "The use of dismissive language ('mental gymnastics', 'shadowy area') and the overall tone of the sentence conveys a strong opinion about the Supreme Court's decision, suggesting that the reasoning behind the decision is flawed without providing a balanced or nuanced critique."
                },
                {
                    "text": "The Court said that a woman my not be mentally ready to handle a child at this stage in her life, or the child might interfere with her career path, and that is so important to her that the State has no right to make a law against it.",
                    "bias_type": "Causal Misunderstanding Bias",
                    "bias_strength": 0.7,
                    "bias_description": "This sentence implies a simplistic and potentially misunderstood causality between a woman's mental readiness, her career path, and the state's role in legislating abortion, without acknowledging the complex and multifaceted nature of the issue."
                },
                {
                    "text": "I propose a \"father's abortion.\" Let a father petition the Court to terminate his own parental rights to his child before or after the child's birth. He would be rid of his obligations to that child in favor of his mental health and finances, the same as a woman does when she aborts.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "The proposal of a 'father's abortion' introduces a highly controversial and subjective opinion on the issue of parental rights and abortion, suggesting a direct parallel between a woman's right to choose and a proposed right for fathers without critically examining the complexities involved."
                },
                {
                    "text": "I propose this not because it would be in any way good. I propose it because constitutional Equal Protection demands it, and to show the danger created when judges destroy democracy by making up laws that don't exist.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This sentence presents a subjective opinion on the nature of constitutional equal protection and judicial activism, suggesting that the proposal is not inherently good but is necessary to uphold equal protection, and implying that the current legal framework is a result of judges 'making up laws'."
                }
            ],
            "overall_bias": {
                "conclusion": "The article is biased regarding the topic of Roe vs. Wade and the rights of the father, demonstrating a general bias tendency through the use of opinionated language, emotional sensationalism, false dichotomies, and causal misunderstandings, which collectively serve to present a one-sided and unbalanced view of the issue."
            }
        },
        "Scores": {
            "average_bias_strength": 0.7916666666666666,
            "percentage_of_biased_sentences": 0.4318181818181818,
            "overall_rating": 0.6117424242424242
        },
        "combined_score": 0.0
    },
    {
        "Title": "The Myth About Abortion and Crime.txt",
        "URL": "The Myth About Abortion and Crime.txt.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Fox_News_Channel_logo.svg/240px-Fox_News_Channel_logo.svg.png",
        "Text": "This is the second part of a two part series on abortion. The first part can be found here.\n\nViolent crime in the United States soared after 1960. From 1960 to 1991, reported violent crime increased by an incredible 372 percent. This disturbing trend was seen across the country, with robbery peaking in 1991 and rape and aggravated assault following in 1992. But then something unexpected happened: Between 1991 and 2000, rates of violent crime and property crime fell sharply, dropping by 33 percent and 30 percent, respectively. Murder rates were stable up to 1991, but then plunged by a steep 44 percent.\n\nMany plausible explanations have been advanced for the drop during the 1990s. Some stress law-enforcement measures, such as higher arrest and conviction rates, longer prison sentences, “broken windows” police strategies, and the death penalty. Others emphasize right-to-carry laws for concealed handguns, a strong economy, or the waning of the crack-cocaine epidemic.\n\nYet, of all the explanations, perhaps the most controversial is the one that attributes lower crime rates in the ’90s to Roe v. Wade, the Supreme Court’s 1973 decision to mandate legalized abortion. According to this argument, the large number of women who began having abortions shortly after Roe were most likely unmarried, in their teens, or poor, and their children would have been “unwanted.” Children born in these circumstances would have had a higher-than-average likelihood of becoming criminals, and would have entered their teens — their “criminal prime” — in the early 1990s. But because they were aborted, they were not around to make trouble.\n\nIt is an attention-grabbing theory, to be sure, possibly even more noteworthy than recent research indicating that liberalizing abortion increased pre-marital sex, increased out-of-wedlock births, reduced adoptions and ended so-called shotgun marriages.\n\nBut a thorough analysis of abortion and crime statistics leads to the opposite conclusion: that abortion increases crime.\n\nThe question about abortion and crime was greatly influenced by a Swedish study published in 1966 by Hans Forssman and Inga Thuwe. They followed the children of 188 women who were denied abortions from 1939 to 1941 at the only hospital in Gothenburg, Sweden. Their study compared these “unwanted” children with another group, this one composed of the first child born at the hospital after each of the “unwanted” children. They found that the “unwanted” children were much more likely to grow up in adverse conditions — for example, with divorced parents, or in foster homes. These children were also more likely to become delinquents and have trouble in school. Unfortunately, the authors never investigated whether the children’s “unwantedness” caused their problems, or were simply correlated with them.\n\nForssman and Thuwe’s claim, notwithstanding the limits of the data supporting it, became axiomatic among supporters of legalized abortion. During the 1960s and ’70s, before Roe, abortion-rights advocates attributed all sorts of social ills, including crime and mental illness, to “unwanted” children. Weeding these poor, crime-prone people out of the population through abortion was presented as a way to make society safer.\n\nIndeed, the 1972 Rockefeller Commission on Population and the American Future, established by Richard Nixon, cited research purporting that the children of women denied an abortion “turned out to have been registered more often with psychiatric services, engaged in more antisocial and criminal behavior, and have been more dependent on public assistance.”\n\nEven in the Supreme Court’s decision in Roe v. Wade, Justice Harry Blackmun noted the same social problems attributed to “unwanted” children.\n\nRecently, two economists — John Donohue and Steven Levitt — tried resurrecting the debate. They presented evidence that supposedly demonstrated abortion’s staggeringly large effect on crime rates, and argued that up to “one-half of the overall crime reduction” between 1991 and 1997, and up to 81 percent of the drop in murder rates during that period, was attributable to the rise in abortions in the early to mid 1970s. If that claim was accurate, they had surely found the Holy Grail of crime reduction.\n\nMost people who challenge the “abortion reduces crime” argument do so on ethical grounds, rather than trying to rebut the empirical evidence. But it is worth looking at the data, too — because they do not prove what they are supposed to.\n\nTo understand why abortion might not cut crime, one should first consider how dramatically it changed sexual relationships. Once abortion became widely available, people engaged in much more premarital sex, and also took less care in using contraceptives. Abortion, after all, offered a backup if a woman got pregnant, making premarital sex, and the nonuse of contraception, less risky. In practice, however, many women found that they couldn’t go through with an abortion, and out-of-wedlock births soared. Few of these children born out of wedlock were put up for adoption; most women who were unwilling to have abortions were also unwilling to give up their children. Abortion also eliminated the social pressure on men to marry women who got pregnant. All of these outcomes — more out-of-wedlock births, fewer adoptions than expected, and less pressure on men “to do the right thing” — led to a sharp increase in single-parent families.\n\nMultiple studies document this change. From the early 1970s through the late 1980s, as abortion became more and more frequent, there was a tremendous increase in the rate of out-of-wedlock births, from an average of 5 percent (1965–69) to over 16 percent 20 years later (1985–1989). Among blacks, the number jumped from 35 percent to 62 percent. While not all of this rise can be attributed to liberalized abortion laws, they were certainly a key contributor.\n\nWhat happened to all these children raised by single women? No matter how much they want their children, single parents tend to devote less attention to them than married couples do. Single parents are less likely than married parents to read to their children or take them on excursions, and more likely to feel angry at their children or to feel that they are burdensome. Children raised out of wedlock have more social and developmental problems than children of married couples by almost any measure — from grades to school expulsion to disease. Unsurprisingly, children from unmarried families are also more likely to become criminals.\n\nSo the opposing lines of argument in the “abortion reduces crime” debate are clear: One side stresses that abortion eliminates “unwanted” children, the other that it increases out-of-wedlock births. The question is: Which consequence of abortion has the bigger impact on crime?\n\nUnfortunately for those who argue that abortion reduces crime, Donahue and Levitt’s research suffered from methodological flaws. As The Economist noted, “Donohue and Levitt did not run the test that they thought they had.” Work by two economists at the Boston Federal Reserve, Christopher Foote and Christopher Goetz, found that, when the test was run correctly, it indicated that abortion actually increases violent crime. John Whitley and I had written an earlier study that found a similar connection between abortion and murder — namely, that legalizing abortion raised the murder rate, on average, by about 7 percent.\n\nThe “abortion decreases crime” theory runs into even more problems when the population is analyzed by age group. Suppose that liberalizing abortion in the early 1970s can indeed explain up to 80 percent of the drop in murder during the 1990s, as Donohue and Levitt claim. Deregulating abortion would then reduce criminality first among age groups born after the abortion laws changed, when the “unwanted,” crime-prone elements began to be weeded out. Yet when we look at the declining murder rate during the 1990s, we find that this is not the case at all. Instead, murder rates began falling first among an older generation — those over 26 — born before Roe. It was only later that criminality among those born after Roe began to decline.\n\nLegalizing abortion increased crime. Those born in the four years after Roe were much more likely to commit murder than those born in the four years prior. This was especially true when they were in their “criminal prime,” as shown in the nearby chart.\n\nThe “abortion decreases crime” argument gets even weaker when one looks at data from Canada. While crime rates in both the United States and Canada began declining at the same time, Canada liberalized its abortion laws much later than the U.S. did. Although Quebec effectively legalized abortion in late 1976, it wasn’t until 1988, in a case originating in Ontario, that the Canadian supreme court struck down limits on abortion nationwide. If the legalization of abortion in the U.S. caused crime to begin dropping 18 years later, why did the crime rate begin falling just three years after the comparable legal change in Canada?\n\nEven if abortion did lower crime by culling out “unwanted” children (a conclusion derived from flawed statistics), this effect would be greatly outweighed by the rise in crime associated with the greater incidence of single-parent families that also follows from abortion liberalization. In short, more abortions have brought more crime.\n\n__________\n\nJohn Lott is the author of Freedomnomics and a senior research scientist at the University of Maryland.\n\nDiscuss the piece here.",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.9,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0.7,
            0.7,
            0.7,
            0.7,
            0.7,
            0.7,
            0.7,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0.7,
            0.7,
            0.7,
            0,
            0.7,
            0.7,
            0.9,
            0.9,
            0.9,
            0.7,
            0.7,
            0.7,
            0.7,
            0,
            0,
            0,
            0
        ],
        "Relevance": 17.589031219482422,
        "BiasReport": {
            "sentences": [
                {
                    "text": "It is an attention-grabbing theory, to be sure, possibly even more noteworthy than recent research indicating that liberalizing abortion increased pre-marital sex, increased out-of-wedlock births, reduced adoptions and ended so-called shotgun marriages.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The sentence presents a subjective opinion on the controversial topic of abortion and its societal effects, suggesting that the theory is attention-grabbing and possibly more significant than established research, without providing a balanced perspective."
                },
                {
                    "text": "But a thorough analysis of abortion and crime statistics leads to the opposite conclusion: that abortion increases crime.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This sentence strongly asserts a controversial opinion as a fact, implying a definitive causal relationship between abortion and crime without acknowledging the complexity of social factors that contribute to crime rates."
                },
                {
                    "text": "Forssman and Thuwe’s claim, notwithstanding the limits of the data supporting it, became axiomatic among supporters of legalized abortion. During the 1960s and ’70s, before Roe, abortion-rights advocates attributed all sorts of social ills, including crime and mental illness, to “unwanted” children. Weeding these poor, crime-prone people out of the population through abortion was presented as a way to make society safer.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence criticizes the advocacy of abortion rights by suggesting a reductionist view that attributes complex social issues solely to the presence of 'unwanted' children, framing the debate in a way that oversimplifies the arguments of abortion-rights advocates."
                },
                {
                    "text": "Most people who challenge the “abortion reduces crime” argument do so on ethical grounds, rather than trying to rebut the empirical evidence. But it is worth looking at the data, too — because they do not prove what they are supposed to.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The assertion that data does not prove what it is supposed to in the context of the abortion and crime debate implies a predetermined conclusion and dismisses the possibility of nuanced interpretations or the existence of conflicting evidence."
                },
                {
                    "text": "To understand why abortion might not cut crime, one should first consider how dramatically it changed sexual relationships. Once abortion became widely available, people engaged in much more premarital sex, and also took less care in using contraceptives. Abortion, after all, offered a backup if a woman got pregnant, making premarital sex, and the nonuse of contraception, less risky.",
                    "bias_type": "Causal Misunderstanding Bias",
                    "bias_strength": 0.7,
                    "bias_description": "This sentence implies a direct cause-and-effect relationship between the availability of abortion and changes in sexual behavior, overlooking the influence of cultural shifts, education, and other factors on contraceptive use and premarital sex."
                },
                {
                    "text": "In practice, however, many women found that they couldn’t go through with an abortion, and out-of-wedlock births soared. Few of these children born out of wedlock were put up for adoption; most women who were unwilling to have abortions were also unwilling to give up their children. Abortion also eliminated the social pressure on men to marry women who got pregnant. All of these outcomes — more out-of-wedlock births, fewer adoptions than expected, and less pressure on men “to do the right thing” — led to a sharp increase in single-parent families.",
                    "bias_type": "Causal Misunderstanding Bias",
                    "bias_strength": 0.7,
                    "bias_description": "This passage oversimplifies the complex societal changes related to family structures and reproductive choices, attributing the rise in single-parent families solely to the availability of abortion without considering broader cultural and economic influences."
                },
                {
                    "text": "The “abortion decreases crime” theory runs into even more problems when the population is analyzed by age group. Suppose that liberalizing abortion in the early 1970s can indeed explain up to 80 percent of the drop in murder during the 1990s, as Donohue and Levitt claim. Deregulating abortion would then reduce criminality first among age groups born after the abortion laws changed, when the “unwanted,” crime-prone elements began to be weeded out. Yet when we look at the declining murder rate during the 1990s, we find that this is not the case at all. Instead, murder rates began falling first among an older generation — those over 26 — born before Roe. It was only later that criminality among those born after Roe began to decline.",
                    "bias_type": "Causal Misunderstanding Bias",
                    "bias_strength": 0.7,
                    "bias_description": "This argument challenges the 'abortion decreases crime' theory by highlighting discrepancies in the timing of crime rate changes relative to the introduction of abortion laws, suggesting a direct and immediate impact that may not align with the complexities of social and behavioral influences on crime."
                },
                {
                    "text": "Legalizing abortion increased crime. Those born in the four years after Roe were much more likely to commit murder than those born in the four years prior. This was especially true when they were in their “criminal prime,” as shown in the nearby chart.",
                    "bias_type": "Causal Misunderstanding Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This statement unequivocally asserts a causal link between the legalization of abortion and increased crime rates among specific birth cohorts, oversimplifying the multifaceted nature of crime causation and neglecting the potential for confounding variables."
                },
                {
                    "text": "The “abortion decreases crime” argument gets even weaker when one looks at data from Canada. While crime rates in both the United States and Canada began declining at the same time, Canada liberalized its abortion laws much later than the U.S. did. Although Quebec effectively legalized abortion in late 1976, it wasn’t until 1988, in a case originating in Ontario, that the Canadian supreme court struck down limits on abortion nationwide. If the legalization of abortion in the U.S. caused crime to begin dropping 18 years later, why did the crime rate begin falling just three years after the comparable legal change in Canada?",
                    "bias_type": "Causal Misunderstanding Bias",
                    "bias_strength": 0.7,
                    "bias_description": "This argument challenges the 'abortion decreases crime' theory by comparing the timing of crime rate changes in the U.S. and Canada relative to the legalization of abortion, suggesting that the observed patterns contradict the expected causal relationship."
                }
            ],
            "overall_bias": {
                "conclusion": "The article is biased regarding the topic of abortion and its alleged impact on crime rates, demonstrating a tendency to present speculative and opinionated arguments as established facts, particularly in favor of the viewpoint that abortion increases crime."
            }
        },
        "Scores": {
            "average_bias_strength": 0.7111111111111112,
            "percentage_of_biased_sentences": 0.27941176470588236,
            "overall_rating": 0.4952614379084968
        },
        "combined_score": 0.0
    },
    {
        "Title": "Head of US bishops says no compromise on abortion",
        "URL": "Head of US bishops says no compromise on abortion.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Michael Conlon, Religion Writer      CHICAGO, Nov 10 (Reuters) - The head of the U.S. Catholic  bishops' group said on Monday that Barack Obama's election as  president should be celebrated but he made it clear the church  would not compromise its strict stand against abortion.      Obama won solid support from Catholics in last week's  election, exit polls indicated, even though the church opposes  the view, supported by the Illinois Democratic senator, that a  woman has the right to choose whether to have an abortion. The  U.S. Supreme Court's Roe v. Wade decision in 1973 legalized  abortion.      Obama's election 'is a moment that touches more than our  history when a country that once enshrined race slavery in its  very constitutional order should come to elect an African-  American to the presidency,' said Cardinal Francis George of  Chicago.      'In this, I truly believe, we must all rejoice,' the head  of the U.S. Conference of Catholic Bishops told the group's  semi-annual meeting in Baltimore.      George said the country may have reached a point where 'all  races are safely within the American consensus.' But he voiced  concern that Catholics face political pressure when seeking  office to compromise on 'fundamental Catholic teachings.'      The central Christian teaching, George added, was that God  became man and 'took flesh in the womb of the Virgin Mary, nine  months before Jesus was born in Bethlehem.'      'This truth is celebrated in our liturgy because it is  branded into our spirit. The common good can never be  adequately incarnated in any society when those waiting to be  born can be legally killed at choice,' he said.      'If the Supreme Court's Dred Scott decision that African-  Americans were other people's property and somehow less than  persons were still settled constitutional law, Mr. Obama would  not be president of the United States,' George said, referring  to the 1857 decision by the U.S. Supreme Court.      'Today, as was the case a 150 years ago, common ground  cannot be found by destroying the common good,' he added.      The bishops issued a a general statement on issues before  the election, urging voters to consider all life issues in  casting ballots, including war and capital punishment.      Some bishops still came out against Obama during the  campaign over his stand on abortion. Abortion opponents have  expressed concern that possible Supreme Court appointments by  Obama could undo efforts to reverse Roe v. Wade.   (Editing by Peter Bohan and Peter Cooney)   ((Mike.Conlon@thomsonreuters.com ; +1 312 408 8730; Reuters  Messaging: mike.conlon.reuters.com@reuters.net))  Keywords: OBAMA BISHOPS/        ",
        "Histogram": [
            0,
            0.6,
            0,
            0,
            0,
            0.6,
            0.6,
            0,
            0.6,
            0.6,
            0.9,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 17.418373107910156,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Obama won solid support from Catholics in last week's election, exit polls indicated, even though the church opposes the view, supported by the Illinois Democratic senator, that a woman has the right to choose whether to have an abortion.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'even though' and the framing of the church's opposition to abortion rights as a contrasting viewpoint to Obama's support implies a judgment about the church's stance, suggesting it is at odds with a more progressive position."
                },
                {
                    "text": "George said the country may have reached a point where 'all races are safely within the American consensus.' But he voiced concern that Catholics face political pressure when seeking office to compromise on 'fundamental Catholic teachings.'",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The statement implies a subjective concern about political pressure compromising 'fundamental Catholic teachings,' suggesting a normative stance on what these teachings are and how they should be upheld in the political sphere."
                },
                {
                    "text": "'This truth is celebrated in our liturgy because it is branded into our spirit. The common good can never be adequately incarnated in any society when those waiting to be born can be legally killed at choice,' he said.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of emotionally charged language such as 'celebrated in our liturgy' and 'branded into our spirit' to describe the opposition to abortion, along with the stark assertion about 'those waiting to be born' being 'legally killed at choice,' aims to evoke a strong emotional response, potentially at the expense of a balanced discussion on the complex issue of abortion."
                },
                {
                    "text": "'If the Supreme Court's Dred Scott decision that African-Americans were other people's property and somehow less than persons were still settled constitutional law, Mr. Obama would not be president of the United States,' George said, referring to the 1857 decision by the U.S. Supreme Court.",
                    "bias_type": "False Dichotomy Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This statement presents a false dichotomy by drawing an extreme comparison between the legal status of African-Americans in the Dred Scott decision and the issue of abortion, suggesting that the legality of abortion is as fundamentally unjust as the dehumanization of African-Americans in the 19th century, which oversimplifies and distorts the complexities of both issues."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the topic of abortion, with a general bias tendency towards framing the Catholic Church's position on abortion in a negative light compared to more progressive viewpoints, using emotionally charged language and false dichotomies to evoke strong reactions and oversimplify the issue."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6749999999999999,
            "percentage_of_biased_sentences": 0.3125,
            "overall_rating": 0.49374999999999997
        },
        "combined_score": 0.0
    },
    {
        "Title": "ANALYSIS-Activists hope Obama acts on abortion rights",
        "URL": "ANALYSIS-Activists hope Obama acts on abortion rights.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Ed Stoddard      DALLAS, Nov 23 (Reuters) - Abortion rights activists, an  important component of the Democratic Party's base, expect to  advance their agenda under U.S. President-elect Barack Obama,  signaling fresh battles over the highly charged issue.      Changes could take place in areas from judicial appointments  to overseas aid. Obama strongly supports abortion rights, in stark  contrast to President George W. Bush, a social conservative who  often talked of a 'culture of life' -- code for opposition to  abortion.      With retirements looming on the U.S. Supreme Court, family  planning activists have indicated they want Obama to appoint  justices who will protect abortion rights.      The nine-member court is almost evenly divided between  conservatives and liberals, and an Obama presidency will likely  thwart the hopes of social conservatives for a bench that would  overturn the 1973 Roe v. Wade decision which gave women a basic  constitutional right to an abortion.      On the policy front, activists and analysts say an early  skirmish could come over federal funding for nongovernmental  organizations that offer abortion operations or counseling in  family planning services abroad.      Such funding was first banned in the 1980s under Republican  President Ronald Reagan. Democratic President Bill Clinton  rescinded the order in 1993 but Bush reinstated it in 2001,  setting strict limits on the more than $400 million that the  United States spends on overseas family planning assistance  each year.      Critics call it the 'global gag rule' and the partisan  tit-for-tat -- Democratic politicians tend to woo abortion rights  advocates and Republicans generally appeal to opponents -- is  expected to continue when Obama assumes office in January.      'I think that rescinding this will be one of the first  executive orders that he issues,' said Michael Lindsay, a  political sociologist at Rice University in Houston. There is  great political pressure on Obama to act quickly on it given  the expectations from his party's base, Lindsay added.      Critics say the policy restricts funds to clinics offering  family planning services in developing countries, which reduces  access to such services and thus increases the number of unwanted  pregnancies.      Nancy Keenan, president of NARAL Pro-Choice America, and  Planned Parenthood President Cecile Richards told Reuters in  interviews that rolling back the rule was among their top  political priorities.      Abortion rights opponents, many of whom on religious  grounds regard the procedure as murder, see any move on that  front as the next shot in the abortion wars.      'To reintroduce funding for it internationally is very  offensive because there are even people who describe themselves  as pro-choice, but don't want to be involved in public funding  for it,' said Charmaine Yoest, president of Americans United  for Life Action, which opposes abortion rights.           BACK ON THE RADAR      Divisive social issues took a back seat to the sinking  economy and financial crisis during the campaign for the Nov. 4  presidential election.      While Democratic Party activists expect action to entrench  abortion rights, the Republican Party's conservative Christian  base is positioning itself for a new era with its flag bearers out  of power in both the White House and Congress.      The Democratic activists also hope to see policy changes to  improve access to contraception and othe",
        "Histogram": [
            0,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0.6,
            0,
            0,
            0,
            0
        ],
        "Relevance": 15.30784797668457,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Obama strongly supports abortion rights, in stark contrast to President George W. Bush, a social conservative who often talked of a 'culture of life' -- code for opposition to abortion.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'stark contrast' and 'culture of life' with the explanation as 'code for opposition to abortion' implies a judgment and frames the issue in a way that favors Obama's stance on abortion rights over Bush's."
                },
                {
                    "text": "Critics call it the 'global gag rule' and the partisan tit-for-tat -- Democratic politicians tend to woo abortion rights advocates and Republicans generally appeal to opponents -- is expected to continue when Obama assumes office in January.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Describing the situation as 'partisan tit-for-tat' and the framing of Democrats 'wooing' advocates versus Republicans 'appealing' to opponents introduces a judgmental tone that suggests a negative view towards the Republican approach."
                },
                {
                    "text": "Abortion rights opponents, many of whom on religious grounds regard the procedure as murder, see any move on that front as the next shot in the abortion wars.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'abortion wars' and the assertion that opponents 'regard the procedure as murder' are emotionally charged and imply a conflict where one side's position is morally absolute, potentially marginalizing the complexity of the issue."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the topic of abortion rights, with a general tendency to frame the issue in a way that supports the stance of abortion rights activists and the Democratic Party over their opponents."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.05555555555555555,
            "overall_rating": 0.3277777777777778
        },
        "combined_score": 0.0
    },
    {
        "Title": "UPDATE 3-Obama lifts restrictions on abortion funding",
        "URL": "UPDATE 3-Obama lifts restrictions on abortion funding.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "  (adds background, reaction)      By Jeff Mason and Deborah Charles      WASHINGTON, Jan 23 (Reuters) - U.S. President Barack Obama  on Friday lifted restrictions on U.S. government funding for  groups that provide abortion services or counseling abroad,  reversing a policy of his Republican predecessor George W.  Bush, a spokesman said.      The Democratic president's decision was a victory for  advocates of abortion rights on an issue that in recent years  has become a tit-for-tat policy change each time the White  House shifts from one party to the other.      When the ban was in place, no U.S. government funding for  family planning services could be given to clinics or groups  that offer abortion services or counseling in other countries  even if the funds for those activities come from non-U.S.  government sources.      Obama signed an executive order lifting the restrictions on  Friday, a White House spokesman said.      It has been called the Mexico City Policy because it was  unveiled at a United Nations conference there in 1984 and  became one of the centerpiece social policies of the  conservative administration of former President Ronald Reagan,  a Republican.      Critics call it the 'gag rule' because it also cuts funds  to groups that advocate or lobby for the lifting of abortion  restrictions, so they say it infringes on free speech. They also  say it has reduced healthcare for some of the world's poorest  women.      Former President Bill Clinton, a Democrat, rescinded the  rule when he took office in January 1993 and his successor,  Republican George W. Bush, reinstated it in January 2001.           $400 MILLION ANNUALLY FOR OVERSEAS FAMILY PLANNING      When he reinstated it, Bush said taxpayer funds should not be  used to pay for or to advocate abortions.      Anti-abortion activists agreed with Bush and criticized the  move to lift the ban on funding.      'When we wake up every morning to a deepening financial  crisis, it is an insult to the American people to bail out the  abortion industry,' said Charmaine Yoest, president of  Americans United for Life.      'Planned Parenthood is a billion-dollar company and they do  not need additional resources to burden the American taxpayer,'  she added.      The United States spends more than $400 million on overseas  family planning assistance each year.      Critics of the funding ban say the anti-abortion  restrictions have resulted in huge drops for funding worldwide  to organizations that provide family-planning services and  basic healthcare. They say this means many women are deprived  of contraception and other health services in poor countries,  leading to back-alley abortions and deaths.      The Center for Reproductive Rights says, for example, that in  Ethiopia and Lesotho, some nongovernmental organizations are no  longer able to offer comprehensive and integrated healthcare  services to patients suffering from HIV/AIDS.      Abortion rights opponents and groups who support the Mexico  City Policy dispute the view that it has led to an increase of  illegal abortions or deaths overseas.      Unlike Clinton and Bush, Obama did not act on the rule on  the Jan. 22 anniversary of Roe v. Wade, the landmark 1973  Supreme Court ruling that made abortions legal throughout the  country.    (Additional reporting by Deborah Charles and Ed Stoddard,  editing by Vicki Allen)   ((deborah.charles@reuters.com;+1 202 789 8579; Reuters  Messaging: deborah.charles.reuters.com@reu",
        "Histogram": [
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0,
            0.6,
            0,
            0.6,
            0.6,
            0,
            0.7,
            0.7,
            0.5,
            0,
            0,
            0
        ],
        "Relevance": 14.912641525268555,
        "BiasReport": {
            "sentences": [
                {
                    "text": "It has been called the Mexico City Policy because it was unveiled at a United Nations conference there in 1984 and became one of the centerpiece social policies of the conservative administration of former President Ronald Reagan, a Republican.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'centerpiece social policies' and 'conservative administration' with positive connotations for Reagan's administration introduces a word choice bias, implying a judgment that this policy was significant and positive."
                },
                {
                    "text": "Critics call it the 'gag rule' because it also cuts funds to groups that advocate or lobby for the lifting of abortion restrictions, so they say it infringes on free speech. They also say it has reduced healthcare for some of the world's poorest women.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Referring to the policy as the 'gag rule' and stating it 'reduces healthcare for some of the world's poorest women' introduces a word choice bias by using emotionally charged language to evoke a negative perception of the policy."
                },
                {
                    "text": "When he reinstated it, Bush said taxpayer funds should not be used to pay for or to advocate abortions.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The sentence implies a judgment by using the phrase 'taxpayer funds should not be used to pay for or to advocate abortions,' which frames the issue in a way that supports the anti-abortion stance without presenting a balanced view."
                },
                {
                    "text": "'When we wake up every morning to a deepening financial crisis, it is an insult to the American people to bail out the abortion industry,' said Charmaine Yoest, president of Americans United for Life. 'Planned Parenthood is a billion-dollar company and they do not need additional resources to burden the American taxpayer,' she added.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of phrases like 'deepening financial crisis' and 'bail out the abortion industry' introduces emotional sensationalism bias, aiming to evoke a strong emotional response rather than presenting a neutral argument."
                },
                {
                    "text": "Critics of the funding ban say the anti-abortion restrictions have resulted in huge drops for funding worldwide to organizations that provide family-planning services and basic healthcare. They say this means many women are deprived of contraception and other health services in poor countries, leading to back-alley abortions and deaths.",
                    "bias_type": "Causal Misunderstanding Bias",
                    "bias_strength": 0.7,
                    "bias_description": "This sentence assumes a direct cause-and-effect relationship between the funding ban and negative outcomes such as 'back-alley abortions and deaths' without sufficient evidence, indicating a causal misunderstanding bias."
                },
                {
                    "text": "The Center for Reproductive Rights says, for example, that in Ethiopia and Lesotho, some nongovernmental organizations are no longer able to offer comprehensive and integrated healthcare services to patients suffering from HIV/AIDS.",
                    "bias_type": "Anecdotal Evidence Bias",
                    "bias_strength": 0.5,
                    "bias_description": "Relying on specific examples from Ethiopia and Lesotho to illustrate the impact of the policy introduces an anecdotal evidence bias, as it focuses on individual stories rather than broader, more representative evidence."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the topic of abortion funding, with a general bias tendency towards portraying the policy and its effects in a negative light. The biases identified include word choice bias, emotional sensationalism bias, causal misunderstanding bias, and anecdotal evidence bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.2631578947368421,
            "overall_rating": 0.43157894736842106
        },
        "combined_score": 0.0
    },
    {
        "Title": "UPDATE 2-Obama to lift restrictions on abortion funding",
        "URL": "UPDATE 2-Obama to lift restrictions on abortion funding.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "  (adds background, reaction)      By Matt Spetalnick      WASHINGTON, Jan 23 (Reuters) - U.S. President Barack Obama  on Friday will lift restrictions on U.S. government funding for  groups that provide abortion services or counseling abroad,  reversing a policy of his Republican predecessor George W.  Bush, an administration official said.      'It will be today. He's going to make an executive order  (lifting the global gag rule),' the official said.      The Democratic president's decision is a victory for advocates of  abortion rights on an issue that in recent years has become a  tit-for-tat policy change each time the White House shifts from one  party to the other.      When the ban was in place, no U.S. government funding for  family planning services could be given to clinics or groups  that offer abortion services or counseling in other countries  even if the funds for those activities come from non-U.S.  government sources.      It has been called the Mexico City Policy because it was  unveiled at a United Nations conference there in 1984 and  became one of the centerpiece social policies of the  conservative administration of former President Ronald Reagan,  a Republican.      Critics call it the 'gag rule' because it also cuts funds  to groups that advocate or lobby for the lifting of abortion  restrictions, so they say it infringes on free speech. They also say it  has reduced healthcare for some of the world's poorest women.      Former President Bill Clinton, a Democrat, rescinded the  rule when he took office in January 1993 and his successor,  Republican George W. Bush, reinstated it in January 2001.      When he reinstated it, Bush said taxpayer funds should not  be used to pay for or advocate abortions.      Anti-abortion activists agreed with Bush and criticized the  move to lift the ban on funding.      'When we wake up every morning to a deepening financial  crisis, it is an insult to the American people to bail out the  abortion industry,' said Charmaine Yoest, president of  Americans United for Life.      'Planned Parenthood is a billion dollar company and they do not  need additional resources to burden the American taxpayer,' she added.      The United States spends more than $400 million on overseas  family planning assistance each year.      Critics of the funding ban say the anti-abortion  restrictions have resulted in huge drops for funding worldwide  to organizations that provide family-planning services and  basic healthcare. They say this means many women are deprived  of contraception and other health services in poor countries,  leading to back-alley abortions and deaths.      The Center for Reproductive Rights says, for example, that  in Ethiopia and Lesotho, some non-governmental organizations  are no longer able to offer comprehensive and integrated healthcare  services to patients suffering from HIV/AIDS.      Abortion rights opponents and groups who support the Mexico  City Policy contest the view that it has led to an increase of  illegal abortions or deaths overseas.      Unlike Clinton and Bush, Obama did not act on the rule on  the Jan. 22 anniversary of Roe v. Wade, the landmark 1973  Supreme Court ruling that made abortions legal throughout the  country.    (Additional reporting by Deborah Charles and Ed Stoddard, editing by  Vicki Allen)   ((deborah.charles@reuters.com;+1 202 789 8579; Reuters  Messaging: deborah.charles.reuters.com@reuters.net))       Keywords: OBAMA/ABORTION        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0,
            0.6,
            0,
            0.6,
            0.6,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0
        ],
        "Relevance": 14.863340377807617,
        "BiasReport": {
            "sentences": [
                {
                    "text": "It has been called the Mexico City Policy because it was unveiled at a United Nations conference there in 1984 and became one of the centerpiece social policies of the conservative administration of former President Ronald Reagan, a Republican.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the term 'conservative administration' and 'Republican' carries a negative connotation, implying judgment about the administration's political stance."
                },
                {
                    "text": "Critics call it the 'gag rule' because it also cuts funds to groups that advocate or lobby for the lifting of abortion restrictions, so they say it infringes on free speech. They also say it has reduced healthcare for some of the world's poorest women.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The term 'gag rule' is emotionally charged and implies a negative judgment about the policy, suggesting it suppresses free speech and harms women's healthcare."
                },
                {
                    "text": "When he reinstated it, Bush said taxpayer funds should not be used to pay for or advocate abortions.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the phrase 'advocate abortions' carries a negative connotation, suggesting a judgment about the nature of the activities being funded."
                },
                {
                    "text": "'When we wake up every morning to a deepening financial crisis, it is an insult to the American people to bail out the abortion industry,' said Charmaine Yoest, president of Americans United for Life. 'Planned Parenthood is a billion dollar company and they do not need additional resources to burden the American taxpayer,' she added.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of phrases like 'bail out the abortion industry' and 'billion dollar company' are emotionally charged and imply a negative judgment about the organizations and the use of public funds."
                },
                {
                    "text": "Critics of the funding ban say the anti-abortion restrictions have resulted in huge drops for funding worldwide to organizations that provide family-planning services and basic healthcare. They say this means many women are deprived of contraception and other health services in poor countries, leading to back-alley abortions and deaths.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The language used to describe the impact of the funding ban, such as 'huge drops' and 'deprived of contraception and other health services', is designed to evoke strong emotions and may lack a balanced presentation of the issue."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the topic of abortion funding, with a general tendency towards using emotionally charged language and word choices that imply judgment about the policies and the involved parties."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.25,
            "overall_rating": 0.425
        },
        "combined_score": 0.0
    },
    {
        "Title": "McCain faces tough questions on abortion on U.S. TV",
        "URL": "McCain faces tough questions on abortion on U.S. TV.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Jason Szep      NEW YORK, Sept 12 (Reuters) - Republican presidential  candidate John McCain courted female voters on Friday with  appearances on TV shows popular with women, but prompted boos  from a studio audience while stressing opposition to abortion.      In reply to a question on ABC television talk show 'The  View,' McCain told the five women hosts and its live studio  audience that he believed the U.S. Supreme Court's legalization  of abortion 35 years ago was a mistake.      'I believe Roe v Wade was a very bad decision, it was a bad  decision,' he said of the 1973 decision that established a  woman's right to an abortion.      The mostly female audience, who had cheered many of the  Arizona senator's earlier comments, responded with boos to that  reply.      The question was posed by host Elisabeth Hasselbeck, an  abortion opponent and supporter of the Iraq war who told McCain  that he had her vote in his close race against Democratic  Illinois Sen. Barack Obama in the Nov. 4 election for the White  House.      He also faced pointed questions about his selection of  little-known Alaska Gov. Sarah Palin as his vice presidential  running mate and the McCain campaign's attempts to portray  their ticket as true agents of change in the election.      Host Barbara Walters interrupted McCain several times to  pin down what in Washington the 44-year-old self-described  'hockey mom' and conservative first-term governor of Alaska  would reform.      'The Republican Party. The Democratic Party. She's going to  reform all of Washington,' McCain said.      'What specifically?' Walters pressed, noting that McCain's  own party occupies the White House and has been in power in  Congress for much of the past eight years.      McCain won applause when speaking about his belief in God  and in the separation of church and state enshrined in the U.S.  Constitution. Host Whoopi Goldberg, an Oscar-winning actress,  asked if religion would guide him as president.      'Everyone, obviously, is entitled to their own faith,'  McCain said. 'I pray every day for guidance and to do the right  thing.'      McCain has aggressively courted undecided and independent  women voters, holding a round-table with women in the largely  Democratic city of Philadelphia on Wednesday and appearing on  two TV shows popular with women on Friday      After going on 'The View,' he taped the 'Rachael Ray Show,'  a popular daytime talk show and life style program where he  fielded questions in a studio kitchen and grilled ribs while  dressed in an apron that read 'kiss the candidate.' The show  will air Sept. 22.      The appearances are aimed in part at drawing disaffected  supporters of Democratic New York Sen. Hillary Clinton, who  lost a bruising primary to Obama.      McCain said he and his wife, Cindy, who also appeared on  'The View,' did not share Palin's more conservative view that  there should not be exceptions to his stand on abortion in  cases of rape and incest.      A Washington Post/ABC News survey published on Tuesday  found much of McCain's improvement in the polls since the  Republican National Convention ended Sept. 4 was due to a big  shift in support among white women voters.   (Editing by David Wiessler)    ((For more about the U.S. political campaign, visit Reuters  'Tales from the Trail: 2008' online at  http:/blogs.reuters.com/trail08/))   ((For a TAKE A LOOK on the campaign click on [US/VOTE]))   ((jason.szep@reuters.com; +1 617 367 4142; Reu",
        "Histogram": [
            0,
            0,
            0.6,
            0.6,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0,
            0,
            0
        ],
        "Relevance": 13.732303619384766,
        "BiasReport": {
            "sentences": [
                {
                    "text": "'I believe Roe v Wade was a very bad decision, it was a bad decision,' he said of the 1973 decision that established a woman's right to an abortion.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the phrase 'a very bad decision' carries a negative connotation towards the landmark ruling, implying a judgment that may influence the reader's perception."
                },
                {
                    "text": "The mostly female audience, who had cheered many of the Arizona senator's earlier comments, responded with boos to that reply.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The framing of the audience as 'mostly female' and the contrast with their earlier positive reactions before the boos introduces a subtle bias by suggesting a gender-based disagreement with McCain's stance on abortion."
                },
                {
                    "text": "He also faced pointed questions about his selection of little-known Alaska Gov. Sarah Palin as his vice presidential running mate and the McCain campaign's attempts to portray their ticket as true agents of change in the election.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Describing the questions as 'pointed' implies a critical or challenging tone, suggesting skepticism towards the legitimacy of Palin's candidacy and the campaign's messaging."
                },
                {
                    "text": "McCain won applause when speaking about his belief in God and in the separation of church and state enshrined in the U.S. Constitution.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The sentence implies a positive, affirming reaction to McCain's stance on the separation of church and state, potentially influencing the reader's perception of the event's significance."
                },
                {
                    "text": "The appearances are aimed in part at drawing disaffected supporters of Democratic New York Sen. Hillary Clinton, who lost a bruising primary to Obama.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The description of the primary as 'bruising' suggests a particularly negative or damaging contest, which may bias the reader's view of the primary's impact and the subsequent political landscape."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the topics of abortion, gender dynamics in political discourse, the qualifications of political candidates, the role of religion in politics, and the portrayal of political primaries. The general bias tendency leans towards presenting certain viewpoints and events in a manner that could influence the reader towards specific judgments or interpretations."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.08695652173913043,
            "overall_rating": 0.34347826086956523
        },
        "combined_score": 0.0
    },
    {
        "Title": "UPDATE 1-McCain faces tough questions on abortion on U.S. TV",
        "URL": "UPDATE 1-McCain faces tough questions on abortion on U.S. TV.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "  (Adds McCain defending advertisements, paragraphs 7-10)      By Jason Szep      NEW YORK, Sept 12 (Reuters) - Republican presidential  candidate John McCain courted female voters on Friday with  appearances on TV shows popular with women, but prompted boos  from a studio audience while stressing opposition to abortion.      In reply to a question on ABC television talk show 'The  View,' McCain told the five women hosts and its live studio  audience he believed the U.S. Supreme Court's legalization of  abortion 35 years ago was a mistake.      'I believe Roe v Wade was a very bad decision, it was a bad  decision,' he said of the 1973 decision that established a  woman's right to an abortion.      The mostly female audience, who had cheered many of the  Arizona senator's earlier comments, responded with boos.      The question was posed by host Elisabeth Hasselbeck, an  abortion opponent and supporter of the Iraq war who told McCain  he had her vote in his close race against Democratic Illinois  Sen. Barack Obama in the Nov. 4 election.      He also faced pointed questions about his selection of  little-known Alaska Gov. Sarah Palin as his vice presidential  running mate and the McCain campaign's attempts to portray  their ticket as true agents of change in the election.      And he came in for fire over advertisements that  independent fact-checkers say distort Obama's positions,  including one that said Obama was referring to Palin when he  used a colloquial expression about putting 'lipstick on a pig,'  and another claiming Obama wants sex education for children.      'They're lies,' host Joy Behar said.      McCain defended them as accurate. 'Sen. Obama chooses his  words very carefully. He shouldn't have said it,' McCain said  of the lipstick comment. Obama says he was referring to the  economic policies of McCain and Palin.      Host Barbara Walters interrupted McCain several times to  pin down what in Washington the 44-year-old self-described  'hockey mom' and conservative first-term governor of Alaska  would reform.      'The Republican Party. The Democratic Party. She's going to  reform all of Washington,' McCain said.      'What specifically?' Walters pressed, noting that McCain's  own party occupies the White House and has been in power in  Congress for much of the past eight years.      McCain won applause when speaking about his belief in God  and the separation of church and state enshrined in the U.S.  Constitution. Host Whoopi Goldberg, an Oscar-winning actress,  asked if religion would guide him as president.      'Everyone, obviously, is entitled to their own faith,'  McCain said.      McCain has aggressively courted undecided and independent  women voters, holding a round-table with women in the largely  Democratic city of Philadelphia on Wednesday and appearing on  two TV shows popular with women on Friday      After going on 'The View,' he taped the 'Rachael Ray Show,'  a popular daytime talk show, lifestyle and cooking program,  where he fielded questions in a studio kitchen and grilled ribs  while dressed in an apron that read 'kiss the candidate.' The  show will air Sept. 22.      The appearances are aimed in part at attracting disaffected  supporters of Democratic New York Sen. Hillary Clinton, who  lost a bruising primary to Obama.      A Washington Post/ABC News survey published on Tuesday  found much of McCain's improvement in the polls since the  Republican National Convention ended Sept. 4 was due to a big ",
        "Histogram": [
            0,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0,
            0.9,
            0.6,
            0,
            0,
            0,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 12.980513572692871,
        "BiasReport": {
            "sentences": [
                {
                    "text": "The mostly female audience, who had cheered many of the Arizona senator's earlier comments, responded with boos.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'mostly female audience' and the contrast with 'cheered' and 'boos' implies a judgment about the audience's reaction based on gender, suggesting a stereotype about women's views on abortion."
                },
                {
                    "text": "The question was posed by host Elisabeth Hasselbeck, an abortion opponent and supporter of the Iraq war who told McCain he had her vote in his close race against Democratic Illinois Sen. Barack Obama in the Nov. 4 election.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The sentence emphasizes Hasselbeck's political stance and support for McCain, which could imply a bias by highlighting her alignment with McCain's views, particularly on controversial issues like abortion and the Iraq war."
                },
                {
                    "text": "He also faced pointed questions about his selection of little-known Alaska Gov. Sarah Palin as his vice presidential running mate and the McCain campaign's attempts to portray their ticket as true agents of change in the election.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Describing the questions as 'pointed' suggests a critical or challenging tone, which could imply a bias against the McCain campaign's portrayal of Palin and their overall election strategy."
                },
                {
                    "text": "'They're lies,' host Joy Behar said.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This sentence directly presents the host's opinion as a fact, without providing evidence to support the claim that the advertisements are indeed 'lies.' This blurs the line between opinion and objective reporting."
                },
                {
                    "text": "McCain defended them as accurate.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'defended' implies a defensive posture, suggesting that McCain's position is contentious or in need of defense, which could subtly bias the reader against his stance on the accuracy of the advertisements."
                },
                {
                    "text": "Host Barbara Walters interrupted McCain several times to pin down what in Washington the 44-year-old self-described 'hockey mom' and conservative first-term governor of Alaska would reform.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The repetition of 'interrupted' and the detailed description of Palin using her self-description as a 'hockey mom' could imply a dismissive or skeptical attitude towards Palin's qualifications, reflecting a bias in the framing of the question."
                },
                {
                    "text": "McCain won applause when speaking about his belief in God and the separation of church and state enshrined in the U.S. Constitution. Host Whoopi Goldberg, an Oscar-winning actress, asked if religion would guide him as president.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The mention of applause and the specific introduction of Whoopi Goldberg's credentials before her question could suggest a bias by highlighting the audience's positive reaction and Goldberg's authority, potentially framing the question in a way that implies skepticism about the separation of church and state in McCain's case."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the topics of abortion, political campaign strategies, and the qualifications of political figures, with a general bias tendency towards framing certain viewpoints and individuals in a negative or contentious light."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6428571428571429,
            "percentage_of_biased_sentences": 0.14814814814814814,
            "overall_rating": 0.3955026455026455
        },
        "combined_score": 0.0
    },
    {
        "Title": "PRESS DIGEST - Washington Post - Nov 18",
        "URL": "PRESS DIGEST - Washington Post - Nov 18.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    WASHINGTON, Nov 18 (Reuters) - The Washington Post included  the following items on its front page on Tuesday. Reuters has  not verified these stories and does not vouch for their  accuracy.      ---      With his 30-month tenure nearing its end, U.S. Treasury  Secretary Henry Paulson is leaving behind a legacy of federal  interventionism that few would have expected from this former  head of the investment giant Goldman Sachs.      ---      Just weeks before leaving office, the Interior Department's  top lawyer has shifted half a dozen key deputies, including two  former political appointees involved in controversial  environmental decisions, into senior civil service posts.      ---      District of Columbia and federal officials are preparing  for as many as 4 million people for the inauguration of  President-elect Barack Obama, a crowd that would be three or  four times larger than previous big events on the Mall.      ---      Frustrated by the failure to overturn the landmark Roe v.  Wade ruling, a growing number of anti-abortion pastors,  conservative academics and activists are setting aside efforts  to outlaw abortion and instead are focusing on building social  programs and developing other assistance for pregnant women to  reduce the number of abortions.      ---  ",
        "Histogram": [
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0
        ],
        "Relevance": 12.360074996948242,
        "BiasReport": {
            "sentences": [
                {
                    "text": "With his 30-month tenure nearing its end, U.S. Treasury Secretary Henry Paulson is leaving behind a legacy of federal interventionism that few would have expected from this former head of the investment giant Goldman Sachs.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the term 'federal interventionism' carries a negative connotation, implying excessive government involvement in the economy, which could influence the reader's perception negatively towards Paulson's actions."
                },
                {
                    "text": "Just weeks before leaving office, the Interior Department's top lawyer has shifted half a dozen key deputies, including two former political appointees involved in controversial environmental decisions, into senior civil service posts.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'involved in controversial environmental decisions' suggests a negative judgment on the actions of the political appointees, implying wrongdoing without providing evidence, which could bias the reader against them."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias through the use of word choice, particularly in describing government actions and the decisions of political appointees in the Interior Department. The general bias tendency leans towards portraying these actions in a negative light, potentially influencing the reader's perception."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.14285714285714285,
            "overall_rating": 0.37142857142857144
        },
        "combined_score": 0.0
    },
    {
        "Title": "FACTBOX-Abortion law around the world",
        "URL": "FACTBOX-Abortion law around the world.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    April 25 (Reuters) - Britain will mark the 40th anniversary  of the day the Abortion Act came into force on April 28, 1968.      Studies by the Guttmacher Institute and the World Health  Organisation, published last October, show the number of  abortions worldwide fell to less than 42 million in 2003 from 46  million in 1995.      Here is an overview of the abortion law in some countries:      UNITED KINGDOM - Abortion has been legal in Britain since  1968 for pregnancies up to 24 weeks. The British law does not  apply to Northern Ireland, which retains many restrictions on  abortion.      CHINA - The world's most populous country with 1.2 billion  people, China limits most families to one child and encourages  abortion as a way of controlling population growth.      INDIA - With a population of more than 1 billion, India  allows abortion within the first 12 weeks of pregnancy if a  qualified doctor says it is necessary to save the mother's life.      -- If the pregnancy is more than 12 weeks but less than 20,  two registered medical practitioners must agree an abortion is  necessary. The written consent of the woman, or of the guardian  if the woman is under 18 or mentally challenged, is required for  an abortion.      AUSTRALIA - Abortion is not legal in six states and two  territories, but is officially allowed if a woman's life is at  risk. Many women circumvent the law using 1960s and 1970s common  law rulings which permit abortion on social and economic  grounds. Restrictions on abortion vary by jurisdiction and women  are allowed abortion on demand in the state of Western  Australia.      EUROPE - The legal abortion period is 10 weeks in France,  Greece, Denmark, Norway and Portugal, 12 weeks in Germany,  Belgium and Austria and 22 to 24 weeks in Britain, Spain,  Switzerland and the Netherlands. Malta, Ireland and Poland still  have highly restrictive abortion laws.      ITALY - Abortion was legalised in Italy in 1978 and upheld  in a referendum in 1981. The law allows abortion on demand in  the first 12 weeks of pregnancy and until the 24th week if the  mother's life is at risk or the foetus is seriously malformed.      RUSSIA - Russia was the first country to legalise abortion  in 1920, although the law was repealed in 1936 and abortion  remained illegal until 1955. Abortion requires the consent of  the pregnant woman and should be performed by a licensed  physician in a hospital. It is allowed on request during the  first 12 weeks of pregnancy, and between 12 and 28 weeks from  conception on judicial, genetic, vital, broad medical and social  grounds, and for personal reasons with the special authorisation  of a commission of local physicians.      POLAND - The 1993 law allows abortion only if pregnancy  threatens a woman's life or health, results from rape or incest,  or if the foetus is irreparably damaged. In 1996 it was  liberalised to allow women to end a pregnancy before the 12th  week because of poverty or other social problems.      MUSLIM COUNTRIES - Islam bans the abortion of a living  foetus, but some countries like Syria allow abortion in cases  where there is a pressing medical need, such as a danger to the  mother's health.      ISRAEL - A woman may terminate a pregnancy if she is not  married, or if the pregnancy is the outcome of rape or poses  health risks. Abortions are also allowed for women younger than  17 or older than 40.      SOUTH KOREA - The law allows abortion only if the mother's  health is at r",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 11.913335800170898,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it provides a factual overview of abortion laws around the world without presenting information in a way that supports a particular narrative or viewpoint."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "U.S. abortion rate falls, study finds",
        "URL": "U.S. abortion rate falls, study finds.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    WASHINGTON, Jan 17 (Reuters) - The U.S. abortion rate has  fallen to its lowest level since 1976, with about 20 percent of  pregnancies being terminated by abortion, the nonprofit Alan  Guttmacher Institute reported on Thursday.      Its survey of all known abortion providers found the  abortion rate fell 9 percent between 2000 and 2005, probably  due to a combination of better access to contraception and less  access to abortion providers, the group said.      'Slightly more than one in five pregnancies end in  abortion, indicating that unwanted pregnancy is still too  common in the United States,' the report reads.      The report is the first snapshot since 2000 of what remains  one of the most contentious political and ethical issues in the  United States -- whether women should be able to get abortions.  While it remains legal, some states have passed laws designed  to make it more difficult to get an abortion.      'More needs to be done to help women and their partners  prevent unintended pregnancy,' a team of experts led by the  institute's Rachel Jones wrote in the report.      'For example, more women and couples need access to  resources and services that will help them to better plan when  they want to have children and how to use contraceptive methods  effectively until that time,' the report said.      'In addition, it is important to remove barriers to  abortion services -- particularly for lower income women, who  have above-average rates of unintended pregnancy.'      They used surveys from all abortion providers they could  find along with data from the U.S. Census Bureau to calculate  rates.      'An estimated 1.2 million abortions were performed in the  United States in 2005, 8 percent fewer than in 2000,' they  wrote. 'The abortion rate in 2005 was 19.4 per 1,000 women aged  15 to 44; this rate represents a 9 percent decline from 2000.'      They found that 1,787 doctors, clinics and hospitals  provide abortion, just 2 percent fewer than in 2000. But 87  percent of U.S. counties had no abortion provider, meaning  women often must travel to get one.      Women can get abortions surgically or by using a  combination of drugs to induce a miscarriage. The report found  that using the drugs accounted for 13 percent of all  abortions.      The institute, set up to study and report on reproductive  health in the United States, said no one had reported on the  abortion rate since 2000.      'Abortion is one of the most common medical procedures  undergone by women aged 15-44 in the United States, partly  because of the high level of unintended pregnancy,' Jones and  colleagues wrote.      'About half of the 6.4 million pregnancies that occurred  in 2000 (including those ending in miscarriages) were  unintended, and about half of these resulted in abortion,' they  wrote.      The researchers said the number of abortion providers  declined by about 38 percent between 1982 and 2000, but that  appeared to be leveling off.     (Reporting by Maggie Fox; editing by David Wiessler)      ((Maggie.Fox@Reuters.com; 1 202 898 8492))  Keywords: ABORTION USA/       ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 11.772390365600586,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides a factual report on the U.S. abortion rate, discussing the findings of the nonprofit Alan Guttmacher Institute without introducing any subjective or misleading information."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Rugby-Former Wallaby Roe announces retirement",
        "URL": "Rugby-Former Wallaby Roe announces retirement.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    BRISBANE, Australia, July 30 (Reuters) - Former Australian  and Queensland number eight John Roe announced his retirement  from rugby on Wednesday due to a persistent shoulder injury.      The 31-year-old played 19 tests for the Wallabies and  represented Queensland 107 times.      'I'd love nothing more than to be part of this team  (Queensland) again next year, but not at the risk of being a  passenger for all or part of the season,' he said.      'It's better for everyone if I make the call now.      'When I first started playing rugby I never thought I would  represent the Reds and to have played over 100 games is an  absolute honour.'      Roe, a qualified doctor, made his debut for the Wallabies at  the 2003 Rugby World Cup. He said he would now concentrate on  his medical career.      (Reporting by Andrew Stevens, editing by Alan Baldwin)      ((alan.baldwin@reuters.com +44 2075427933; Reuters  Messaging: alan.baldwin.reuters.com@reuters.net; For the latest  Reuters Premier League and international football news see:  http://football.uk.reuters.com))      Please double-click on the newslink below:      [RUGU-LEN] for stories on rugby    Keywords: RUGBY AUSTRALIA/ROE       ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 11.72610855102539,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides a factual account of former Wallaby John Roe's retirement from rugby due to a persistent shoulder injury, including his personal statement and future career plans. There are no indications of bias regarding the reported information."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Mexico's supreme court upholds abortion law",
        "URL": "Mexico's supreme court upholds abortion law.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    MEXICO CITY, Aug 28 (Reuters) - Mexico's Supreme Court on  Thursday upheld a law allowing abortion in the nation's  capital, in a victory for leftist city lawmakers over  conservative President Felipe Calderon's government and the  Catholic Church.      In an 8-3 vote, judges said there were no grounds to  overturn a law approved in 2007 by the Mexico City assembly  that legalized abortions on demand during the first trimester  and established free public clinics.      The landmark decision could open the door for other states  in Mexico, the world's second most populous Catholic country,  to follow the capital's lead in relaxing laws that criminalize  abortion, legal experts said.      The judges found that Mexico's constitution did not  explicitly guarantee the right to life of the fetus, and that  the interests of the unborn had to be balanced with those of  women seeking an abortion.        While Calderon stayed largely on the sidelines of the  battle, his attorney-general's office and the National Human  Rights Commission sought to reintroduce a ban on abortion.     (Reporting by Michael O'Boyle, Editing by Sandra Maler)    ((michael.oboyle@thomsonreuters.com; +5255-5282-7153; Reuters  Messaging: michael.oboyle.reuters.com@reuters.net))  Keywords: MEXICO ABORTION/        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 11.327051162719727,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to exhibit bias. It provides a factual report on the Mexico Supreme Court's decision to uphold the abortion law in the nation's capital, presenting information on the legal aspects and the involved parties without introducing any biased language or perspectives."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Canadian court upholds limits on abortion protests",
        "URL": "Canadian court upholds limits on abortion protests.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    VANCOUVER, British Columbia, Sept 4 (Reuters) - A Canadian  appeals court on Thursday upheld a provincial 'bubble zone' law  that limited protests around abortion clinics in British  Columbia.      The three-judge panel rejected the claims of anti-abortion  activists and civil libertarians that the law violated rights  of free expression by stopping protesters from talking to women  entering the clinics.      'The objective of the act justifies the limited  infringement of freedom of expression in the circumstances,'  British Columbia Court of Appeals justice Catherine Anne Ryan  wrote in the unanimous ruling.      The law passed in 1995 created a 50-meter zone around  abortion clinics in which protests against the facilities were  not allowed. Its supporters argue it is needed to protect  patients and medical staff.      Two western Canadian anti-abortion activists, Donald Spratt  and Gordon Watson, violated the law in 1998 outside the  Everywoman's Health Clinic in an effort to have the law struck  down by the courts.      The men argued unsuccessfully that protection zone was too  large and that even if it had been needed at the time it was  enacted it was no longer necessary because the tone of  anti-abortion protests had changed.      (Reporting Allan Dowd, Editing by Frank McGurty)      ((allan.dowd@thomsonreuters.com; 1+604 664 7314; Messaging:  allan.dowd.reuters.com@reuters.com))       Keywords: CANADA ABORTION/       ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 11.209074020385742,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides a factual report on a Canadian appeals court upholding a provincial 'bubble zone' law that limits protests around abortion clinics in British Columbia, including the arguments and the ruling. The language used is neutral and does not exhibit any of the typical biases discussed."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Rugby-Roe replaced by Cordingley as Queensland captain",
        "URL": "Rugby-Roe replaced by Cordingley as Queensland captain.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    SYDNEY, March 10 (Reuters) - Queensland Reds loose forward  John Roe has been replaced as captain by scrumhalf Sam  Cordingley, coach Phil Mooney said on Monday.      'John Roe has held the side together through the tough times  and carried a larger share of the burden than should reasonably  be asked of any single player,' Mooney said in a statement.      'We have taken this difficult decision now because we  believe it can help re-focus John and the team in their pursuit  of success in 2008.'       Queensland have won just one of their four Super 14 games  this season.      'Phil and I discussed it this morning and agreed that a  change of leadership was in the best interests of the team,' Roe  said.      'It has been a great honour to captain Queensland and I look  forward to continuing to serve the team and Queensland rugby in  whatever capacity I can.'      Roe has played 101 games for the Reds and captained the side  for the previous three seasons. He replaced Elton Flatley in the  job in 2005 when the former Wallaby centre was forced to retire  through injury and stand-in captain Nathan Sharpe said he was  leaving the side to play for the Western Force.    (Reporting by Greg Stutchbury in Wellington; Editing by Justin  Palmer)      ((greg.stutchbury@reuters.com; +64 210 694-370; Reuters  messaging: greg.stutchbury.reuters.com@reuters.net; For the  latest Reuters Premier League and international football news  see: http://football.uk.reuters.com/))      Please double-click on the newslinks below:      [RUGU-LEN] for more rugby stories      [RUGU-LEN-AU] for more stories on Australian rugby     Keywords: RUGBY SUPER/REDS       ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 11.20062255859375,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it primarily reports on a sports team's decision to change its captain, providing statements from the coach and the player involved without introducing any subjective or misleading information."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Spanish abortion clinics strike over crackdown",
        "URL": "Spanish abortion clinics strike over crackdown.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Ben Harding      MADRID, Jan 8 (Reuters) - Spanish abortion clinics began a  week-long strike on Tuesday, criticising the government for what  they said was harassment since a series of police raids on  Barcelona centres accused of illegal abortions.      More than 1,000 women will be unable to have an abortion  this week after 31 private clinics shut their doors to all cases  except for those when the mother's health was at risk, said a  spokeswoman for abortion clinic association ACAI. The 31 clinics  performed most of Spain's 101,592 abortions in 2006, ACAI said.      Late last year Barcelona police arrested 13 people, many of  them gynaecologists and anaesthetists, in raids against clinics  accused of performing illegal, late-term abortions.      ACAI spokeswoman Francisca Garcia said the government had  increased intrusive inspections against its members even though  none of its members were involved in the raids. Spain's health  minister had ignored requests for talks, she said.      Spain's health ministry was not immediately available to  comment on the accusation.      'We think the number and manner of inspections is abusive,'  Garcia said, adding that so many inspections, three times the  norm in some clinics, violated the privacy of patients and was a  slur on the professionalism of staff.      Spain decriminalised abortion in 1985, 10 years after the  death of conservative dictator Francisco Franco, but while the  number of abortions has doubled in the last decade, the practice  is controversial in the traditionally Catholic country.      Abortion is only permitted in certain cases, for example up  to 12 weeks for women who have been raped or up to 22 weeks if a  foetus is malformed. It is also available if a birth poses a  psychological risk to the mother.      One of those detained in the raids was Peruvian doctor  Carlos Morin, who was shown in a television programme appearing  to offer an abortion to an undercover Danish journalist who was  eight months pregnant in return for 4,000 euros.      The police findings triggered indignation in conservative  media.      But some members of the governing Socialist Party said  abortion laws should be further liberalised. Prime Minister Jose  Luis Rodriguez Zapatero, facing a tight contest in March general  elections, rejected this.      Last month the windows of a clinic in Madrid were smashed by  masked attackers and staff across Spain have reported a rise in  threats against them, Garcia said.      'After 22 years of exercising this right a shadow of doubt  has started to appear over our professionalism,' she said.   (Reporting by Ben Harding; editing by Elizabeth Piper)   ((ben.harding@reuters.com; +34 91 585 8530; Reuters Messaging:  ben.harding.reuters.com@reuters.net))    Keywords: SPAIN ABORTION/       ",
        "Histogram": [
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0.5,
            0.5,
            0.6,
            0,
            0
        ],
        "Relevance": 11.14250373840332,
        "BiasReport": {
            "sentences": [
                {
                    "text": "More than 1,000 women will be unable to have an abortion this week after 31 private clinics shut their doors to all cases except for those when the mother's health was at risk, said a spokeswoman for abortion clinic association ACAI. The 31 clinics performed most of Spain's 101,592 abortions in 2006, ACAI said.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The sentence uses language that could evoke strong emotions by highlighting the number of women affected and the significant role of the closed clinics, potentially aiming to provoke a strong reaction against the government's actions."
                },
                {
                    "text": "Late last year Barcelona police arrested 13 people, many of them gynaecologists and anaesthetists, in raids against clinics accused of performing illegal, late-term abortions.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the word 'arrested' and the specific mention of 'gynaecologists and anaesthetists' could imply a negative connotation and judgment, potentially influencing the reader's perception of the individuals and the severity of the situation."
                },
                {
                    "text": "ACAI spokeswoman Francisca Garcia said the government had increased intrusive inspections against its members even though none of its members were involved in the raids. Spain's health minister had ignored requests for talks, she said.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The choice of words such as 'intrusive inspections' and 'ignored' suggests a negative portrayal of the government's actions, possibly leading the reader to view the government's behavior in a more critical light without presenting a balanced perspective."
                },
                {
                    "text": "But some members of the governing Socialist Party said abortion laws should be further liberalised. Prime Minister Jose Luis Rodriguez Zapatero, facing a tight contest in March general elections, rejected this.",
                    "bias_type": "Political Bias",
                    "bias_strength": 0.5,
                    "bias_description": "The sentence implies a political motive for the Prime Minister's stance on abortion laws, suggesting that his rejection of further liberalization is solely due to the upcoming elections, which could undermine the complexity of the issue."
                },
                {
                    "text": "Last month the windows of a clinic in Madrid were smashed by masked attackers and staff across Spain have reported a rise in threats against them, Garcia said.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The mention of violent acts and threats against clinic staff is likely to evoke strong emotions and create a sense of urgency or crisis, potentially biasing the reader towards a more sympathetic view of the clinics and their cause."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the topic of abortion in Spain, with a general tendency to use emotional language and selective word choices to evoke a strong, potentially negative, reaction towards the government's actions and policies, as well as to portray the clinics and their staff in a sympathetic light."
            }
        },
        "Scores": {
            "average_bias_strength": 0.58,
            "percentage_of_biased_sentences": 0.2222222222222222,
            "overall_rating": 0.4011111111111111
        },
        "combined_score": 0.0
    },
    {
        "Title": "UPDATE 2-Mexico's Supreme Court backs abortion law",
        "URL": "UPDATE 2-Mexico's Supreme Court backs abortion law.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "  (Adds protest, Church response, details)      By Michael O'Boyle      MEXICO CITY, Aug 28 (Reuters) - Mexico's Supreme Court on  Thursday upheld a law allowing abortion in the capital, handing  a victory to leftist city lawmakers over conservative President  Felipe Calderon's government and the Roman Catholic Church.      In an 8-3 vote, judges said there were no grounds to  overturn a law approved in 2007 by the Mexico City assembly  that legalized abortions on demand during the first trimester  and established free public clinics.      The bells of the cathedral in the capital's historic Zocalo  square pealed in mourning.      The court's ruling was applauded by women's rights  advocates, who have campaigned for decades to legalize abortion  in the world's second most-populous Catholic country.      The landmark decision could open the door for other states  in Mexico to follow the capital's lead in relaxing laws that  criminalize abortion, legal experts said.      'This is a triumph of the recognition of women's  fundamental rights,' said Maria Luisa Sanchez, director of  abortion rights advocacy group GIRE. 'It will surely establish  a precedent for Mexico, for the other states and for the region  of Latin America.'      A small group of young anti-abortion activists gathered  outside the court, chanting 'Yes To Life. No To Abortion.'      'No court can contradict the supreme law of God that orders  us: thou shalt not kill,' Mexico's top Catholic churchman,  Cardinal Norberto Rivera, said in a statement.      Church leaders had initially threatened to excommunicate  city officials belonging to the leftist Party of the Democratic  Revolution who sponsored the law.           'LAW OF GOD'      The court's ruling was a political boost for Mexico City's  leftist mayor, Marcelo Ebrard, who is grooming himself for a  possible presidential bid in 2012.      Ebrard has supported a series of measures that have angered  church leaders, including gay civil unions and a statute  allowing the terminally ill to refuse treatment.      In their ruling, the judges found that Mexico's  constitution did not explicitly guarantee the right to life of  the fetus, and that the interests of the unborn had to be  balanced with those of women seeking an abortion.      Abortion is currently only allowed outside the capital   under special circumstances, such as in the case of rape or  when the woman's life is in danger. Pro-abortion campaigners  complain that some doctors in public hospitals in Mexico City  have refused to carry out abortions despite the law.      While Calderon stayed largely on the sidelines of the  battle, his attorney-general and the National Human Rights  Commission sought to reintroduce a ban on abortion.      Last month, a congressional committee in Brazil voted down  a bill that would have legalized abortion in the world's most  populous Catholic country.      The leftist government in Ecuador is attempting to pass a  new constitution that Church leaders claim could pave the way  toward legalizing abortion.   (Editing by Kieran Murray)   ((michael.oboyle@thomsonreuters.com; +5255-5282-7153; Reuters  Messaging: michael.oboyle.reuters.com@reuters.net))  Keywords: MEXICO ABORTION/        ",
        "Histogram": [
            0,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.5,
            0,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 11.064678192138672,
        "BiasReport": {
            "sentences": [
                {
                    "text": "The bells of the cathedral in the capital's historic Zocalo  square pealed in mourning.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence uses emotionally charged language to describe the reaction of the cathedral's bells to the court's ruling, implying a negative and dramatic impact of the decision on the Church without providing a balanced perspective."
                },
                {
                    "text": "'No court can contradict the supreme law of God that orders  us: thou shalt not kill,' Mexico's top Catholic churchman,  Cardinal Norberto Rivera, said in a statement.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the phrase 'supreme law of God' and the command 'thou shalt not kill' employs strong religiously charged language, influencing the reader's perception and implying a judgment about the court's decision."
                },
                {
                    "text": "Church leaders had initially threatened to excommunicate  city officials belonging to the leftist Party of the Democratic  Revolution who sponsored the law.",
                    "bias_type": "Political Bias",
                    "bias_strength": 0.5,
                    "bias_description": "This sentence highlights the Church's political power and its conflict with the leftist Party of the Democratic Revolution, suggesting a bias by framing the issue in a way that portrays the Church's actions as politically significant."
                },
                {
                    "text": "In their ruling, the judges found that Mexico's  constitution did not explicitly guarantee the right to life of  the fetus, and that the interests of the unborn had to be  balanced with those of women seeking an abortion.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The choice of words such as 'interests of the unborn' and 'balanced' implies a judgment and a specific perspective on the abortion issue, suggesting a bias in how the court's reasoning is presented."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the topic of abortion in Mexico, with a general tendency towards Emotional Sensationalism, Word Choice, Political, and Religious Bias. The biases are evident in the framing of the court's decision, the reactions of the Church, and the language used to describe the legal and moral aspects of the abortion debate."
            }
        },
        "Scores": {
            "average_bias_strength": 0.575,
            "percentage_of_biased_sentences": 0.1,
            "overall_rating": 0.33749999999999997
        },
        "combined_score": 0.0
    },
    {
        "Title": "Portugal violated right in abortion ship ban-court",
        "URL": "Portugal violated right in abortion ship ban-court.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Catherine Hornby      AMSTERDAM, Feb 4 (Reuters) - Portugal violated the right to  freedom of expression when it deployed a warship to prevent a  Dutch ship with an abortion clinic on board from entering its  waters in 2004, the European Court of Human Rights said.      Portugal, which lifted restrictions on abortion in 2007,  barred the ship operated by the Dutch Women on Waves  organisation on the basis of maritime and health laws and  imposed a naval blockade to keep it out of its domestic waters.      The court said on Tuesday that while it recognised  Portugal's aims to prevent disorder and protect health, it  concluded that the right to freedom of expression was violated  because the reaction was disproportionate to the aims pursued.      It highlighted 'the deterrent effect for freedom of  expression in general of such a radical act as dispatching a  warship'. Authorities could have resorted to other means such as  seizing the medicines on board the Dutch ship, it said.      The Portuguese Foreign Ministry was not available for  comment. The Socialist government eased abortion laws in 2007,  allowing pregnancies to be terminated in the first 10 weeks.      Women on Waves operates an on-board clinic to offer an  abortion pill in international waters to women in countries  where terminations are illegal or restricted.      At the time of its voyage to Portugal, abortion was legal in  the traditionally Catholic country only when the mother's life  was in danger and in a few other specific cases.      Women on Waves, which says a woman dies every eight minutes  due to an illegal abortion, had planned the visit to Portugal to  give information and sexual education and encourage a change to  the abortion laws, it said in a statement after the ruling.      It has sailed to other European countries with restrictive  abortion laws such as Ireland and Poland and in 2008 it also  campaigned in Ecuador in South America.      (Editing by Angus MacSwan)      ((catherine.hornby@reuters.com; + 31 20 504 5009; Reuters  Messaging: catherine.hornby.reuters.com@reuters.net))    Keywords: PORTUGAL ABORTION/       ",
        "Histogram": [
            0.6,
            0,
            0.7,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 11.045634269714355,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Portugal violated the right to freedom of expression when it deployed a warship to prevent a Dutch ship with an abortion clinic on board from entering its waters in 2004, the European Court of Human Rights said.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the word 'deployed a warship' carries a negative connotation and implies a heavy-handed or aggressive approach, which could influence the reader's perception negatively towards Portugal's actions."
                },
                {
                    "text": "The court said on Tuesday that while it recognised Portugal's aims to prevent disorder and protect health, it concluded that the right to freedom of expression was violated because the reaction was disproportionate to the aims pursued.",
                    "bias_type": "Causal Misunderstanding Bias",
                    "bias_strength": 0.7,
                    "bias_description": "This sentence implies a direct cause-and-effect relationship between the violation of freedom of expression and the disproportionate reaction, without considering other factors that might have led to Portugal's decision."
                },
                {
                    "text": "It highlighted 'the deterrent effect for freedom of expression in general of such a radical act as dispatching a warship'. Authorities could have resorted to other means such as seizing the medicines on board the Dutch ship, it said.",
                    "bias_type": "False Dichotomy Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The suggestion that there were only two options - dispatching a warship or seizing the medicines - presents a false dichotomy, oversimplifying the complex considerations that may have influenced Portugal's actions."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the topic of Portugal's actions to prevent a Dutch abortion clinic ship from entering its waters, with a general bias tendency towards portraying Portugal's actions in a negative light through word choice, causal misunderstanding, and false dichotomy."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6333333333333333,
            "percentage_of_biased_sentences": 0.16666666666666666,
            "overall_rating": 0.39999999999999997
        },
        "combined_score": 0.0
    },
    {
        "Title": "Obama lifts ban on overseas abortion funding",
        "URL": "Obama lifts ban on overseas abortion funding.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "   WASHINGTON, Jan 23 (Reuters) - U.S. President Barack Obama  on Friday lifted restrictions on U.S. government funding for  groups that provide abortion services or counseling abroad,  reversing a policy of his Republican predecessor George W.  Bush, the White House said.      The Democratic president's decision is a victory for  advocates of abortion rights on an issue that has become a  tit-for-tat policy change each time the White House shifts from  one party to the other in recent years.   ((deborah.charles@reuters.com;+1 202 789 8579; Reuters  Messaging: deborah.charles.reuters.com@reuters.net))  Keywords: OBAMA/ABORTION ORDER        ",
        "Histogram": [
            0,
            0.6,
            0
        ],
        "Relevance": 11.033035278320312,
        "BiasReport": {
            "sentences": [
                {
                    "text": "The Democratic president's decision is a victory for advocates of abortion rights on an issue that has become a tit-for-tat policy change each time the White House shifts from one party to the other in recent years.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the word 'victory' and the phrase 'tit-for-tat policy change' implies a judgment and suggests a back-and-forth struggle rather than a reasoned policy discussion, influencing the reader's perception."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias through word choice, favoring the perspective of advocates of abortion rights and framing the policy change in a way that suggests a partisan struggle rather than a rational debate."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.3333333333333333,
            "overall_rating": 0.4666666666666667
        },
        "combined_score": 0.0
    },
    {
        "Title": "US court strikes down state ban on abortion method",
        "URL": "US court strikes down state ban on abortion method.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    WASHINGTON, May 20 (Reuters) - A federal appeals court   ruled on Tuesday that a Virginia law banning an abortion  procedure was unconstitutional because it infringed on a  woman's right to end her pregnancy.      The 2-1 decision by the appeals court based in Richmond,  Virginia, was a victory for abortion rights advocates who had  challenged the 2003 law that bans what it terms 'partial birth  infanticide.'      The U.S. Supreme Court last year upheld a federal law, the  Partial Birth Abortion Ban Act, saying it prohibited only a  clearly defined method. It marked the first time the court has  ever upheld a nationwide ban on a specific abortion procedure.      But the appeals court ruled the Virginia law was  substantially broader than the federal law and must be struck  down because it would burden a woman's right to choose an  abortion as early as the second trimester of pregnancy.      While the federal law protected doctors who set out to  perform a legal abortion that by accident becomes the banned  procedure, the Virginia law provided no such protection, the  appeals court said.      Both sides in the case agreed that the Virginia law bans a  medical procedure called 'intact dilation and extraction.'      Nancy Northup, president of the Center for Reproductive  Rights in New York, which brought the challenge to the law,  hailed the ruling.      'Federal courts are seeing through these thinly veiled  attempts to undermine a woman's ability to obtain an abortion,'  she said in a statement, noting that a federal appeals court  last year struck down a broad Michigan abortion ban.      Critics had charged the Virginia law, which has never taken  effect, was one of the most restrictive abortion measures in  the country.   (Reporting by James Vicini, Editing by Deborah Charles)   ((jim.vicini@thomsonreuters.com; 202-898-8397; Reuters  Messaging: jim.vicini.reuters.com@reuters.net))  Keywords: USA COURT/ABORTION       ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 11.017620086669922,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to exhibit bias. It provides a factual report on a federal appeals court ruling regarding a Virginia law on abortion procedures, including statements from both sides of the case."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    }
]