[
    {
        "Title": "Sarah Palin and John McCain.txt",
        "URL": "Sarah Palin and John McCain.txt.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Fox_News_Channel_logo.svg/240px-Fox_News_Channel_logo.svg.png",
        "Text": "Can you believe Sarah Palin is still getting trashed eight days after the election? Can you believe she's still getting as much or more attention than President-elect Obama? Something is going on here.\n\nWednesday, New York Times columnist Maureen Dowd ran yet another analysis of Governor Palin. But why? She lost. She's not going to be vice president.\n\nIn her column just out, she wrote: \"After her brutal transformation by the McCain campaign into a shopaholic, whack-job diva, Palin is now trying to unmake that makeover and morph from uptown cloistered girl back to down-home accessible girl.\"\n\nMs. Dowd goes on to cite reporting by The Washington Post that the governor spent even more money, this time on silk boxer shorts for her husband and spray tanners, above and beyond the original $150,000 already reported.\n\nNow, my question is: Who cares? I believe Palin when she says the RNC bought the clothes.\n\n(BEGIN VIDEO CLIP)\n\nGOV. SARAH PALIN: The criticism that, you know, I took time out to run into Neiman Marcus or Sax, I don't think I've ever set foot in either one of those stores and, of course, didn't know the New York stylist whom they had hired or anything else.\n\n(END VIDEO CLIP)\n\nWell, \"Talking Points\" is simply amazed the press is still talking about this in the face of a dangerous economy and the anticipation of a relatively inexperienced new president.\n\nBut there are some lessons here, and the first one is about loyalty. After Sarah Palin was hammered by some McCain staffers, it took the senator six days before he publicly stood up for her. That happened on the Leno program last night.\n\n(BEGIN VIDEO CLIP)\n\nJOHN MCCAIN: I'm just very proud to have had Sarah Palin and her family, a wonderful family.\n\n(END VIDEO CLIP)\n\nOK, but let me ask you something. If you knew a friend was being humiliated, would it take you six days to defend her? If so, you're not much of a friend.\n\nOn \"The Radio Factor\" Wednesday, Juan Williams said he thinks McCain just doesn't care about the issue, and that rings true. But McCain should have stood up sooner, no question.\n\nAs for Governor Palin, the liberal press wants to destroy her mainly because of her pro-life belief. And some Republicans believe she's not smart enough to run the country. So she continues to get it from both sides.\n\nBut the very fact that we are still talking about Sarah Palin proves the woman remains a force in America. It will be fascinating to see what happens to her.\n\nAnd that's \"The Memo.\"\n\nPinheads & Patriots\n\nOur pal Donald Trump often does some nice things with his assets, and here's another one. He's been housing actress Jennifer Hudson and her family after the brutal murders of her mother, brother and young nephew. Mr. Trump's putting them up for free at one of his hotels, and for that, he's a patriot.\n\nOn the pinhead front, actor Brad Garrett, who gained a measure of fame in \"Everybody Loves Raymond,\" is being investigated by the police after this confrontation:\n\nClick here to watch \"Pinheads & Patriots.\"\n\n(BEGIN VIDEO CLIP)\n\nUNIDENTIFIED MALE: You're a big star, man.\n\nUNIDENTIFIED MALE: Hey.\n\nUNIDENTIFIED MALE: Hey, leave him alone.\n\nBRAD GARRETT, ACTOR: That's enough. That's enough.\n\nUNIDENTIFIED MALE: I didn't touch you.\n\nGARRETT: Oh, you would love that, right.\n\nUNIDENTIFIED MALE: You did.\n\nGARRETT: Oh, did I really? Go get a real job.\n\n(END VIDEO CLIP)\n\nNow, we sympathize with all famous people because the paparazzi are ruthless. But Mr. Garrett needs to calm down and stop being a pinhead.",
        "Histogram": [
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0.9,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0.8,
            0.8,
            0.8,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 19.950794219970703,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Can you believe Sarah Palin is still getting trashed eight days after the election? Can you believe she's still getting as much or more attention than President-elect Obama? Something is going on here.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of provocative language and the comparison to President-elect Obama is designed to evoke a strong emotional response, suggesting an unfair treatment of Sarah Palin without providing a balanced perspective."
                },
                {
                    "text": "In her column just out, she wrote: \"After her brutal transformation by the McCain campaign into a shopaholic, whack-job diva, Palin is now trying to unmake that makeover and morph from uptown cloistered girl back to down-home accessible girl.\"",
                    "bias_type": "Ad Hominem Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This sentence attacks Sarah Palin's character by using derogatory terms ('shopaholic, whack-job diva') to undermine her credibility, rather than addressing the substance of any political or policy-related issues."
                },
                {
                    "text": "Ms. Dowd goes on to cite reporting by The Washington Post that the governor spent even more money, this time on silk boxer shorts for her husband and spray tanners, above and beyond the original $150,000 already reported.",
                    "bias_type": "Cherry Picking Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The focus on trivial details such as silk boxer shorts and spray tanners, presented without context, aims to sensationalize and discredit Sarah Palin's character rather than providing a balanced or comprehensive analysis."
                },
                {
                    "text": "Now, my question is: Who cares? I believe Palin when she says the RNC bought the clothes.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The dismissive tone and the use of the phrase 'Who cares?' imply a judgment about the significance of the issue, influencing the reader's perception by suggesting that the controversy over Palin's clothes is unworthy of attention."
                },
                {
                    "text": "Well, \"Talking Points\" is simply amazed the press is still talking about this in the face of a dangerous economy and the anticipation of a relatively inexperienced new president.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence injects the author's subjective opinion about the new president's experience and the state of the economy, implying that the focus on Sarah Palin is misplaced and should be directed elsewhere, without presenting a balanced view."
                },
                {
                    "text": "But there are some lessons here, and the first one is about loyalty. After Sarah Palin was hammered by some McCain staffers, it took the senator six days before he publicly stood up for her. That happened on the Leno program last night.",
                    "bias_type": "Speculation Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The assertion about the senator's delay in defending Sarah Palin is presented as a lesson in loyalty, speculating on the motives and timing of his public support without concrete evidence, and implying a negative judgment."
                },
                {
                    "text": "OK, but let me ask you something. If you knew a friend was being humiliated, would it take you six days to defend her? If so, you're not much of a friend.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of a rhetorical question and the judgmental statement about what makes a 'good friend' introduces a subjective and emotionally charged perspective, influencing the reader's perception of the situation."
                },
                {
                    "text": "As for Governor Palin, the liberal press wants to destroy her mainly because of her pro-life belief. And some Republicans believe she's not smart enough to run the country. So she continues to get it from both sides.",
                    "bias_type": "Political Bias",
                    "bias_strength": 0.8,
                    "bias_description": "This sentence exhibits a clear political bias by attributing negative motives to the 'liberal press' and suggesting that criticism of Palin is solely based on her pro-life stance, while also implying that Republicans' concerns about her capabilities are unjust."
                },
                {
                    "text": "But the very fact that we are still talking about Sarah Palin proves the woman remains a force in America. It will be fascinating to see what happens to her.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of dramatic language ('a force in America', 'It will be fascinating to see what happens to her') aims to evoke interest and emotional response, suggesting a significance to Sarah Palin's continued presence in public discourse that may not be objectively warranted."
                }
            ],
            "overall_bias": {
                "conclusion": "The article is biased regarding the treatment and portrayal of Sarah Palin, exhibiting emotional sensationalism, ad hominem attacks, cherry-picking of details, speculative judgments, and political bias. The general bias tendency leans towards discrediting Palin's character and significance, particularly through the use of provocative language and subjective opinions."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6555555555555554,
            "percentage_of_biased_sentences": 0.26666666666666666,
            "overall_rating": 0.461111111111111
        },
        "combined_score": 0.0
    },
    {
        "Title": "Attacks on Sarah Palin Continue.txt",
        "URL": "Attacks on Sarah Palin Continue.txt.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Fox_News_Channel_logo.svg/240px-Fox_News_Channel_logo.svg.png",
        "Text": "Wednesday morning, NBC News correspondent Andrea Mitchell reported that Governor Palin's clothing is very expensive, and Ms. Mitchell is apparently upset about that. It's the usual from NBC News, trying to diminish the McCain-Palin ticket any way they can.\n\nBut far more troubling — far more troubling — was an interview Tuesday on CNN. Stay with me here because this is very important.\n\nWriting in the National Review this week, Byron York said: \"Watching press coverage of the Republican candidate for vice president, it's sometimes hard to decide whether Sarah Palin is incompetent, stupid, unqualified, corrupt, backward, or all of the above. Palin, the governor of Alaska, has faced more criticism than any vice presidential candidate since 1988.\"\n\nNow Mr. York was clearly criticizing press bias in that paragraph, no question about that. Well, shortly after the article appeared, Sarah Palin was interviewed by CNN reporter Drew Griffin, and here's what happened:\n\n(BEGIN VIDEO CLIP)\n\nDREW GRIFFIN, CNN CORRESPONDENT: Governor, you've been mocked in the press. The press has been pretty hard on you. The Democrats have been pretty hard on you. But also some conservatives have been pretty hard on you as well. The National Review had a story saying that, you know, I can't tell if Sarah Palin is incompetent, stupid, unqualified, corrupt, or all of the above.\n\nSARAH PALIN: Who wrote that one?\n\nGRIFFIN: That was in the National Review. I don't have the author.\n\nPALIN: I'd like to talk to that person.\n\n(END VIDEO CLIP)\n\nShe doesn't have to talk to that person. Isn't that incredible?\n\nNow Griffin, the guy, totally distorted what York wrote in the article, and then he ambushes Palin with the distortion. She has no idea what he's talking about.\n\nNow I haven't been critical of CNN during the campaign. They've been pretty honest in their coverage, I believe. But that was off the chart dishonest.\n\nSo we called CNN for comment very early in the morning. We said look, you know, are you going to apologize? What are you going to do? They wouldn't comment. Apparently, there's no apology in the works, no retraction. It's unbelievable. It's hard to believe. In fact, the whole campaign has been hard to believe.\n\n\"Talking Points\" is amazed at how dishonest the American press reportage has been. Yes, there's been nasty stuff from both sides, no doubt. But with the mainstream media solidly behind Barack Obama, I think that's worth about five percentage points for him in the popular vote. I could be wrong.\n\nBut CNN was definitely wrong in what they did to Sarah Palin. It's outrageous.\n\nAnd that's \"The Memo.\"\n\nPinheads & Patriots\n\nAs you may have heard, I signed up for another contract cycle here at FOX News. My boss, Roger Ailes, is a patriot for allowing me to continue. At least to me he is.\n\nNow I gave two interviews Tuesday on the subject: one to Richard Huff at the New York Daily News and the other to our pal Howard Kurtz at The Washington Post.\n\nNow, I'm like Charlie Brown trying to kick the football with Lucy holding it. I'm never going to learn.\n\nHuff did a fair story, but he listed my salary, which he got drastically wrong. But it doesn't matter. All the Web sites picked it up and, once again, falsehood becomes fact.\n\nKurtz wrote mostly about some negative aspects of \"The Factor,\" which is what The Post likes to do. Howard didn't do anything unprofessional. He simply gave his bosses what they want: negative stuff.\n\nFor example, Kurtz wrote that \"The Radio Factor\" is less successful than the TV \"Factor.\" Well, most media, Howard, is less successful than the TV \"Factor,\" including The Washington Post and CNN, where you work.\n\nThe fact is, \"The Radio Factor\" is one of the most profitable radio franchises in the history of the medium, but Howard wanted to find a negative, and he did. By the way, as I said, Howard also works for CNN.\n\nI'm not calling Mr. Huff and Mr. Kurtz pinheads. They don't deserve that designation off what they wrote, but both men could have done a little bit better on this one.\n\n— You can catch Bill O'Reilly's \"Talking Points Memo\" and \"Pinheads & Patriots\" weeknights at 8 and 11 p.m. ET on the FOX News Channel and any time on foxnews.com/oreilly. Send your comments to: oreilly@foxnews.com",
        "Histogram": [
            0,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0.9,
            0.9,
            0.9,
            1.0,
            1.0,
            0,
            1.0,
            1.0,
            1.0,
            0,
            1.0,
            0.9,
            0.9,
            0.9,
            0.9,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 19.457324981689453,
        "BiasReport": {
            "sentences": [
                {
                    "text": "It's the usual from NBC News, trying to diminish the McCain-Palin ticket any way they can.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'the usual' implies a habitual and negative behavior from NBC News towards the McCain-Palin ticket, suggesting a judgment without presenting evidence."
                },
                {
                    "text": "But far more troubling — far more troubling — was an interview Tuesday on CNN. Stay with me here because this is very important.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The repetition of 'far more troubling' and the plea to 'Stay with me here because this is very important' are designed to evoke a strong emotional response and emphasize the significance of the following information, potentially at the expense of a balanced presentation."
                },
                {
                    "text": "Now Mr. York was clearly criticizing press bias in that paragraph, no question about that. Well, shortly after the article appeared, Sarah Palin was interviewed by CNN reporter Drew Griffin, and here's what happened:",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The assertion that 'Mr. York was clearly criticizing press bias in that paragraph, no question about that' presents a subjective opinion as an objective fact, blurring the line between analysis and personal perspective."
                },
                {
                    "text": "She doesn't have to talk to that person. Isn't that incredible?",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'Isn't that incredible?' is a form of emotional sensationalism, aiming to provoke surprise or disbelief in the reader by framing the situation in a dramatic manner."
                },
                {
                    "text": "Now Griffin, the guy, totally distorted what York wrote in the article, and then he ambushes Palin with the distortion. She has no idea what he's talking about.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Describing the reporter as 'the guy' and stating that he 'ambushes Palin with the distortion' uses negatively connoted language to imply judgment and discredit the reporter's actions without a neutral presentation of the facts."
                },
                {
                    "text": "Now I haven't been critical of CNN during the campaign. They've been pretty honest in their coverage, I believe. But that was off the chart dishonest.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "The stark judgment that the CNN interview was 'off the chart dishonest' is a clear example of opinionated bias, where a subjective belief in the lack of honesty is presented as an objective assessment."
                },
                {
                    "text": "So we called CNN for comment very early in the morning. We said look, you know, are you going to apologize? What are you going to do? They wouldn't comment. Apparently, there's no apology in the works, no retraction. It's unbelievable. It's hard to believe. In fact, the whole campaign has been hard to believe.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 1.0,
                    "bias_description": "The use of 'unbelievable' and 'hard to believe' multiple times, along with the dramatic statement about the whole campaign, employs emotional sensationalism at a high level, aiming to evoke strong disbelief or shock in the reader."
                },
                {
                    "text": "\"Talking Points\" is amazed at how dishonest the American press reportage has been. Yes, there's been nasty stuff from both sides, no doubt. But with the mainstream media solidly behind Barack Obama, I think that's worth about five percentage points for him in the popular vote. I could be wrong.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "The use of 'amazed at how dishonest' and the assertion that the mainstream media's support for Barack Obama is 'worth about five percentage points for him in the popular vote' are clear examples of opinionated bias, where subjective opinions and beliefs are presented as facts."
                },
                {
                    "text": "But CNN was definitely wrong in what they did to Sarah Palin. It's outrageous.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Labeling CNN's actions as 'outrageous' is a form of emotional sensationalism, using strong, negatively charged language to provoke a strong emotional response in the reader."
                },
                {
                    "text": "Now, I'm like Charlie Brown trying to kick the football with Lucy holding it. I'm never going to learn.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This analogy, comparing the speaker to Charlie Brown and invoking a well-known, frustrating situation, is a form of emotional sensationalism, aiming to evoke empathy and frustration in the reader through a relatable and emotionally charged comparison."
                },
                {
                    "text": "Huff did a fair story, but he listed my salary, which he got drastically wrong. But it doesn't matter. All the Web sites picked it up and, once again, falsehood becomes fact.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The statement 'once again, falsehood becomes fact' is a dramatic assertion that employs emotional sensationalism, suggesting a pattern of misinformation being widely accepted as true, without providing evidence for this claim."
                },
                {
                    "text": "Howard didn't do anything unprofessional. He simply gave his bosses what they want: negative stuff.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The assertion that Howard 'simply gave his bosses what they want: negative stuff' presents a subjective interpretation of Howard's actions as an objective fact, implying a judgment about Howard's professionalism based on the speaker's personal perspective."
                },
                {
                    "text": "By the way, as I said, Howard also works for CNN.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The inclusion of 'By the way' and the emphasis on Howard's affiliation with CNN after a critical statement about CNN is a subtle form of word choice bias, suggesting a connection between Howard's actions and CNN's overall conduct without explicit evidence."
                }
            ],
            "overall_bias": {
                "conclusion": "The article is biased regarding the portrayal of Sarah Palin and the media's treatment of her, with a general bias tendency towards discrediting the actions and integrity of certain media outlets and their personnel, particularly CNN and its reporters. The biases identified include Word Choice Bias, Emotional Sensationalism Bias, Opinionated Bias, and they collectively contribute to a narrative that questions the honesty and professionalism of the media in their coverage of political figures."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6769230769230768,
            "percentage_of_biased_sentences": 0.3898305084745763,
            "overall_rating": 0.5333767926988265
        },
        "combined_score": 0.0
    },
    {
        "Title": "UPDATE 1-Sarah Palin boosts John McCain's campaign",
        "URL": "UPDATE 1-Sarah Palin boosts John McCain's campaign.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "  (Updates with more opinion polls)      By Jeff Mason      ALBUQUERQUE, Sept 8 (Reuters) - John McCain's backers are  reveling in the crowds his White House campaign has drawn in  the 10 days since he made Alaska's little-known governor, Sarah  Palin, his running mate.      'Governor, you're a breath of fresh air,' Ken Starrs, a    police lieutenant from Corpus Christi, Texas, told Palin, 44,  at a Detroit ceremony where the political pair picked up an  endorsement from the Fraternal Order of Police union.      'She's very real,' he said after they shook hands.      Critics have questioned the 72-year-old Republican  senator's judgment in choosing a vice presidential candidate  without high-profile experience. Palin has been governor since  2006. Her previous public service was as a small-town mayor.      Democrat Barack Obama, 47, has raised far more cash in the  race for the Nov. 4 election. He has sought to paint McCain as  heir to Republican President George W. Bush's unpopular  policies. But McCain and Palin are holding their own.      Five public opinion polls released on Monday showed McCain  and Obama essentially dead even as they headed into the final  eight weeks of the race for the White House.      McCain has decided to keep Palin with him on the trail a  few more days before sending her out to campaign on her own.      'I saw a new McCain today, and I'm very excited,' said  Bonnie Norris, 63, after a lively performance by the Arizona  senator in Albuquerque. 'He's opened up more. He's more  dynamic.'      Some 15,000 people turned out to see McCain name his vice  presidential pick in Dayton, Ohio, on Aug. 29. To soaring music  and high drama, Palin entered the stage with her family like a  new, if somewhat baffled, rock star.           'SARAH, SARAH'      Not known for the inspiring oratory that is Obama's  trademark, McCain has since soaked up some of the energy  generated by Palin, who is greeted with shouts of 'Sarah,  Sarah' at most rallies.      'She's ignited America,' McCain declared in New Mexico on  Saturday night. 'The response to her has been overwhelming.'      At the Albuquerque rally, which packed more than 6,000  people into a tight hall, McCain's 'Straight Talk Express' bus  pulled up and dropped the candidates in front of the crowd  while Van Halen's song 'Right Now' blasted over loudspeakers.      The many signs ranged from 'Sarah, you had USA at hello' to  'Lipstick wearing pitbulls for McCain,' a reference to her quip  at the Republican convention suggesting lipstick was the only  thing to distinguish a pit bull from a 'hockey mom.'      Aides said their relationship was cementing quickly.      'They knew each other a little (before), obviously, but  they're getting to know each other well,' said Mark Salter,  McCain's closest aide and speechwriter.      'They're very excited about these rallies. They're talking  about them, they're looking at each other for marks. You know,  they're talking to each other about policy, about energy policy  and a couple other things. They're getting along very well.'      On the day McCain introduced Palin as his running mate, she  referred to him as 'senator' and to his wife Cindy as 'Mrs.  McCain.' Do they call each other by first names now? 'Yeah, I  believe so,' Salter said.      Palin, who precedes him now at rallies with a rousing  reference to McCain's service as a Vietnam prisoner of war,  added a new bit to her introduction on Friday in Michigan: 'I  am honored ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 18.990631103515625,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it primarily reports on the reactions and events surrounding John McCain's campaign and the introduction of Sarah Palin as his running mate without displaying any evident bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "From wigs to weird, Sarah Palin items surge online",
        "URL": "From wigs to weird, Sarah Palin items surge online.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    LOS ANGELES, Sept 18 (Reuters Life!) - From Sarah Palin's  trademark Kazuo Kawasaki glasses, to gun-toting action figuresand a large pumpkin carved with her face, the newcomer in the  U.S. election campaign has sparked a rush of online novelties.      Other shoppers are rushing to copy the style of the  Republican party's vice-presidential candidate ahead of the   Nov. 4 vote.      Figures show online sales of items related to Palin, the  governor of Alaska and self-described 'hockey mom', have shot  up over fivefold, overtaking sales of the election's three male  contenders, and prompting a far wider range of merchandise.      Demand may be muted for a $125 pumpkin hand-carved with  Palin's face, but Palin wigs for $75 could be more appealing  while a hockey puck featuring her photo, the U.S. flag and  reading 'Hockey Moms for Sarah Palin' is proving popular at  $15.      A piece of uneaten toast titled 'Sarah Palin on my toast! A  sign? You be the judge,' was up for sale on the online auction  site eBay, with 24 bids and one unbelievable offer of $7,100.      Karen Bard, an eBay spokeswoman, said the number of Palin  related items has surged since Republican John McCain on Aug.  29 named Palin, 44, as his running mate.      'The day after McCain popped the big question to Palin, 105  Palin items were listed on eBay. With the momentum from the  Republican National Convention, Palin items took off peaking at  554 listing in one day,' Bard said.      She said over the past 30 days on eBay, over 4,000 Palin  items have sold for an average of $5.61, with the highest item,  an autographed photo of mother-of-five Palin, getting $499.99.      A quick check found 1,500 items related to Palin for sale  on eBay, outnumbering 298 for Democratic vice-presidential  candidate Joe Biden, while Democrat Barack Obama had 4,500  items to his name and McCain 1,750.           FROM WEIRD TO WIGS      Obama and McCain can boast a vast array of books, posters,  T-shirts and badges but Bard said Palin supporters were  exercising their creative rights and freedom of speech by  listing thousands of different items, mainly to show support.      These included Sarah Palin Barbie dolls and action figures,  Palin beer Steins, T-shirts galore, and Palin thong underwear.      CafePress, an online store for independent retailers and  political merchandise, was running a graph showing sales for  Palin goods had overtaken items related to the others.      In the week ending Sept 13, her first week on the CafePress  chart, Palin items accounted for 32 percent of weekly sales,  topping McCain at 29 percent, Obama at 28 percent and Biden at  5 percent.      But it is not just the bizarre that is in demand. Followers  of fashion want the former beauty queen's looks.      Italee Optics, the U.S. distributor of Palin's rimless  frames by Japanese designer Kazuo Kawasaki, has reportedly run  out of supplies after orders soared and has increased imports.      Shoe company Naughty Monkey has seen a similar rush for the  open-toed red shoes that Palin wore on the day she was  introduced as McCain's running mate -- and wig sellers are out  in force.      'Hair stylists across the country are being barraged by  clientele for the 'Palin Up-do' (with) women putting politics  aside to admire an elegant hairstyle,' said a spokeswoman for  Paula Young, a Massachusetts retailer of hairpieces and wigs.      (Writing by Belinda Goldsmith, Editing by Jill Serjeant)      ((belinda.goldsm",
        "Histogram": [
            0,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0.6,
            0.5,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 18.821868896484375,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Figures show online sales of items related to Palin, the governor of Alaska and self-described 'hockey mom', have shot up over fivefold, overtaking sales of the election's three male contenders, and prompting a far wider range of merchandise.",
                    "bias_type": "Gender Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The sentence emphasizes the increase in sales of items related to Sarah Palin, specifically highlighting her self-description as a 'hockey mom' and the comparison to the male contenders. This could imply a gender bias by suggesting a novelty or surprise in a female candidate's merchandise outselling that of male candidates."
                },
                {
                    "text": "Demand may be muted for a $125 pumpkin hand-carved with Palin's face, but Palin wigs for $75 could be more appealing while a hockey puck featuring her photo, the U.S. flag and reading 'Hockey Moms for Sarah Palin' is proving popular at $15.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the word 'muted' to describe the demand for a pumpkin with Palin's face compared to the appeal of Palin wigs and hockey pucks introduces a subtle bias through word choice, suggesting a judgment on the value or desirability of the merchandise."
                },
                {
                    "text": "A piece of uneaten toast titled 'Sarah Palin on my toast! A sign? You be the judge,' was up for sale on the online auction site eBay, with 24 bids and one unbelievable offer of $7,100.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The sentence uses the example of 'Sarah Palin on my toast' to evoke a sense of absurdity or irrational enthusiasm, which could be seen as a form of emotional sensationalism, emphasizing the extreme nature of the auction offer to provoke a reaction."
                },
                {
                    "text": "Karen Bard, an eBay spokeswoman, said the number of Palin related items has surged since Republican John McCain on Aug. 29 named Palin, 44, as his running mate.",
                    "bias_type": "Age Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The inclusion of Palin's age upon her nomination as a running mate, without similar details for other candidates, introduces an age bias by singling out this characteristic as noteworthy or potentially relevant to the surge in related items."
                },
                {
                    "text": "A quick check found 1,500 items related to Palin for sale on eBay, outnumbering 298 for Democratic vice-presidential candidate Joe Biden, while Democrat Barack Obama had 4,500 items to his name and McCain 1,750.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'outnumbering' to describe the quantity of items related to Palin compared to Joe Biden introduces a bias through word choice, implying a significance or superiority in Palin's merchandise presence over Biden's, which may not be warranted."
                },
                {
                    "text": "Obama and McCain can boast a vast array of books, posters, T-shirts and badges but Bard said Palin supporters were exercising their creative rights and freedom of speech by listing thousands of different items, mainly to show support.",
                    "bias_type": "Political Bias",
                    "bias_strength": 0.5,
                    "bias_description": "The sentence subtly suggests a political bias by framing Palin supporters' actions as a noble exercise of creative rights and freedom of speech, contrasting it with the more mundane merchandise of Obama and McCain. This could imply a favorable portrayal of Palin's supporters over her opponents."
                },
                {
                    "text": "These included Sarah Palin Barbie dolls and action figures, Palin beer Steins, T-shirts galore, and Palin thong underwear.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The inclusion of 'thong underwear' in the list of Palin-related merchandise, alongside more conventional items, introduces a bias through word choice by highlighting a potentially controversial or sensational aspect of the merchandise for effect."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding Sarah Palin's merchandise and its popularity, with instances of gender bias, word choice bias, emotional sensationalism bias, age bias, and political bias. The biases are primarily directed towards portraying Palin and her supporters in a certain light compared to her male counterparts and political opponents."
            }
        },
        "Scores": {
            "average_bias_strength": 0.5857142857142856,
            "percentage_of_biased_sentences": 0.13043478260869565,
            "overall_rating": 0.35807453416149065
        },
        "combined_score": 0.0
    },
    {
        "Title": "ANALYSIS-What happens to Sarah Palin now?",
        "URL": "ANALYSIS-What happens to Sarah Palin now?.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Steve Holland      WASHINGTON, Nov 5 (Reuters) - Love her or hate her, Sarah  Palin was a phenomenon as the Republican vice presidential  running mate to John McCain, and the question for the  self-styled moose-hunting hockey mom is: What now?      Alaska Gov. Palin, plucked from obscurity and thrust on to  the national stage to mixed reviews, was publicly cool to talk  that she might have caught the presidential bug and seek to run  against Democrat Barack Obama in 2012.      'I don't know politically where in the world I'll be then,'  she told reporters on Wednesday in Phoenix.      But her interest in playing some kind of national role was  evident from the words of McCain himself on Tuesday night in  his concession speech after he was defeated by Obama.      'We can all look forward with great interest to her future  service to Alaska, the Republican Party and our country,' he  said.      Palin, 44, drew huge crowds on the campaign trail, bigger  than McCain's. She proved to be a powerful performer in stump  speeches, energizing the Republican base.      But she was less effective in television interviews,  botching a couple of early media encounters to the point that  some prominent conservatives said she was too inexperienced to  be a heartbeat away from the presidency.      Her folksy, 'you betcha' style was both refreshing and  grist for countless jokes on late-night television, giving a  career boost to her actress doppelganger, Tina Fey of NBC's  'Saturday Night Live.'      'She clearly has a future in national politics,' said  Republican strategist Scott Reed. 'She has to work to rebuild  the parts of her image that became a caricature. But she's  extremely popular with the grassroots.'      'Palin needs to take some time back in Alaska and regroup  with her day job. There's plenty of time to plot and scheme  after the Christmas holidays,' he said.           REPUBLICAN VISIONS      While Palin was selected by McCain in 2008, if she ran in  2012 she would compete against formidable members of her own  party with their own visions like former Massachusetts Gov.  Mitt Romney, former Arkansas Gov. Mike Huckabee and Louisiana  Gov. Bobby Jindal.      Republican strategist Tony Fabrizio said Palin is not the  frontrunner for the Republican nomination in 2012. He noted in  particular some revelations uncovered by the news media during  what amounted to a public vetting of her record once she was  picked by McCain.      Her acceptance of thousands of dollars in daily travel  expenses from the state while living at home and the Republican  Party's costly shopping spree to equip her and her family with  designer clothing may come back to haunt her.      'She needs to go back home and face all of the stuff that's  been raked up in the presidential race. Voters in Alaska found  out a lot of stuff about Sarah Palin that they didn't know  about Sarah Palin. She's got to go back and get herself  re-elected,' Fabrizio said.      Palin's future may depend on how the Republican Party  itself changes in response to its defeat.      Social conservatives who are warmest to Palin represent a  dwindling minority in the party, which was rocked by the Obama  victory and will now undergo a period of reflection and  soul-searching about the future.      Palin was said to have little time for people who did not  agree with her socially conservative views.      'If she wants to be a voice for a part of the new failed  Republican Party, she's going",
        "Histogram": [
            0,
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0.6,
            0.6,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0,
            0
        ],
        "Relevance": 18.57661247253418,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Alaska Gov. Palin, plucked from obscurity and thrust on to the national stage to mixed reviews, was publicly cool to talk that she might have caught the presidential bug and seek to run against Democrat Barack Obama in 2012.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'plucked from obscurity' carries a negative connotation, suggesting Palin's lack of merit, and 'the presidential bug' trivializes her potential political aspirations, implying a frivolous desire for power."
                },
                {
                    "text": "'I don't know politically where in the world I'll be then,' she told reporters on Wednesday in Phoenix.",
                    "bias_type": "Speculation Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence speculates on Palin's future political plans without concrete evidence, implying uncertainty in her career path and potentially undermining her credibility."
                },
                {
                    "text": "But her interest in playing some kind of national role was evident from the words of McCain himself on Tuesday night in his concession speech after he was defeated by Obama.",
                    "bias_type": "Speculation Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The sentence implies Palin's ambition for a national role based on indirect evidence (McCain's words), which could lead readers to speculate without a clear basis."
                },
                {
                    "text": "'We can all look forward with great interest to her future service to Alaska, the Republican Party and our country,' he said.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'great interest' and 'service' in McCain's statement positively frames Palin's future, suggesting a bias towards viewing her potential contributions favorably without critical analysis."
                },
                {
                    "text": "But she was less effective in television interviews, botching a couple of early media encounters to the point that some prominent conservatives said she was too inexperienced to be a heartbeat away from the presidency.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence presents the opinion of 'some prominent conservatives' as a factual judgment on Palin's competence, blurring the line between objective reporting and subjective critique."
                },
                {
                    "text": "Her folksy, 'you betcha' style was both refreshing and grist for countless jokes on late-night television, giving a career boost to her actress doppelganger, Tina Fey of NBC's 'Saturday Night Live.'",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Describing Palin's style as 'refreshing' and its impact on Tina Fey's career positively frames Palin's public persona, suggesting a bias towards celebrating her quirks rather than critically examining her political abilities."
                },
                {
                    "text": "'Palin clearly has a future in national politics,' said Republican strategist Scott Reed. 'She has to work to rebuild the parts of her image that became a caricature. But she's extremely popular with the grassroots.'",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The assertion that Palin 'clearly has a future in national politics' and is 'extremely popular with the grassroots' presents a subjective opinion as an indisputable fact, without providing a balanced view or evidence."
                },
                {
                    "text": "While Palin was selected by McCain in 2008, if she ran in 2012 she would compete against formidable members of her own party with their own visions like former Massachusetts Gov. Mitt Romney, former Arkansas Gov. Mike Huckabee and Louisiana Gov. Bobby Jindal.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'formidable' to describe other potential candidates implies a comparative judgment that could subtly undermine Palin's standing, suggesting a bias through the choice of adjectives."
                },
                {
                    "text": "Republican strategist Tony Fabrizio said Palin is not the frontrunner for the Republican nomination in 2012. He noted in particular some revelations uncovered by the news media during what amounted to a public vetting of her record once she was picked by McCain.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The statement that Palin is 'not the frontrunner' and the reference to 'revelations uncovered by the news media' introduces a negative perspective on Palin's candidacy, implying a judgment on her suitability based on media scrutiny."
                },
                {
                    "text": "'She needs to go back home and face all of the stuff that's been raked up in the presidential race. Voters in Alaska found out a lot of stuff about Sarah Palin that they didn't know about Sarah Palin. She's got to go back and get herself re-elected,' Fabrizio said.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This quote emphasizes the negative impact of the 'stuff' revealed during the presidential race on Palin's standing in Alaska, suggesting a bias by focusing on potentially damaging information without a balanced examination."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding Sarah Palin's political career, particularly through the use of speculative language, opinionated statements presented as facts, and word choices that subtly influence the reader's perception of Palin's abilities and prospects. The biases tend to undermine Palin's credibility and standing within the Republican Party, suggesting a critical view of her future in politics."
            }
        },
        "Scores": {
            "average_bias_strength": 0.5999999999999999,
            "percentage_of_biased_sentences": 0.5,
            "overall_rating": 0.5499999999999999
        },
        "combined_score": 0.0
    },
    {
        "Title": "Sarah Palin stirs passion in Hollywood",
        "URL": "Sarah Palin stirs passion in Hollywood.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Sue Zeidler      LOS ANGELES, Sept 11 (Reuters) - Sarah Palin represents  many things Hollywood liberals love to hate, from her  opposition to gay marriage to her support for gun rights, yet  she possesses two key qualities they admire -- star appeal and  a great script.      Accordingly, Hollywood Republicans -- often overshadowed by  their left-leaning peers -- are seeking to capitalize on the  celebrity of John McCain's running mate in the Nov. 4 election  to generate support in a town well-known for its lavish  Democratic fund-raisers and events.      'She's certainly got star appeal and is the kind of  candidate that is made for Hollywood. I offered to throw her a  fundraiser myself,' said MGM chief Harry Sloan, one of  Hollywood's most vocal Republicans.      Palin has shaken up the White House race, boosted  enthusiasm among previously apathetic supporters of McCain's  presidential nomination and drawn support from women, rural  voters and Southerners, according to recent polls.      Sloan said there were no plans for a Palin Hollywood  fundraiser yet as her campaign managers were inundated with  similar requests from all over the country after her national  debut at the Republican National Convention on Sept. 3.      A campaign spokesman would not disclose McCain and Palin's  movements beyond one week's time, but various Hollywood  executives said they heard the Arizona senator and Alaska  governor would be swinging through California later this month  or early next month.      Democratic candidates have long enjoyed a fundraising  advantage in Hollywood. Through the end of July, Democratic  presidential nominee Barack Obama raised $5.2 million from the  entertainment industry, compared with McCain's $885,000,  according to the Center for Responsive Politics.      'It's like 10 to 1 here in terms of performing artists who  support Obama versus McCain. There are a significant group of  Republican supporters in Hollywood, but they're just not as  outspoken,' said political analyst Allan Hoffenblum.        PERSONAL STORY      Hollywood is aligning again for Obama on Sept. 16 when  Barbra Streisand will sing at a Beverly Hills event expected to  raise as much as $9 million.      While some Hollywood political watchers see Palin helping  to mobilize greater celebrity support around Obama, they said  filmmakers, producers and other entertainment executives were  fascinated by the personal story of McCain's running mate,  including her 'hockey mom' persona and passion for hunting.      'These people are interested in drama, and Sarah Palin, a  pistol-packing mother of five, is clearly an interesting  character. Politically, they may not agree with Sarah Palin but  they are intrigued,' said Joel Fox, a political analyst.      Long-time Democrat Dan Glickman, chairman of the Motion  Picture Association of America, attended the Republican  National Convention. 'It's important to show our organization  has allies in both camps. Our issues are bi-partisan,' said  Glickman.      'The question is does she become a bigger draw than McCain?  It's too early to draw any conclusions,' he said.      Palin's arrival is encouraging to Hollywood conservatives  like Robert Davi, who stars in director David Zucker's upcoming  'An American Carol,' a spoof about a liberal filmmaker who  wanted to abolish the July 4 Independence Day holiday.      'A lot of times, conservative guys on the set feel  intimidated and unable to speak their view,' said Da",
        "Histogram": [
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0.9,
            0.9,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 18.53076171875,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Sarah Palin represents  many things Hollywood liberals love to hate, from her  opposition to gay marriage to her support for gun rights, yet  she possesses two key qualities they admire -- star appeal and  a great script.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of phrases like 'love to hate' and 'great script' implies a judgment and suggests a negative connotation towards Hollywood liberals' views on Sarah Palin, influencing the reader's perception."
                },
                {
                    "text": "Accordingly, Hollywood Republicans -- often overshadowed by  their left-leaning peers -- are seeking to capitalize on the  celebrity of John McCain's running mate in the Nov. 4 election  to generate support in a town well-known for its lavish  Democratic fund-raisers and events.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'often overshadowed' and the mention of 'lavish Democratic fund-raisers' compared to the implied lack of such events for Republicans suggest a bias through the choice of words, favoring the portrayal of Republicans as underdogs."
                },
                {
                    "text": "Democratic candidates have long enjoyed a fundraising  advantage in Hollywood. Through the end of July, Democratic  presidential nominee Barack Obama raised $5.2 million from the  entertainment industry, compared with McCain's $885,000,  according to the Center for Responsive Politics.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'enjoyed' and 'advantage' without context or comparison to other industries implies a positive and possibly unfair situation for Democrats, suggesting a bias through the choice of words."
                },
                {
                    "text": "'It's like 10 to 1 here in terms of performing artists who  support Obama versus McCain. There are a significant group of  Republican supporters in Hollywood, but they're just not as  outspoken,' said political analyst Allan Hoffenblum.",
                    "bias_type": "Generalization Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This statement generalizes the level of support for Obama and McCain among performing artists in Hollywood without providing specific data, potentially misleading the reader about the actual ratio and the diversity of opinions."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias through word choice and generalization, particularly in its portrayal of Hollywood's political landscape and the dynamics of support for Sarah Palin and John McCain. The bias tends to favor a narrative of Hollywood liberals' disapproval of Palin and the challenges faced by Hollywood Republicans, with a generalization about the level of support for political figures in the entertainment industry."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6749999999999999,
            "percentage_of_biased_sentences": 0.18181818181818182,
            "overall_rating": 0.42840909090909085
        },
        "combined_score": 0.0
    },
    {
        "Title": "FACTBOX-Sarah Palin, Republican vice presidential candidate",
        "URL": "FACTBOX-Sarah Palin, Republican vice presidential candidate.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    Oct 2 (Reuters) - Republican vice presidential candidate  Sarah Palin debates her Democratic rival, Joe Biden, on  Thursday in their only face-off before the Nov. 4 presidential  election.      Following are some biographical details for Palin, a  little-known Alaska governor before she was chosen as John  McCain's running mate:           Age: 44      Birth date: Feb. 11, 1964      Birthplace: Sandpoint, Idaho      Education: University of Idaho      Husband: Todd Palin      Children: Two sons and three daughters      Religious affiliation: Has attended nondenominational  Wasilla Bible Church in recent years; previously attended  Wasilla Assembly of God, a Pentecostal church           Family: Palin moved to Alaska with her parents, a teacher  and school secretary, when she was an infant. She grew up in  Wasilla, a town of nearly 10,000 near Anchorage.      Palin was a member of the state champion girls basketball  team, where she earned the nickname 'Sarah Barracuda' for her  aggressive play. She was crowned Miss Wasilla in a 1982 beauty  pageant and later competed in the Miss Alaska contest.      Palin graduated in 1987 from the University of Idaho with a  degree in journalism and political science and eloped with her  high school boyfriend in 1988 to avoid the cost of a wedding.      The couple have five children -- two sons and three  daughters. The eldest son, Track, deployed to Iraq with the  U.S. Army in September. The youngest, son Trig, was born in  April with Down syndrome.           Career: After her graduation and marriage, Palin worked as  a television sports reporter from 1987 to 1989. She also worked  in the family's commercial fishing business and was the owner  of a snowmobile, watercraft and all-terrain vehicle business.           Elective office/public service: Palin was elected to the  Wasilla City Council in 1992. She served two terms on the  council and was elected mayor for two terms. She gained the  attention of Republican Party officials by promoting growth and  cutting property taxes.      Palin ran for lieutenant governor in 2002 but lost. After  actively campaigning for the Republican ticket under Frank  Murkowski, she was appointed to the panel that regulates the  state's oil and gas industry.      Palin established herself as a party outsider by promoting  a pipeline project opposed by Murkowski. She ran against the  governor in 2006, defeated him in the primary and then defeated  a former Democratic governor in the general election.      As governor she has worked on ethics reform, sought to  reduce state spending and promoted a deal that would offer $500  million in seed money for the construction of a natural gas  pipeline.      She ignited a controversy by firing the state's respected  top police officer. He charged he was dismissed for resisting  pressure from the governor's office to lay off a state trooper  who was involved in a bitter divorce and custody dispute with  Palin's sister. The state Legislature is investigating the  incident.      Sources: Reuters, Almanac of American Politics   (Editing by David Wiessler)   ((david.alexander@reuters.com; 202 354-5866;  david.alexander.reuters.com@reuters.net))  Keywords: USA POLITICS/PALIN        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 18.35730743408203,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it primarily provides factual information about Sarah Palin's background, career, and public service without employing any of the typical bias types."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "FACTBOX-Facts about McCain VP pick Sarah Palin",
        "URL": "FACTBOX-Facts about McCain VP pick Sarah Palin.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    Sept 1 (Reuters) - Here are some facts about Republican  vice presidential candidate Sarah Palin and how her selection  could affect the ticket headed by Sen. John McCain.      * Palin was sworn in as Alaska's youngest and first woman  governor in December 2006. Born in Sandpoint, Idaho, Feb. 11,  1964, she moved to Alaska with her parents as an infant.      * Palin is a darling of U.S. conservatives because of her  record on tax cuts, opposition to abortion and other issues. A  devout Christian, her place on the ticket may help shore up  McCain with the Republican Party's Christian base.      * Palin, 44, announced on Monday that her 17-year-old  unmarried daughter, Bristol, is pregnant and will keep the baby  and marry the father.      * The disclosure was made as a way to rebut rumors  circulating on liberal blog sites that Gov. Palin herself had  faked a pregnancy in order to cover up Bristol's pregnancy.      * Gov. Palin, who is staunchly anti-abortion, gave birth in  April to Trig Palin, her fifth child, a son born with Down  syndrome.      * Palin remains under investigation by Alaska's state  legislature to determine if she fired a public safety  commissioner after he declined to fire a state trooper who had  divorced Palin's sister.      * Democrats contend that Palin lacks experience to be a  heartbeat away from the presidency and say her selection  weakens McCain's argument their candidate Barack Obama, a  first-term U.S. senator, is too green to be president.    ((For more about the U.S. political campaign, visit Reuters  'Tales from the Trail: 2008' online at  http:/blogs.reuters.com/trail08/))   ((For a TAKE A LOOK on the campaign click on [US/VOTE]))  Keywords: USA POLITICS/PALIN        ",
        "Histogram": [
            0,
            0,
            0,
            0.5,
            0.5,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0.8,
            0
        ],
        "Relevance": 17.949974060058594,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Palin is a darling of U.S. conservatives because of her record on tax cuts, opposition to abortion and other issues. A devout Christian, her place on the ticket may help shore up McCain with the Republican Party's Christian base.",
                    "bias_type": "Political Bias",
                    "bias_strength": 0.5,
                    "bias_description": "This sentence shows a political bias by favorably portraying Palin's attributes in a way that suggests she is a positive figure for the Republican Party, particularly with the Christian base, without providing a balanced view."
                },
                {
                    "text": "The disclosure was made as a way to rebut rumors circulating on liberal blog sites that Gov. Palin herself had faked a pregnancy in order to cover up Bristol's pregnancy.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the word 'rebut' and the specific mention of 'liberal blog sites' implies a judgment and suggests a defensive stance, which could influence the reader's perception about the credibility of the rumors and the sources."
                },
                {
                    "text": "Democrats contend that Palin lacks experience to be a heartbeat away from the presidency and say her selection weakens McCain's argument their candidate Barack Obama, a first-term U.S. senator, is too green to be president.",
                    "bias_type": "Political Bias",
                    "bias_strength": 0.8,
                    "bias_description": "This sentence exhibits political bias by directly comparing Palin's experience negatively to Obama's, implying a double standard in the criticism of experience levels between the two candidates."
                }
            ],
            "overall_bias": {
                "conclusion": "The article is biased regarding the portrayal of Sarah Palin, showing political bias by favoring her attributes without a balanced view, and using word choice that implies judgment about the credibility of sources. The general bias tendency leans towards supporting Palin's position within the Republican Party while undermining criticisms from the Democratic side."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6333333333333334,
            "percentage_of_biased_sentences": 0.23076923076923078,
            "overall_rating": 0.43205128205128207
        },
        "combined_score": 0.0
    },
    {
        "Title": "FACTBOX-Sarah Palin, Republican US vice presidential candidate",
        "URL": "FACTBOX-Sarah Palin, Republican US vice presidential candidate.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    Nov 4 (Reuters) - Alaska Gov. Sarah Palin is the first  woman to run on a Republican presidential ticket.      Following are some biographical details about Palin, who  was little known nationally before she was chosen as John  McCain's vice presidential running mate:           Age: 44      Birth date: Feb. 11, 1964      Birthplace: Sandpoint, Idaho      Education: University of Idaho      Husband: Todd Palin      Children: Two sons and three daughters      Religious affiliation: Christian who has attended  nondenominational Wasilla Bible Church in recent years;  previously attended Wasilla Assembly of God, a Pentecostal  church.      Family: Palin moved to Alaska with her parents, a teacher  and school secretary, when she was an infant. She grew up in  Wasilla, a small town near Anchorage.      Palin was a member of the state champion girls basketball  team, on which she was nicknamed 'Sarah Barracuda' for her  aggressive play. She was crowned Miss Wasilla in a 1982 beauty  pageant and later competed in the Miss Alaska contest.      Palin graduated in 1987 from the University of Idaho with a  degree in journalism and political science and eloped with her  high school boyfriend in 1988 to avoid the cost of a wedding.      The couple have five children -- two sons and three  daughters. The eldest son, Track, deployed to Iraq with the  U.S. Army in September. The youngest, son Trig, was born in  April with Down syndrome.        Career: After her graduation and marriage, Palin worked as  a television sports reporter from 1987 to 1989. She also worked  in the family's commercial fishing business and was the owner  of a snowmobile, watercraft and all-terrain vehicle business.           Elective office/public service: Palin was elected to the  Wasilla City Council in 1992. She served two terms on the  council and was elected mayor for two terms. She gained the  attention of Republican Party officials by promoting growth and  cutting property taxes.      Palin ran for lieutenant governor in 2002 but lost. After  campaigning for the Republican ticket under Frank Murkowski,  she was appointed to the panel that regulates Alaska's oil and  gas industry.      Palin established herself as a party outsider by promoting  a pipeline project opposed by Murkowski. She ran against the  governor in 2006, defeated him in the primary and then defeated  a former Democratic governor in the general election.      As governor, she has worked on ethics reform, sought to  reduce state spending and promoted a deal that would offer $500  million in seed money for constructing a natural gas pipeline.      She ignited controversy by firing the state's respected top  police officer. He charged he was dismissed for resisting  pressure from Palin's office to lay off a state trooper  involved in a bitter divorce and custody dispute with her  sister. A state legislative inquiry concluded in October that  Palin had abused her power by pressuring subordinates to fire  the trooper. The Alaska Personnel Board on Monday cleared her  of wrongdoing in the matter.    Sources: Reuters, Almanac of American Politics   ((david.alexander@reuters.com; 202 354-5866;  david.alexander.reuters.com@reuters.net))    (For more about the U.S. political campaign, visit Reuters  'Tales from the Trail: 2008' online at  http:blogs.reuters.com/trail08/)    (For full campaign coverage double click on [US/VOTE])     Keywords: USA ELECTION/PALIN        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 17.859786987304688,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article provides a factual overview of Sarah Palin's biography, career, and political controversies without exhibiting any noticeable bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Sarah Palin leaves door open to future campaigns",
        "URL": "Sarah Palin leaves door open to future campaigns.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    WASHINGTON, Nov 10 (Reuters) - Alaska Gov. Sarah Palin  suggested in an interview broadcast on Monday that she might  run for higher office in 2012 if the right opportunity presents  itself.      Even before the Republican loss in last Tuesday's election  in which Palin was the running mate of Republican presidential  candidate John McCain, there was talk of the 44-year-old  first-term Alaska governor running for president in 2012.      'Show me where the open door is. Even if it's cracked up a  little bit, maybe I'll plow right on through that and maybe  prematurely plow through it, but don't let me miss an open  door,' Palin said in an interview on Fox News' 'On The Record'  program. She did not specify which office she might be  interested in seeking.      Palin, whose term as governor ends in two years,  said she  could not predict the future. But she said it would be 'very  exciting' to have an opportunity to serve in a greater  capacity.      'If there is an open door in '12 or four years later, and  if it is something that is going to be good for my family, for  my state, for my nation, an opportunity for me, then I'll plow  through that door,' Palin said.      As McCain's surprise pick in a hard-fought campaign against  Democrat Barack Obama, Palin attracted controversy but also a  strong following in the Republican Party's conservative base.   (Writing by JoAnne Allen; Editing by Peter Cooney)   ((Washington newsroom, fax +1 202 898 8383,  washington.bureau.newsroom@reuters.com))  Keywords: USA POLITICS/PALIN       ",
        "Histogram": [
            0,
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 17.749189376831055,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Even before the Republican loss in last Tuesday's election in which Palin was the running mate of Republican presidential candidate John McCain, there was talk of the 44-year-old first-term Alaska governor running for president in 2012.",
                    "bias_type": "Speculation Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence engages in speculation about Palin's future political endeavors based on conjecture rather than concrete facts or definitive evidence."
                },
                {
                    "text": "'Show me where the open door is. Even if it's cracked up a little bit, maybe I'll plow right on through that and maybe prematurely plow through it, but don't let me miss an open door,' Palin said in an interview on Fox News' 'On The Record' program. She did not specify which office she might be interested in seeking.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of dramatic language to describe Palin's approach to a potential political future, such as 'plow right on through' and 'prematurely plow through it,' is designed to evoke strong emotions and sensationalize the statement."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding Sarah Palin's future political aspirations, particularly through the use of speculative language and emotional sensationalism in discussing her potential candidacy for higher office."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.36363636363636365,
            "overall_rating": 0.4818181818181818
        },
        "combined_score": 0.0
    },
    {
        "Title": "FACTBOX-The life of McCain VP pick Sarah Palin",
        "URL": "FACTBOX-The life of McCain VP pick Sarah Palin.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    Sept 3 (Reuters) - Here are some facts about Sarah Palin,  who rose quickly from small-town mayor to one of the most  popular governors in Alaskan history before her surprise  selection as Republican John McCain's vice presidential running  mate.      * Born in Sandpoint, Idaho, on Feb. 11, 1964, she moved to  Alaska with her parents as an infant. As a star on the state  champion Wasilla High School girls' basketball team, she was  known as 'Sarah Barracuda' for her aggressive play. She  graduated in 1987 from the University of Idaho, where she  studied journalism. She worked as a sports reporter at an  Anchorage television station in 1988.      * She entered politics in 1992 by running for the city  council in Wasilla, a town outside Anchorage that then had  about 5,000 residents. She was re-elected to a second term in  1995, and became Wasilla's mayor in 1996.      * She gained statewide fame as a whistle-blower calling  attention to ethical violations by high-ranking Republican  officials in Alaska, including the chairman of the state  Republican party and was sworn in as the state's youngest and  first woman governor in December 2006.      * As governor, Palin has spoken out against corruption,  battled for funding from major oil producers and convinced the  legislature to give a $1,200 'energy rebate' to nearly every  Alaskan. Her approval rating in the state stands at 80  percent.      * Palin is under investigation by Alaska's state  legislature to determine whether she fired a public safety  commissioner after he declined to fire a state trooper who had  divorced Palin's sister. Palin has hired a private lawyer in  the probe.     * Palin married her high school sweetheart, Todd Palin, in  1988. A champion snowmachine racer, Todd Palin is a commercial  fisherman who has worked for BP and has been a production  operator in oil fields on Alaska's North Slope.     * Palin, who has five children including a son born in April  with Down Syndrome and an unmarried 17-year-old who is  pregnant, is favored by social conservatives because of her  opposition to abortion, devout Christianity and lifetime  membership in the National Rifle Association.     * In 1984, Palin won the Miss Wasilla pageant, and finished  second in the Miss Alaska pageant, at which she was named 'Miss  Congeniality.    (Compiled by Patricia Zengerle; editing by Jackie Frank)    ((For more about the U.S. political campaign, visit Reuters  'Tales from the Trail: 2008' online at  http:/blogs.reuters.com/trail08/))   ((For a TAKE A LOOK on the campaign click on [US/VOTE]))  Keywords: USA POLITICS/PALIN LIFE        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0,
            0
        ],
        "Relevance": 17.73606300354004,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Palin, who has five children including a son born in April with Down Syndrome and an unmarried 17-year-old who is pregnant, is favored by social conservatives because of her opposition to abortion, devout Christianity and lifetime membership in the National Rifle Association.",
                    "bias_type": "Discriminatory Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence exhibits discriminatory bias by highlighting personal and sensitive information about Palin's family, such as her son's condition and her daughter's pregnancy, in a manner that could be seen as reinforcing stereotypes or judgments about social conservatives."
                }
            ],
            "overall_bias": {
                "conclusion": "The article contains discriminatory bias, particularly in its discussion of Sarah Palin's personal life and the reasons for her favor among social conservatives. The bias tendency leans towards portraying certain social and political beliefs in a negative light."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.058823529411764705,
            "overall_rating": 0.32941176470588235
        },
        "combined_score": 0.0
    },
    {
        "Title": "Sarah Palin to step into Tina Fey's satirical den",
        "URL": "Sarah Palin to step into Tina Fey's satirical den.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Jill Serjeant      LOS ANGELES, Oct 17 (Reuters) - Sarah Palin steps into the  lion's den of political satire on Saturday with an appearance on  the comedy show that has mocked the Republican vice-presidential  candidate and helped shape the national debate.      Palin's appearance on 'Saturday Night Live' follows a series  of dead-on impersonations of her by comedian Tina Fey that have  sent ratings for the show soaring and become as talked about as  the Alaska governor and self-described hockey mom herself.      Actor Josh Brolin, who captures the Texas swagger and twang  of President George W. Bush in the new Oliver Stone biopic  'W.', is expected to join Palin on Saturday's show, just 17 days  before the Nov. 4 election.      'I just want to be there to show Americans that we will  rise above the political shots that we take because we're in  this serious business for serious challenges that are facing  the good American people right now,' Palin told Neal Boortz,  talking about the forthcoming SNL appearance on his syndicated  radio show on Friday.      It was not clear whether Fey, the Emmy-award winning star  of the TV show '30 Rock' and the movie 'Baby Mama', will  reprise her own turn as Palin. Fey's three skits have boosted  'Saturday Night Live' ratings by 50 percent in the past month  and attracted more than 38 million viewings live or online.      Fey's impersonations have included an 'I can see Russia from  my house' joke skewering what critics see as Palin's lack of  foreign policy knowledge, and a flute-toting bid for a 'talent  portion' during the vice presidential debate that played on  critics' charges that Palin, a one-time beauty pageant contestant,  is too shallow for the vice presidency.      The skits have capped a political season in which comedy has  played an influential role.      Palin was a surprise pick by Republican presidential candidate  John McCain in August as his running mate, and has been a big hit  with conservative Christians who admire her no-nonsense, folksy  style. But the choice has been derided by supporters of Democratic  candidate Barack Obama, thanks in part to the Fey skits.      'I would expect that the McCain campaign would be much happier  if Tina Fey wasn't so popular with her impersonation of Sarah  Palin,' Sherry Bebitch Jeffe, a political analyst at the  University of Southern California, told Reuters.      'It does shape the public perception of Sarah Palin,' Jeffe  said.      Democrats Obama, Hillary Clinton and Joe Biden have also been  lampooned on SNL, and both Obama and McCain have appeared on the  show during the long presidential campaign.           GOING WHERE OTHERS DON'T TREAD      Satirical news shows like 'The Colbert Report' and Jon  Stewart's 'The Daily Show' along with jokes by late night chat  show hosts David Letterman and Jay Leno have gone where  straight news reporting has often feared to tread, according to  Robert Thompson, professor of media and popular culture at  Syracuse University.      'We are in a period now that journalists are afraid of  being accused of picking on people. Comedy is not only  influential but lately it has become an important part of the  U.S. civic conversation,' Thompson said.      'What Jon Stewart and Tina Fey are doing is not only  hysterically funny, but they really have used comedy to make us  ask questions about the things we should be thinking about.'      Thompson said Fey's skit of Palin's rambling television  intervi",
        "Histogram": [
            0,
            0.6,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 17.451080322265625,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Palin's appearance on 'Saturday Night Live' follows a series  of dead-on impersonations of her by comedian Tina Fey that have  sent ratings for the show soaring and become as talked about as  the Alaska governor and self-described hockey mom herself.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'dead-on impersonations' and 'self-described hockey mom' carries a connotation of judgment and belittlement, implying that the impersonations are accurate to a fault and that Palin's self-description is not to be taken seriously."
                },
                {
                    "text": "'I just want to be there to show Americans that we will  rise above the political shots that we take because we're in  this serious business for serious challenges that are facing  the good American people right now,' Palin told Neal Boortz,  talking about the forthcoming SNL appearance on his syndicated  radio show on Friday.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence presents Palin's statement in a way that implies a judgment on the nature of the political discourse, suggesting that the challenges are 'serious' and that the 'good American people' are the ones affected, which reflects a subjective perspective."
                },
                {
                    "text": "It was not clear whether Fey, the Emmy-award winning star  of the TV show '30 Rock' and the movie 'Baby Mama', will  reprise her own turn as Palin. Fey's three skits have boosted  'Saturday Night Live' ratings by 50 percent in the past month  and attracted more than 38 million viewings live or online.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The emphasis on Fey's accolades and the impact of her skits with specific statistics serves to elevate her status and the importance of her impersonations, potentially overshadowing the actual political significance of the events."
                },
                {
                    "text": "Fey's impersonations have included an 'I can see Russia from  my house' joke skewering what critics see as Palin's lack of  foreign policy knowledge, and a flute-toting bid for a 'talent  portion' during the vice presidential debate that played on  critics' charges that Palin, a one-time beauty pageant contestant,  is too shallow for the vice presidency.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'skewering' and 'too shallow' to describe the criticisms and the inclusion of the 'I can see Russia from my house' joke without context or counterpoint implies a judgment about Palin's qualifications and the validity of the criticisms."
                },
                {
                    "text": "The skits have capped a political season in which comedy has  played an influential role.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This statement asserts the influence of comedy in the political season as a fact, without providing evidence or a balanced perspective, thus presenting a subjective opinion as an objective truth."
                },
                {
                    "text": "Palin was a surprise pick by Republican presidential candidate  John McCain in August as his running mate, and has been a big hit  with conservative Christians who admire her no-nonsense, folksy  style. But the choice has been derided by supporters of Democratic  candidate Barack Obama, thanks in part to the Fey skits.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'big hit' and 'derided' to describe the reactions to Palin's candidacy from different groups implies a judgment about the validity and significance of these reactions, suggesting a positive bias towards the former and a negative bias towards the latter."
                },
                {
                    "text": "'I would expect that the McCain campaign would be much happier  if Tina Fey wasn't so popular with her impersonation of Sarah  Palin,' Sherry Bebitch Jeffe, a political analyst at the  University of Southern California, told Reuters.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This quote assumes the emotional state of the McCain campaign based on the popularity of Fey's impersonation, attributing a specific desire ('much happier') to the campaign without direct evidence, thus presenting a subjective opinion as a likely fact."
                }
            ],
            "overall_bias": {
                "conclusion": "The article is biased regarding Sarah Palin's portrayal in the media, particularly through the lens of the impact of Tina Fey's impersonations on 'Saturday Night Live.' The biases identified include Word Choice Bias and Opinionated Bias, with a general tendency to present subjective opinions and judgments as objective facts, and to use language that implies a certain perspective on Palin's character and qualifications."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.2631578947368421,
            "overall_rating": 0.43157894736842106
        },
        "combined_score": 0.0
    },
    {
        "Title": "FACTBOX-Alaska Gov. Sarah Palin, McCain running mate",
        "URL": "FACTBOX-Alaska Gov. Sarah Palin, McCain running mate.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    Aug 29, (Reuters) - Republican presidential candidate John  McCain has chosen Alaska Gov. Sarah Palin as his vice  presidential running mate, a campaign official said on Friday.      The choice of the 44-year-old mother of five adds youth and  executive experience to the Republican ticket headed by the  72-year-old Arizona senator, who would be the oldest person to  assume the presidency if he is elected Nov. 4.      The choice of Palin adds a woman and a strong pro-life  voice to the Republican campaign, but her youth, limited  governmental experience and lack of exposure nationally could  be weaknesses for the ticket.      Following are some facts and figures about Palin:      * Palin was sworn in as Alaska's youngest and first woman  governor in December 2006. Born in Sandpoint, Idaho, Feb. 11,  1964, she moved to Alaska with her parents as an infant.      * Palin is a darling of U.S. conservatives because of  record on tax cuts, opposition to abortion and other issues.  Her place on the ticket may help shore up McCain with the  Republican Party's Christian base.      * Before her election as governor two years ago, she served  on the Wasilla City Council and as mayor of the town. She was  later appointed to the Alaska Oil and Gas Conservation  Commission, where she learned about the state's energy  industry.      * Like McCain she has a maverick streak. She has taken on  big oil companies in Alaska and has broken ranks with the local  Republican establishment.      * 'The oil companies have been hugely influential in  Alaska, certainly over the last decade and a half with the  prior two administrations ... (For) Alaskans, as owners of the  resource ... it is time to embrace our sovereignty,' she told  Reuters in an interview a few months ago.      * Palin is a devout Christian who is opposed to abortion  rights. She is also an avid hunter and angler and a member of  the National Rifle Association, a powerful conservative lobby  that is staunchly opposed to gun control.      * She has irked environmentalists by opposing the listing  of the polar bear as a threatened species and is a big  supporter of oil and gas drilling off the Alaska coast.      * Palin, who grew up in Wasilla, near Anchorage, studied  journalism and political science at the University of Idaho.  She worked in a commercial fishing business with her husband  and as a television sportscaster before entering politics.      * Palin gave birth to her fifth child, a son, in April,  becoming the second U.S. governor to have a baby while serving  in office.   ((Washington World Desk, 202-898-8457))      Keywords: USA POLITICS/PALIN        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 17.006084442138672,
        "BiasReport": {
            "sentences": [
                {
                    "text": "The choice of Palin adds a woman and a strong pro-life voice to the Republican campaign, but her youth, limited governmental experience and lack of exposure nationally could be weaknesses for the ticket.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the word 'weaknesses' to describe Palin's attributes implies a negative judgment and suggests that her characteristics are inherently detrimental to the ticket, which could influence the reader's perception negatively."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits a Word Choice Bias regarding Sarah Palin's attributes, suggesting that her inclusion in the Republican campaign may have inherent weaknesses. This bias could influence the reader's perception negatively towards Palin's candidacy."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.047619047619047616,
            "overall_rating": 0.32380952380952377
        },
        "combined_score": 0.0
    },
    {
        "Title": "Sarah Palin most desirable celebrity neighbor-poll",
        "URL": "Sarah Palin most desirable celebrity neighbor-poll.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    LOS ANGELES, Dec 30 (Reuters) - If they had to live next  door to a celebrity, American adults would most like to be  neighbors with Alaska Gov. Sarah Palin and chat show host Oprah  Winfrey.      But trouble-prone pop star Britney Spears would be the  worst celebrity neighbor, according to a survey published on   Tuesday of the most and least desirable well-known faces  Americans would have in their backyard.      Republican vice presidential candidate Palin topped the  poll of most desirable celebrity neighbors with 14 percent,  closely followed by Winfrey, who was particularly popular with  women.      Olympic champion swimmer Michael Phelps was heavily favored  by men but came in third with 9 percent overall.      Paparazzi-magnets such as Spears, actress Lindsay Lohan and  British couple David and Victoria Beckham apparently don't make  the best neighbors.      Spears, who was followed day and night by packs of  photographers for much of 2008, was voted the least desirable  neighbor by 19 percent of adults, followed by Rosie O'Donnell  (18 percent), Joe the Plumber (8 percent), who made headlines  in the final stages of the U.S. presidential elections, and  Lohan (7 percent).      Only two per cent of those asked wanted to live next door  to soccer player Beckham and his singer wife Victoria.      The poll was commissioned by real estate Web site  Zillow.com between Dec 15-17 with 2,196 Americans aged over  18.    (Reporting by Jill Serjeant, editing by Dan Whitcomb)   ((jill.serjeant1@thomsonreuters.com; +1 213 955 6749))    (To read more about our entertainment news, visit our blog  'Fan Fare' online at http://blogs.reuters.com/fanfare/)    Keywords: PEOPLE NEIGHBORS       ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 16.4242000579834,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it simply reports the results of a survey on the most and least desirable celebrity neighbors based on the opinions of American adults."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "FACTBOX-Scenarios for McCain VP pick Sarah Palin",
        "URL": "FACTBOX-Scenarios for McCain VP pick Sarah Palin.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "     Sept 3 (Reuters) - Republican presidential candidate John  McCain's newly chosen running mate, Alaska Gov. Sarah Palin,  created an immediate stir with news that she is the subject of  a state ethics probe and her unmarried teenage daughter is  pregnant.      Palin will accept the nomination on Wednesday in a speech  to the Republican convention. Here are some potential scenarios  for her candidacy and its impact on the Nov. 4 presidential  election against Democratic presidential candidate Barack Obama  and his No. 2, Joe Biden.      - The choice of Palin, 44, a conservative abortion rights  opponent with a record of bucking the Republican establishment  in Alaska, has rallied the conservative base to McCain, who has  struggled to win over that crucial constituency.      Her speech will give the party a chance to answer questions  about her familiarity with domestic and foreign policy issues,  and possibly address the issue of her 17-year-old daughter's  pregnancy and the investigation into whether she abused her  power in having a public safety commissioner fired in Alaska.      'She'll be greeted rapturously because the delegates are  very conservative, as is she,' University of Virginia political  analyst Larry Sabato said of her convention appearance. 'She's  become their heroine. But what the delegates think and what the  country thinks are probably two different things.'      - The selection of the political unknown has raised  questions about McCain's judgment and the degree to which his  campaign investigated Palin's background. That is a distraction  that could hurt the campaign's efforts to generate momentum for  the election battle with Obama.      'My vetting process was completely thorough and I'm  grateful for the results,' McCain told reporters in  Philadelphia.      - Palin's slot on the ticket is secure, but new revelations  or scandals from Alaska could threaten her standing. It would  take a lot, however, to dump her two months before the  election.      'If he drops her, the election is over. There's zero chance  that he'll drop her,' Sabato said.   (Writing by John Whitesides, editing by Jackie Frank)   ((For more about the U.S. political campaign, visit Reuters  'Tales from the Trail: 2008' online at  http:/blogs.reuters.com/trail08/))   ((For a TAKE A LOOK on the campaign click on [US/VOTE]))  Keywords: USA POLITICS/PALIN SCENARIOS        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0.6,
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 16.318317413330078,
        "BiasReport": {
            "sentences": [
                {
                    "text": "The choice of Palin, 44, a conservative abortion rights opponent with a record of bucking the Republican establishment in Alaska, has rallied the conservative base to McCain, who has struggled to win over that crucial constituency.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'bucking the Republican establishment' implies a positive, rebellious connotation, suggesting strength and independence, which could influence the reader's perception positively towards Palin's character."
                },
                {
                    "text": "'She'll be greeted rapturously because the delegates are very conservative, as is she,' University of Virginia political analyst Larry Sabato said of her convention appearance. 'She's become their heroine. But what the delegates think and what the country thinks are probably two different things.'",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The statement implies a judgment on the delegates' and Palin's character, suggesting a disconnection between their views and the broader public's, which could influence the reader to question the legitimacy of Palin's support."
                },
                {
                    "text": "The selection of the political unknown has raised questions about McCain's judgment and the degree to which his campaign investigated Palin's background. That is a distraction that could hurt the campaign's efforts to generate momentum for the election battle with Obama.",
                    "bias_type": "Speculation Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The assertion that Palin is a 'political unknown' and the speculation about the impact on McCain's campaign are based on conjecture rather than concrete evidence, potentially leading the reader to doubt Palin's qualifications without sufficient reason."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias through word choice, opinionated statements, and speculative assertions, particularly regarding Sarah Palin's character and impact on McCain's campaign. The biases are centered around questioning Palin's qualifications and the judgment of those who support her, with a general tendency towards casting doubt on her suitability for the role."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.3333333333333333,
            "overall_rating": 0.4666666666666667
        },
        "combined_score": 0.0
    },
    {
        "Title": "Sarah Palin controversy stokes U.S. Mommy War",
        "URL": "Sarah Palin controversy stokes U.S. Mommy War.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Andrea Hopkins      CINCINNATI, Sept 2 (Reuters) - In America, where teenage  pregnancy is a political issue and working moms subject to  moral debate, the choice of Sarah Palin as the Republican  vice-presidential pick has ignited a Mommy War.      Questions about Palin's qualifications were raised almost  as soon as presidential candidate John McCain shocked the  political world by picking the relatively unknown Alaska  governor to be his running mate last week.      The emergence of personal details has fueled the debate.      News that Palin, a conservative Christian, is running for the  country's No. 2 office while parenting both an infant son with  Down Syndrome and a 17-year-old pregnant daughter has sparked both  condemnation and commendation.      Should a 44-year-old mother of five, including a newborn  with special needs and a pregnant teenager, take on a job that  will keep her away from her home for much of the next two months  to eight years?      Nearly two-thirds of American mothers with preschool-aged  children were in the labor force in 2003, according to the  latest government figures. Women rich and poor, famous or not,  grapple with the same issues and public perceptions.      The Republican Party's conservative base, having worked to  co-opt moral issues for their political cause, so far has  rallied around Palin and her daughter despite its promotion of  abstinence education and traditional families.      The daughter will have the child and marry the father.      'I can't get past the part of the scripture that says it is  the responsibility of the parents to raise the child. But I do  believe that some parents can raise their children well and not  stay home all the time,' said Lindsay Matlock, an anti-abortion  volunteer at this week's Republican convention in Minnesota.      'My only reservation would be that her son has Down  Syndrome and ... her being away so much,' said Matlock, 21.      Dr. Bill Maier, vice president and psychologist in  residence for the conservative Christian group Focus on the  Family, came to the candidate's defense, saying: 'Gov. Palin  seems to have been able to maintain a balance between work and  family.'           SEXISM?      The very fact that Americans are debating whether a woman  with a new baby should be in a demanding job galls Carol Evans,  president and chief executive of Working Mother Media, which  publishes Working Mother magazine.      'The fact that the United States is the only developed  country without paid maternity leave should be front and  center, not whether (Palin) can go back to work with a  four-month old,' said Evans, noting that the average American  working mother returns to work 11 weeks after giving birth.      A question that emerges for Americans of all political  stripes is: Would any of this be asked if Palin was a man?      'If we say a woman can't have a career when her children  are babies, we are discriminating based on gender,' said  Democrat Barbara Matousek, a 41-year-old Wisconsin engineer and  working mother of an 8-month-old.      She was concerned, however, about Palin's other child.      'The thing I have trouble reconciling is how any parent,  male or female, could agree to take on this very public  position at a time when their child is so fragile,' she said.  'Being a pregnant, unmarried, 17-year-old high school student  would be hard enough without the entire world watching.'      Some voters saw authenticity in Palin's life",
        "Histogram": [
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0.5,
            0.5,
            0.6,
            0,
            0.5,
            0.5,
            0.6,
            0,
            0,
            0,
            0.6,
            0.7,
            0,
            0.6,
            0,
            0.6,
            0.6,
            0
        ],
        "Relevance": 16.292991638183594,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Questions about Palin's qualifications were raised almost  as soon as presidential candidate John McCain shocked the  political world by picking the relatively unknown Alaska  governor to be his running mate last week.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'shocked the political world' implies a judgment about the unexpected nature of the decision, suggesting it was inherently controversial or wrong without providing a neutral perspective."
                },
                {
                    "text": "The emergence of personal details has fueled the debate.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'fueled the debate' suggests that personal details have unnecessarily inflamed the situation, implying a negative connotation towards the discussion's intensity."
                },
                {
                    "text": "News that Palin, a conservative Christian, is running for the  country's No. 2 office while parenting both an infant son with  Down Syndrome and a 17-year-old pregnant daughter has sparked both  condemnation and commendation.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'conservative Christian' alongside the details of her personal life introduces a judgmental tone, implying that her religious and family background are inherently controversial in this context."
                },
                {
                    "text": "Should a 44-year-old mother of five, including a newborn  with special needs and a pregnant teenager, take on a job that  will keep her away from her home for much of the next two months  to eight years?",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence presents a subjective opinion on the appropriateness of Palin's decision to pursue a demanding job role, framing it in a way that suggests a negative judgment on her capacity as a mother."
                },
                {
                    "text": "Nearly two-thirds of American mothers with preschool-aged  children were in the labor force in 2003, according to the  latest government figures. Women rich and poor, famous or not,  grapple with the same issues and public perceptions.",
                    "bias_type": "Generalization Bias",
                    "bias_strength": 0.5,
                    "bias_description": "While providing statistics, the sentence generalizes the experiences of American mothers, implying a universal struggle without acknowledging the diversity of individual circumstances and choices."
                },
                {
                    "text": "The Republican Party's conservative base, having worked to  co-opt moral issues for their political cause, so far has  rallied around Palin and her daughter despite its promotion of  abstinence education and traditional families.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'co-opt moral issues' suggests a manipulative or insincere strategy by the Republican Party, casting their support for Palin in a negative light by implying it is at odds with their stated values."
                },
                {
                    "text": "'I can't get past the part of the scripture that says it is  the responsibility of the parents to raise the child. But I do  believe that some parents can raise their children well and not  stay home all the time,' said Lindsay Matlock, an anti-abortion  volunteer at this week's Republican convention in Minnesota.",
                    "bias_type": "Anecdotal Evidence Bias",
                    "bias_strength": 0.5,
                    "bias_description": "This quote relies on an individual's opinion and interpretation of scripture to make a broader point about parenting, without considering the diversity of views or the complexity of the issue."
                },
                {
                    "text": "'My only reservation would be that her son has Down  Syndrome and ... her being away so much,' said Matlock, 21.",
                    "bias_type": "Ad Hominem Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This statement indirectly questions Palin's ability to balance work and family due to her son's condition, targeting her personal circumstances rather than addressing her qualifications or the role's demands directly."
                },
                {
                    "text": "The very fact that Americans are debating whether a woman  with a new baby should be in a demanding job galls Carol Evans,  president and chief executive of Working Mother Media, which  publishes Working Mother magazine.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'galls' expresses a strong, subjective opinion about the appropriateness of the debate, suggesting it is inherently offensive or unjust without providing a balanced perspective."
                },
                {
                    "text": "'The fact that the United States is the only developed  country without paid maternity leave should be front and  center, not whether (Palin) can go back to work with a  four-month old,' said Evans, noting that the average American  working mother returns to work 11 weeks after giving birth.",
                    "bias_type": "Causal Misunderstanding Bias",
                    "bias_strength": 0.7,
                    "bias_description": "This statement implies a direct cause-and-effect relationship between the absence of paid maternity leave and the debate about Palin's situation, oversimplifying a complex issue."
                },
                {
                    "text": "'If we say a woman can't have a career when her children  are babies, we are discriminating based on gender,' said  Democrat Barbara Matousek, a 41-year-old Wisconsin engineer and  working mother of an 8-month-old.",
                    "bias_type": "False Dichotomy Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence presents the issue as a binary choice between allowing women to have a career with young children and discriminating against them, ignoring the possibility of more nuanced discussions or solutions."
                },
                {
                    "text": "'The thing I have trouble reconciling is how any parent,  male or female, could agree to take on this very public  position at a time when their child is so fragile,' she said.  'Being a pregnant, unmarried, 17-year-old high school student  would be hard enough without the entire world watching.'",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This statement expresses a strong opinion on the challenges faced by a young, pregnant, unmarried individual in the public eye, framing it in a way that suggests an inherent injustice or undue hardship."
                }
            ],
            "overall_bias": {
                "conclusion": "The article is biased regarding the discussion of Sarah Palin's candidacy and personal circumstances, showing a general bias tendency through word choice, opinionation, and the use of individual anecdotes to support broader claims about gender, parenting, and political involvement."
            }
        },
        "Scores": {
            "average_bias_strength": 0.5916666666666666,
            "percentage_of_biased_sentences": 0.4583333333333333,
            "overall_rating": 0.5249999999999999
        },
        "combined_score": 0.0
    },
    {
        "Title": "Sarah Palin effigy hung in Halloween display",
        "URL": "Sarah Palin effigy hung in Halloween display.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Dan Whitcomb      LOS ANGELES, Oct 27 (Reuters) - An effigy of U.S.  Republican vice-presidential nominee Sarah Palin hanging by a  noose as part of a Halloween display drew complaints on Monday,  but local officials said the homeowner was covered by free  speech rights.      A mannequin dressed to resemble the Alaska governor, with  her trademark beehive hairdo and glasses, was hung by the neck  from the eaves of the home in famously liberal West Hollywood.      On the roof, a mannequin of Republican presidential  candidate John McCain, protruded from the chimney surrounded in  flames, holding his head as he was apparently burned alive.      'We have been getting some phone calls this morning  complaining about it but if (the homeowner) isn't in violation  of municipal code we have no reason to cite them,' West  Hollywood spokeswoman Helen Goss said.      'People have First Amendment rights (to free speech),' Goss  said. 'I would speculate that if it's part of a Halloween  display then its political satire.'      Homeowner Chad Michael Morisette told local KCAL-TV the  display should be considered Halloween 'art' and said his  neighbors would probably be more offended by a similar scene  invoking Democrat Barack Obama.      'I know if we had done Barack Obama, people would have  probably thrown things through our windows,' Morisette said.  'The image of a hanged black man is a lot more intense than the  image of a hanged white woman for our country, the history of  our country.'      Earlier a cardboard likeness of Obama was strung up from a  tree at an Oregon university and an Ohio man who told local  media he didn't want to see an African-American running the  country hung a ghostly figure bearing an Obama sign from a tree  in his yard.      If he wins the Nov. 4 election, Obama will be the first  African American to become U.S. president.      West Hollywood is known for its large gay population and  its liberal politics. It hosts a large and flamboyant outdoor  Halloween parade each year.      Palin, who is seen as more conservative than running-mate  McCain, has been a lightning-rod of criticism from the left  since her nomination to the ticket.   (Editing by Jill Serjeant)   ((Reuters email: dan.whitcomb@thomsonreuters.com; 1-213-380  2014))  Keywords: USA POLITICS/PALIN EFFIGY        ",
        "Histogram": [
            0.9,
            0,
            0.9,
            0,
            0,
            0,
            0,
            0.9,
            0.9,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 16.05763053894043,
        "BiasReport": {
            "sentences": [
                {
                    "text": "An effigy of U.S. Republican vice-presidential nominee Sarah Palin hanging by a noose as part of a Halloween display drew complaints on Monday, but local officials said the homeowner was covered by free speech rights.",
                    "bias_type": "Discriminatory Bias",
                    "bias_strength": 0.9,
                    "bias_description": "The sentence describes a highly controversial and offensive act of displaying an effigy of Sarah Palin hanging by a noose, which historically symbolizes lynching and violence against African Americans. This comparison implies a discriminatory bias by suggesting a hierarchy of offensiveness based on race and gender."
                },
                {
                    "text": "On the roof, a mannequin of Republican presidential candidate John McCain, protruded from the chimney surrounded in flames, holding his head as he was apparently burned alive.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.9,
                    "bias_description": "The vivid and dramatic description of John McCain's mannequin 'surrounded in flames, holding his head as he was apparently burned alive' is designed to evoke strong emotions and sensationalize the Halloween display, lacking neutrality and context."
                },
                {
                    "text": "'I know if we had done Barack Obama, people would have probably thrown things through our windows,' Morisette said. 'The image of a hanged black man is a lot more intense than the image of a hanged white woman for our country, the history of our country.'",
                    "bias_type": "Discriminatory Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This quote directly compares the potential reactions to an effigy of Barack Obama with the displayed effigy of Sarah Palin, suggesting a biased understanding of the historical and cultural significance of such imagery and the impact on different communities."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the treatment of public figures based on their race and gender, with a focus on the controversial Halloween display involving effigies of Sarah Palin and John McCain. The biases identified include Discriminatory Bias and Emotional Sensationalism Bias, with a general tendency to sensationalize and compare the treatment of individuals based on race and gender."
            }
        },
        "Scores": {
            "average_bias_strength": 0.9,
            "percentage_of_biased_sentences": 0.26666666666666666,
            "overall_rating": 0.5833333333333334
        },
        "combined_score": 0.0
    },
    {
        "Title": "REFILE-FACTBOX-Scenarios for McCain VP pick Sarah Palin",
        "URL": "REFILE-FACTBOX-Scenarios for McCain VP pick Sarah Palin.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": " (Adds dropped word in 2nd paragraph)      Sept 2 (Reuters) - Republican presidential candidate John  McCain's newly chosen running mate, Alaska Gov. Sarah Palin,  created an immediate stir with news that she is the subject of  a state ethics probe and her unmarried teenage daughter is  pregnant.      Palin will accept the nomination on Wednesday in a speech  to the Republican convention. Here are some potential scenarios  for her candidacy and its impact on the Nov. 4 presidential  election against Democratic presidential candidate Barack Obama  and his No. 2, Joe Biden.      - The choice of Palin, 44, a conservative abortion rights  opponent with a record of bucking the Republican establishment  in Alaska, has rallied the conservative base to McCain, who has  struggled to win over that crucial constituency.      Her speech will give the party a chance to answer questions  about her familiarity with domestic and foreign policy issues,  and possibly address the issue of her 17-year-old daughter's  pregnancy and the investigation into whether she abused her  power in having a public safety commissioner fired in Alaska.      'She'll be greeted rapturously because the delegates are  very conservative, as is she,' University of Virginia political  analyst Larry Sabato said of her convention appearance. 'She's  become their heroine. But what the delegates think and what the  country thinks are probably two different things.'      - The selection of the political unknown has raised  questions about McCain's judgment and the degree to which his  campaign investigated Palin's background. That is a distraction  that could hurt the campaign's efforts to generate momentum for  the election battle with Obama.      'My vetting process was completely thorough and I'm  grateful for the results,' McCain told reporters in  Philadelphia.      - Palin's slot on the ticket is secure, but new revelations  or scandals from Alaska could threaten her standing. It would  take a lot, however, to dump her two months before the  election.      'If he drops her, the election is over. There's zero chance  that he'll drop her,' Sabato said.   (Writing by John Whitesides, editing by Jackie Frank)   ((For more about the U.S. political campaign, visit Reuters  'Tales from the Trail: 2008' online at  http:/blogs.reuters.com/trail08/))   ((For a TAKE A LOOK on the campaign click on [US/VOTE]))  Keywords: USA POLITICS/PALIN SCENARIOS        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0.6,
            0,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 15.916583061218262,
        "BiasReport": {
            "sentences": [
                {
                    "text": "The choice of Palin, 44, a conservative abortion rights opponent with a record of bucking the Republican establishment in Alaska, has rallied the conservative base to McCain, who has struggled to win over that crucial constituency.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'bucking the Republican establishment' carries a negative connotation towards the Republican establishment, implying judgment about their policies or actions."
                },
                {
                    "text": "'She'll be greeted rapturously because the delegates are very conservative, as is she,' University of Virginia political analyst Larry Sabato said of her convention appearance. 'She's become their heroine. But what the delegates think and what the country thinks are probably two different things.'",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The statement implies a judgment about the conservative delegates' perspective, suggesting it may not align with the broader public's view, which is presented as a more objective stance."
                },
                {
                    "text": "'My vetting process was completely thorough and I'm grateful for the results,' McCain told reporters in Philadelphia.",
                    "bias_type": "Unsubstantiated Claims Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The claim of a 'completely thorough' vetting process is presented as a fact without providing evidence to support its thoroughness or to compare it to standard vetting procedures."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias through word choice, opinionated statements, and unsubstantiated claims, particularly regarding the portrayal of Palin and the vetting process, suggesting a tendency towards questioning the judgment and thoroughness of the Republican campaign."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.2777777777777778,
            "overall_rating": 0.4388888888888889
        },
        "combined_score": 0.0
    },
    {
        "Title": "WRAPUP 7-McCain's surprise No. 2: Alaska Gov. Sarah Palin",
        "URL": "WRAPUP 7-McCain's surprise No. 2: Alaska Gov. Sarah Palin.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    * Palin is surprise choice as running mate      * McCain grabs the political spotlight      * Obama welcomes Palin to race           By Jeff Mason      DAYTON, Ohio, Aug 29 (Reuters) - Republican John McCain  made a surprise choice of Alaska Gov. Sarah Palin as his  running mate on Friday, adding a political unknown to the  presidential ticket who could help him appeal to women voters.      Palin, 44, a self-described 'hockey mom,' is a conservative  first-term governor of Alaska with strong anti-abortion views,  a record of reform and fiscal conservatism and an outsider's  perspective on Washington.      'She's exactly who I need. She's exactly who this country  needs to help me fight the same old Washington politics of me  first and country second,' McCain told a roaring crowd of  15,000 supporters in Dayton, Ohio.      Palin was chosen over more experienced and better known  contenders as the Arizona senator grabbed the spotlight away  from Democratic rival Barack Obama one day after Obama accepted  his party's presidential nomination before 75,000 flag-waving  supporters at Denver's football stadium.      'Senator, I am honored to be chosen as your running mate. I  will be honored to serve next to the next president of the  United States,' Palin said, joined on stage by her husband and  family. She has five children ranging in age from 5 months to  18 years.      'As governor, I've stood up to the old politics as usual,'  she said. 'This is a moment when principle and political  independence matter.'      McCain and Palin will face Obama and his No. 2, Joe Biden,  in the Nov. 4 presidential election.      The pick followed days of speculation about McCain's  choice, with most of the better-known contenders like former  Massachusetts Gov. Mitt Romney and Minnesota Gov. Tim Pawlenty  eliminated over the last 24 hours.      Palin, former mayor of the town of Wasilla, is virtually  unknown nationally. That could hurt McCain's argument that  Obama, a first-term senator from Illinois, is too inexperienced  to handle the White House.      But she could help him appeal to disaffected supporters of  Democrat Hillary Clinton, who lost a bruising primary to Obama.  Palin noted the achievements of Clinton and Democrat Geraldine  Ferraro, who in 1984 became the first woman vice presidential  nominee of a major party.      'Hillary left 18 million cracks in the highest, hardest  glass ceiling in America,' she said, referring to the 18  million votes Clinton received in the primaries. 'But it turns  out the women of America aren't finished yet, and we can  shatter that glass ceiling once and for all.'           RISKY CHOICE?      The choice of Palin was a risk for McCain given her lack of  national experience, but her record in Alaska will help him  reinforce his reform message. Palin built a reputation as a  reformer in a state that recently has been hit with corruption  scandals.      Elected in 2006, she is Alaska's first woman governor. She  is also an avid sportswoman who would bring youth and vitality  to the ticket. McCain turns 72 on Friday and would be the  oldest person to take office for a first term in the White  House if elected.      'Today, John McCain put the former mayor of a town of 9,000  with zero foreign policy experience a heartbeat away from the  presidency,' said Obama campaign spokesman Bill Burton, who  said she would work to overturn abortion rights and continue  Republican economic policies.       In a joint stateme",
        "Histogram": [
            0,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 15.889701843261719,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Palin is surprise choice as running mate",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'surprise' implies a judgment that the choice of Palin was unexpected or perhaps not the best, influencing the reader's perception."
                },
                {
                    "text": "McCain grabs the political spotlight",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'grabs the political spotlight' suggests a positive, proactive action by McCain, implying a favorable judgment and potentially skewing the reader's perception."
                },
                {
                    "text": "The pick followed days of speculation about McCain's choice, with most of the better-known contenders like former Massachusetts Gov. Mitt Romney and Minnesota Gov. Tim Pawlenty eliminated over the last 24 hours.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'better-known contenders' implies a value judgment, suggesting that Romney and Pawlenty were more qualified or suitable, which could influence the reader's perception of the selection process."
                },
                {
                    "text": "Palin, former mayor of the town of Wasilla, is virtually unknown nationally. That could hurt McCain's argument that Obama, a first-term senator from Illinois, is too inexperienced to handle the White House.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The sentence implies a negative judgment about Palin's national recognition and its potential impact on McCain's argument, suggesting a bias by questioning her suitability based on her previous position."
                },
                {
                    "text": "The choice of Palin was a risk for McCain given her lack of national experience, but her record in Alaska will help him reinforce his reform message.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence presents an opinion on the riskiness of McCain's choice, suggesting it was a risk due to Palin's 'lack of national experience,' which is a subjective assessment rather than an objective fact."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias through the use of word choice and opinionated statements, particularly regarding the surprise nature of Palin's selection, the positive framing of McCain's actions, and the subjective assessment of Palin's suitability based on her experience. The general bias tendency leans towards questioning the suitability of Palin as a vice-presidential candidate."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.125,
            "overall_rating": 0.3625
        },
        "combined_score": 0.0
    },
    {
        "Title": "WRAPUP 8-McCain's surprise No. 2: Alaska Gov. Sarah Palin",
        "URL": "WRAPUP 8-McCain's surprise No. 2: Alaska Gov. Sarah Palin.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    * Palin is surprise choice as running mate      * McCain grabs the political spotlight      * Obama welcomes Palin to race           By Jeff Mason      DAYTON, Ohio, Aug 29 (Reuters) - Republican John McCain  made a surprise choice of Alaska Gov. Sarah Palin as his  running mate on Friday, adding a political unknown to the  presidential ticket who could help him appeal to women voters.      Palin, 44, a self-described 'hockey mom,' is a conservative  first-term governor of Alaska with strong anti-abortion views,  a record of reform and fiscal conservatism and an outsider's  perspective on Washington.      'She's exactly who I need. She's exactly who this country  needs to help me fight the same old Washington politics of me  first and country second,' McCain told a roaring crowd of  15,000 supporters in Dayton, Ohio.      Palin was chosen over more experienced and better known  contenders as the Arizona senator grabbed the spotlight away  from Democratic rival Barack Obama one day after Obama accepted  his party's presidential nomination before 75,000 flag-waving  supporters at Denver's football stadium.      'The mission is clear. The next 67 days, I'm going to take  our campaign to every part of our country and our message of  reform to every voter of every background in every political  party or no party at all,' said Palin, joined on stage by her  husband and family. She has five children ranging in age from 5  months to 18 years.      'As governor, I've stood up to the old politics as usual,'  she said. 'This is a moment when principle and political  independence matter a lot more than just party lines.'      McCain and Palin will face Obama and his No. 2, Joe Biden,  in the Nov. 4 presidential election, with polls showing them  running neck-and-neck.      The pick followed days of speculation about McCain's  choice, with most of the better-known contenders like former  Massachusetts Gov. Mitt Romney and Minnesota Gov. Tim Pawlenty  eliminated over the last 24 hours.           '18 MILLION CRACKS'      Palin, the former mayor of the town of Wasilla, is  virtually unknown and untested nationally. That could hurt  McCain's argument that Obama, 47, a first-term senator from  Illinois, is too inexperienced to handle the White House.      But she could help him appeal to disaffected supporters of  Democrat Hillary Clinton, who lost a bruising primary to Obama.  Palin noted the achievements of Clinton and Democrat Geraldine  Ferraro, who in 1984 became the first woman vice presidential  nominee of a major party.      'Hillary left 18 million cracks in the highest, hardest  glass ceiling in America,' she said, referring to the 18  million votes Clinton received in the primaries. 'But it turns  out the women of America aren't finished yet, and we can  shatter that glass ceiling once and for all.'      Palin would be the first woman U.S. vice president, adding  another historic element to a presidential race that has been  filled with firsts. Obama, 47, is the first black nominee of a  major U.S. political party.      Her record in Alaska will help McCain reinforce his reform  message. Palin built a reputation as a reformer in a state that  recently has been hit with corruption scandals.      Elected in 2006, she is Alaska's first woman governor. She  is also an avid sportswoman who would bring youth and vitality  to the ticket. McCain turns 72 on Friday and would be the  oldest person to take office for a first term in the White  House ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 15.889701843261719,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to exhibit bias regarding the topic of John McCain's selection of Sarah Palin as his running mate. The reporting is factual and does not display any of the typical signs of bias such as emotional sensationalism, ad hominem attacks, or speculative assertions."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    }
]