[
    {
        "Title": "FACTBOX-U.S. capital's strict gun-control law",
        "URL": "FACTBOX-U.S. capital's strict gun-control law.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    June 26 (Reuters) - The U.S. Supreme Court ruled on Thursday,  for the first time in the country's history, that individual  Americans have the right to own guns for personal use, and struck  down a strict gun control law in the U.S. capital, Washington.           Following are some facts about the case.           * It marks the first time in nearly 70 years that the Supreme  Court has taken up the meaning of the Second Amendment, the  portion of the U.S. Constitution that addresses an individual's  right to bear arms.      * The Supreme Court's previous review of the Second  Amendment came in a five-page discussion in an opinion issued  in 1939 that failed to definitively resolve the constitutional  issue.      * At issue was the city's strict gun-control law -- a ban on  private possession of handguns and requirement that any rifles or  shotguns kept at home be unloaded and disassembled or bound by a  trigger lock.      * The court's ruling could have a far-reaching impact on  gun-control laws in the United States, which is estimated to have  the world's highest civilian gun ownership rate. The ruling could  become an issue in the November presidential election.      * During oral arguments in March, Justice Stephen Breyer  cited statistics that between 80,000 and 100,000 people in the  United States every year are killed or wounded in gun-related  homicides or crimes, accidents or suicides. He said that in  Washington, D.C., the number totals around 200 to 300 dead and  between 1,500 to 2,000 people wounded.      * The arguments followed a string of mass shootings in the  previous year -- multiple killings on at least three college  campuses, two shopping centers and one Missouri town meeting.      * The case divided the Bush administration. Then-Solicitor  General Paul Clement, the administration's lawyer before the  Supreme Court, said individuals have a right to own a gun, but  it is subject to reasonable government regulation. Vice  President Dick Cheney joined a group of U.S. House of  Representatives and Senate members in urging a stronger stand  in favor of gun rights.     (Writing by James Vicini and Paul Grant, editing by Patricia  Zengerle)   ((jim.vicini@thomsonreuters.com; +202 898 8300 Reuters  Messaging: jim.vicini.reuters.com@reuters.net))  Keywords: USA GUNS/COURT        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 20.551633834838867,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased. It provides factual information about the U.S. Supreme Court's ruling on gun control laws and includes statements from both sides of the argument without showing a general bias tendency."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "The Second Amendment Protects Individual Rights.txt",
        "URL": "The Second Amendment Protects Individual Rights.txt.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Fox_News_Channel_logo.svg/240px-Fox_News_Channel_logo.svg.png",
        "Text": "The Justice Department has interpreted the Second Amendment as granting an individual right to bear arms. It’s about time.\n\nFor years, Justice Department policy has been to interpret the Second Amendment as granting a collective right to bear arms, an interpretation supposedly in line with the United States Supreme Court’s decision in United States v. Miller.\n\nHowever, Attorney General John Ashcroft and Solicitor General Theodore Olsen recently reversed policy and found that the Second Amendment promotes an individual right to bear arms. This decision is a proper return to originalist constitutional principles with beneficial public policy effects.\n\nThe decision received a great deal of criticism from observers who argued that the Justice Department was not justified in reversing policy that stemmed from the Supreme Court’s Miller decision, which is viewed by many to reject an individual right to bear arms, favoring only a collective right.\n\nHowever, this view is likely mistaken. In Miller, the Supreme Court merely states that \"[I]n the absence of any evidence tending to show that possession or use of a 'shotgun having a barrel of less than eighteen inches in length' at this time has some reasonable relationship to the preservation or efficiency of a well regulated militia, we cannot say that the Second Amendment guarantees the right to keep and bear such an instrument.\"\n\nThe Court’s discussion clearly centered on whether a particular shotgun with specific dimensions (a sawed-off shotgun) had a relationship to the preservation of a well-regulated militia, with the answer being no. This is an exceedingly narrow ruling, and did not constitute a declaration by the Court that the Second Amendment did not convey upon the citizenry an individual right to bear arms.\n\nCritics of the Justice Department's new policy are misrepresenting Miller. Miller merely addressed whether the Second Amendment guaranteed the possession of a specific shotgun. It did not address whether the Second Amendment grants an individual or a collective right to bear arms.\n\nA search for more conclusive language regarding the Second Amendment’s extension of an individual right to bear arms requires only a look at the Fifth Circuit Court of Appeals’ recent decision in United States v. Emerson. Agreeing that Miller did not resolve the issue of whether the Second Amendment grants an individual or a collective right, the Emerson court took up the matter itself. It found that the Second Amendment \"protects the rights of individuals, including those not then actually a member of any militia or engaged in active military service or training, to privately possess and bear their own firearms.\"\n\nWhile the Emerson court hastened to add that the right is not absolute, the fact is that no right guaranteed anywhere in the Constitution is absolute.\n\nMoreover, as Professor Glenn Reynolds points out, the individual rights theory of the Second Amendment does nothing to strike down reasonable gun control laws — such as preventing people with violent histories from owning guns, or forbidding reasonable waiting periods.\n\nReynolds also argues that a firm recognition of an individual rights interpretation of the Second Amendment will enable the public to have less heated, and more dispassionate, debates about gun control. Second Amendment advocates will no longer have to fear that gun control is a Trojan horse designed to eventually erode the fundamental right to bear arms.\n\nOther critics of the Justice Department’s reversal argue that the specific language of the Second Amendment militates against an individual right to bear arms. The Second Amendment reads as follows: \"A well regulated Militia, being necessary to the security of a free State, the right of the people to keep and bear Arms, shall not be infringed.\"\n\nOpponents of individual rights focus on the prefatory language, \"a well regulated Militia being necessary to the security of a free State,\" and argue that the Second Amendment was only meant to arm militias. The Framers, this argument goes, limited the scope of the Second Amendment by use of the prefatory language, which they did not do elsewhere in the Bill of Rights.\n\nHowever, Second Amendment scholar Professor Eugene Volokh has pointed out that this argument has little merit. Prefatory language is much more common in the construction of constitutional text than individual rights critics like to claim.\n\nFor example, the state constitutions for both Rhode Island and New Hampshire use prefatory language in reference to free press and criminal trials, respectively. Rhode Island’s constitution reads, \"[t]he liberty of the press being essential to the security of freedom in a state, any person may publish his sentiments on any subject, being responsible for an abuse of that liberty.\"\n\nWould the same Second Amendment critics want their prefatory language argument used to restrict speech or impair the right to a fair trial?\n\nIn addition to the legal arguments, the policy reasons behind the Justice Department’s new decision are compelling. Yale statistician John Lott persuasively shows in his book More Guns, Less Crime that \"right-to-carry\" laws lead to a dramatic reduction in crimes against the person, due to the deterrent effect of those laws.\n\nThe logic is simple: A criminal will be less likely to attack a person if the potential victim may be armed. Recognizing that the Second Amendment grants an individual right to bear arms directly supports the implementation and the legality of right-to-carry legislation. Thus, the Justice Department’s position is not only consistent with the original intent of the Second Amendment, it makes eminent policy sense in the effort to keep people safe from the threat of violent crime.\n\nDespite the controversy, the Justice Department’s decision to recognize an individual right to bear arms under the Second Amendment was appropriate and justified. The Justice Department properly interpreted legal precedent and the traditions of constitutional construction.\n\nMoreover, the department’s decision will have a tangible policy benefit in deterring violent crime against individuals. The collective rights interpretation of the Second Amendment should have been changed long ago. Now that the change is finally being made, it should be welcomed, not condemned.\n\nPejman Yousefzadeh is an attorney living in southern California. He edits the weblog PejmanPundit.\n\nRespond to the Writer",
        "Histogram": [
            0,
            0.9,
            0,
            0,
            0.9,
            0,
            0.6,
            0,
            0,
            0,
            0.6,
            0,
            0,
            0.6,
            0,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0.6,
            0,
            0,
            0,
            0,
            0.9,
            0.9,
            0,
            0.9,
            0.9,
            0,
            0,
            0
        ],
        "Relevance": 19.703369140625,
        "BiasReport": {
            "sentences": [
                {
                    "text": "It’s about time.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This sentence reflects a strong subjective opinion without providing any evidence, implying that the change in interpretation of the Second Amendment was long overdue without a balanced perspective."
                },
                {
                    "text": "This decision is a proper return to originalist constitutional principles with beneficial public policy effects.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "The sentence presents the decision as an unquestionably positive return to 'originalist constitutional principles' and 'beneficial public policy effects', without acknowledging any potential drawbacks or alternative perspectives."
                },
                {
                    "text": "However, this view is likely mistaken.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'likely mistaken' introduces doubt in a way that suggests the writer's opinion as fact, undermining the possibility of legitimate differing interpretations."
                },
                {
                    "text": "Critics of the Justice Department's new policy are misrepresenting Miller.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence assumes the critics' intentions and accuses them of misrepresentation without providing a balanced examination of the differing interpretations of the Miller decision."
                },
                {
                    "text": "A search for more conclusive language regarding the Second Amendment’s extension of an individual right to bear arms requires only a look at the Fifth Circuit Court of Appeals’ recent decision in United States v. Emerson.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The assertion that the Fifth Circuit Court of Appeals' decision is the definitive source for 'conclusive language' on the matter ignores the ongoing debate and differing interpretations within legal scholarship."
                },
                {
                    "text": "Moreover, as Professor Glenn Reynolds points out, the individual rights theory of the Second Amendment does nothing to strike down reasonable gun control laws — such as preventing people with violent histories from owning guns, or forbidding reasonable waiting periods.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "While presenting a counterargument, this sentence assumes the correctness of the 'individual rights theory' and implies that it is the only valid perspective on the Second Amendment, dismissing alternative viewpoints."
                },
                {
                    "text": "Reynolds also argues that a firm recognition of an individual rights interpretation of the Second Amendment will enable the public to have less heated, and more dispassionate, debates about gun control. Second Amendment advocates will no longer have to fear that gun control is a Trojan horse designed to eventually erode the fundamental right to bear arms.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence presents the 'individual rights interpretation' as the solution to contentious debates, implying that it is the only way to address concerns about gun control, and suggesting that alternative interpretations are inherently disingenuous."
                },
                {
                    "text": "Other critics of the Justice Department’s reversal argue that the specific language of the Second Amendment militates against an individual right to bear arms.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'militates against' suggests a strong bias by implying that the language of the Second Amendment inherently contradicts an individual rights interpretation, without acknowledging the complexity of the legal and historical debate."
                },
                {
                    "text": "However, Second Amendment scholar Professor Eugene Volokh has pointed out that this argument has little merit.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence dismisses a counterargument by appealing to the authority of a single scholar, implying that his perspective is definitive and unchallenged within the field of Second Amendment scholarship."
                },
                {
                    "text": "In addition to the legal arguments, the policy reasons behind the Justice Department’s new decision are compelling.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'compelling' to describe the policy reasons assumes a subjective judgment as an objective fact, suggesting that there is no room for legitimate disagreement on the matter."
                },
                {
                    "text": "Despite the controversy, the Justice Department’s decision to recognize an individual right to bear arms under the Second Amendment was appropriate and justified.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This sentence strongly asserts the correctness of the decision, using the terms 'appropriate and justified' without acknowledging the ongoing debate and differing legal interpretations."
                },
                {
                    "text": "The Justice Department properly interpreted legal precedent and the traditions of constitutional construction.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This statement unequivocally supports the Justice Department's interpretation, suggesting that there is a singular correct way to interpret legal precedent and constitutional traditions, which is a highly contentious and debated issue."
                },
                {
                    "text": "The collective rights interpretation of the Second Amendment should have been changed long ago. Now that the change is finally being made, it should be welcomed, not condemned.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This sentence not only advocates for the individual rights interpretation but also implies that any opposition to this view is unwarranted ('not condemned'), effectively shutting down the possibility of a balanced discussion."
                }
            ],
            "overall_bias": {
                "conclusion": "The article is biased regarding the interpretation of the Second Amendment, specifically in favor of the individual rights theory. It employs opinionated language and dismisses opposing viewpoints without a balanced examination, indicating a general bias tendency towards promoting a specific interpretation as the only valid one."
            }
        },
        "Scores": {
            "average_bias_strength": 0.7153846153846153,
            "percentage_of_biased_sentences": 0.07142857142857142,
            "overall_rating": 0.39340659340659334
        },
        "combined_score": 0.0
    },
    {
        "Title": "FACTBOX-U.S. presidential candidates and gun control",
        "URL": "FACTBOX-U.S. presidential candidates and gun control.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": " (This is part of a package of stories on guns in America ahead  of Supreme Court arguments on March 18)      March 12 (Reuters) - Following are the positions of the  leading U.S. presidential candidates on gun control.           DEMOCRATS      SEN. HILLARY CLINTON      She has said law-abiding citizens should be able to own  guns but laws are needed to keep guns out of the hands of  criminals. She cosponsored legislation to reinstate for 10  years a ban on assault weapons.      The National Rifle Association gives her a failing grade of  F for her position on guns.           SEN. BARACK OBAMA      Wants tighter background checks on gun buyers, making gun  locks mandatory, and holding parents criminally responsible for  children who injure someone with a gun found at home. Supports  reinstating assault-weapons ban.      The National Rifle Association gives him a failing grade of  F for his position on guns.           REPUBLICAN      SEN. JOHN McCAIN      Opposes gun control, calling it 'a proven failure in  fighting crime.' Opposes waiting periods to buy firearms. Has  supported legislation requiring gun makers to include trigger  locks with their products. Opposes reinstating assault-weapons  ban. Has supported mandating background checks on gun buyers at  gun shows.      The National Rifle Association gives him an average grade  of C for his position on guns but says he has a perfect voting  record since 2007 and his grade may be revised.           Sources: Reuters, campaign Web sites, Detroit Free Press,  the National Rifle Association   (Compiled by Paul Grant, Washington Editorial Reference Unit)   ((paul.grant@reuters.com; +202 789 8015 Reuters Messaging:  paul.grant.reuters.com@reuters.net))  Keywords: USA GUNS/CANDIDATES        ",
        "Histogram": [
            0,
            0,
            0,
            0.8,
            0,
            0,
            0.8,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 18.144947052001953,
        "BiasReport": {
            "sentences": [
                {
                    "text": "The National Rifle Association gives her a failing grade of F for her position on guns.",
                    "bias_type": "Source Selection Bias",
                    "bias_strength": 0.8,
                    "bias_description": "This sentence exhibits source selection bias by emphasizing the opinion of the National Rifle Association, a group with a specific stance on gun rights, which may not represent a neutral or comprehensive view."
                },
                {
                    "text": "The National Rifle Association gives him a failing grade of F for his position on guns.",
                    "bias_type": "Source Selection Bias",
                    "bias_strength": 0.8,
                    "bias_description": "Similar to the previous sentence, this one also demonstrates source selection bias by highlighting the judgment of the National Rifle Association, potentially skewing the portrayal of the candidates' positions on gun control."
                }
            ],
            "overall_bias": {
                "conclusion": "The article is biased regarding the evaluation of the candidates' positions on gun control, showing a source selection bias by prominently featuring the ratings given by the National Rifle Association, which may not offer a balanced or impartial perspective on the issue."
            }
        },
        "Scores": {
            "average_bias_strength": 0.8,
            "percentage_of_biased_sentences": 0.07142857142857142,
            "overall_rating": 0.4357142857142857
        },
        "combined_score": 0.0
    },
    {
        "Title": "Gun group sues San Francisco, Chicago over gun bans",
        "URL": "Gun group sues San Francisco, Chicago over gun bans.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    SAN FRANCISCO, June 27 (Reuters) - A day after the U.S.  Supreme Court struck down a ban on handguns in Washington,  D.C., the National Rifle Association gun rights group filed  lawsuits on Friday in San Francisco and Chicago against gun  bans there.      'The Supreme Court held yesterday that the Second Amendment  right is exercised individually and belongs to all Americans,'  Chris Cox, the NRA's chief lobbyist, said in a statement.  'These lawsuits will ensure that state and local governments  hear those words.'      The San Francisco lawsuit challenges a local ordinance and  lease provisions barring possession of handguns by public  housing residents.      The Chicago case challenges a handgun ban similar to the  Washington, D.C., law struck down by the Supreme Court. The NRA  also filed lawsuits challenging gun restrictions in the Chicago  suburbs of Evanston, Morton Grove and Oak Park.      'In Washington, D.C., or in any state, whether you live in  the housing projects or a high end suburb, you have the right  to defend yourself and your family at home,' Cox said. 'These  laws all deny that right.'      In its 5-4 decision, the court held that individual  Americans have a right to own guns, a finding that struck down  a strict gun control law in the nation's capital.      The landmark ruling marked the first time in nearly 70  years the high court addressed the Second Amendment of the U.S.  Constitution, and rejected the argument that the amendment's  right to keep and bear arms is tied to service in a state  militia.      San Francisco Mayor Gavin Newsom said he had expected the  decision to open the door for a challenge to his city's gun  laws.      'I intend to fight any NRA lawsuit that challenges our  common-sense gun laws every step of the way,' he said in a  statement.      San Francisco City Attorney Dennis Herrera echoed Newsom.      'On the basis of the law as it exists today, I am confident  that our local gun control measures are on sound legal footing  and will survive legal challenges,' Herrera said in a  statement.       (Reporting by Jim Christie; Editing by Mary Milliken and  Eric Beech)      ((jim.christie@thomsonreuters.com; +1-415-677-2539; Reuters  Messaging: jim.christie.reuters.com@reuters.net))  Keywords: USA GUNS/LAWSUITS       ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0
        ],
        "Relevance": 17.719722747802734,
        "BiasReport": {
            "sentences": [
                {
                    "text": "'In Washington, D.C., or in any state, whether you live in the housing projects or a high end suburb, you have the right to defend yourself and your family at home,' Cox said. 'These laws all deny that right.'",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'high end suburb' alongside 'housing projects' carries a connotation of socioeconomic disparity, implying a judgment about the areas and the people who live in them."
                },
                {
                    "text": "San Francisco Mayor Gavin Newsom said he had expected the decision to open the door for a challenge to his city's gun laws. 'I intend to fight any NRA lawsuit that challenges our common-sense gun laws every step of the way,' he said in a statement.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'common-sense gun laws' implies a positive judgment about the laws, suggesting that they are reasonable and universally accepted, which can influence the reader's perception without presenting an objective analysis."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the discussion of gun laws, particularly in San Francisco and Chicago, with a general tendency towards influencing the reader's perception through the use of word choice that implies judgment and preconceived notions about the topics discussed."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.26666666666666666,
            "overall_rating": 0.43333333333333335
        },
        "combined_score": 0.0
    },
    {
        "Title": "US high court considers landmark gun-rights case",
        "URL": "US high court considers landmark gun-rights case.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By James Vicini      WASHINGTON, March 18 (Reuters) - The U.S. Supreme Court  considers on Tuesday a landmark legal battle over gun rights,  taking up for the first time in nearly 70 years whether  Americans have the right to keep and bear arms.      The court's ruling, expected by the end of June, could have  a far-reaching impact on gun control laws in the United States,  estimated to have the world's highest civilian gun ownership  rate, and could become an issue in the November election.      At issue is whether to strike down or uphold one of the  nation's strictest gun control laws -- a Washington, D.C., ban  on private possession of handguns and a requirement that any  rifles or shotguns kept at home be unloaded and dissembled or  bound by a trigger lock.      The case is widely viewed as one of the most important of  the Supreme Court's current term, along with cases on the  rights of the Guantanamo Bay prisoners and the U.S. lethal  injection method of execution.      The case could resolve the much-disputed meaning of the  Second Amendment of the U.S. Constitution and whether it  protects an individual's right to possess guns or a collective  right of the people for service in a state militia.      The Supreme Court's last review of the Second Amendment  came in a five-page discussion in an opinion issued in 1939  that failed to definitively resolve the constitutional issue.      The arguments follow a series of mass shootings in the past  year -- multiple killings on at least three college campuses,  two shopping centers and one Missouri town meeting. Gun deaths  average 80 a day in the United States, 34 of them homicides,  according to Centers for Disease Control data.      The case has split the Bush administration.      Solicitor General Paul Clement, the administration's chief  advocate before the Supreme Court, has adopted the position  that individuals have a right to own a gun, but it is subject  to reasonable government regulation.      Clement, who is arguing before the justices, seeks to  preserve all of the current federal restrictions, including a  ban on new machine gun sales, a ban on felons owning guns and  required background checks for new buyers of handguns.      But Vice President Dick Cheney joined a group of U.S. House  of Representatives and Senate members in urging the court to  adopt a stronger stand in favor of gun rights.      Walter Dellinger, the attorney defending the Washington  law, argued the Second Amendment protected only militia-related  firearms rights.      But even if an individual has the right to possess guns,  the law should be upheld as a reasonable restriction, he said.      The third attorney scheduled to appear at the arguments,   Alan Gura, said the law should be struck down. He represents  Dick Anthony Heller, who lives in a high-crime neighborhood and  wants to keep a handgun for self-defense.   (Editing by Stuart Grudgings)   ((jim.vicini@reuters.com; 202-898-8397; Reuters Messaging:  jim.vicini.reuters.com@reuters.net))  Keywords: USA GUNS/COURT       ",
        "Histogram": [
            0,
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 16.62738609313965,
        "BiasReport": {
            "sentences": [
                {
                    "text": "The case is widely viewed as one of the most important of the Supreme Court's current term, along with cases on the rights of the Guantanamo Bay prisoners and the U.S. lethal injection method of execution.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the word 'widely' to describe the view of the case's importance implies a judgment that may not be universally agreed upon, suggesting a positive connotation towards the significance of the case."
                },
                {
                    "text": "The case could resolve the much-disputed meaning of the Second Amendment of the U.S. Constitution and whether it protects an individual's right to possess guns or a collective right of the people for service in a state militia.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Describing the meaning of the Second Amendment as 'much-disputed' implies a lack of clarity or consensus, which could influence the reader's perception of the issue's complexity and the need for resolution."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias through the use of word choice, particularly in describing the case's importance and the disputed nature of the Second Amendment, which may influence the reader's perception of the issues at hand."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.058823529411764705,
            "overall_rating": 0.32941176470588235
        },
        "combined_score": 0.0
    },
    {
        "Title": "UPDATE 1-FACTBOX-Reaction to U.S. Supreme Court gun ruling",
        "URL": "UPDATE 1-FACTBOX-Reaction to U.S. Supreme Court gun ruling.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": " (Adds Obama, D.C. mayor)      June 26 (Reuters) - The U.S. Supreme Court ruled on  Thursday, for the first time in the country's history, that  individual Americans have the right to own guns for personal  use, and struck down a strict gun control law in Washington.      Following is some reaction to the ruling:           WHITE HOUSE SPOKESMAN TONY FRATTO      'We're pleased that the Supreme Court affirmed that the  Second Amendment protects the right of Americans to keep and  bear arms.'           REPUBLICAN PRESIDENTIAL CANDIDATE JOHN MCCAIN      'I applaud this decision as well as the overturning of the  District of Columbia's ban on handguns and limitations on the  ability to use firearms for self-defense.      'Unlike Senator Obama, who refused to join me in signing a  bipartisan amicus brief, I was pleased to express my support  and call for the ruling issued today.'      'Unlike the elitist view that believes Americans cling to  guns out of bitterness, today's ruling recognizes that gun  ownership is a fundamental right -- sacred, just as the right  to free speech and assembly.      'This ruling does not mark the end of our struggle against  those who seek to limit the rights of law-abiding citizens. We  must always remain vigilant in defense of our freedoms.'        DEMOCRATIC PRESIDENTIAL CANDIDATE BARACK OBAMA      'I have always believed that the Second Amendment protects  the right of individuals to bear arms, but I also identify with  the need for crime-ravaged communities to save their children  from the violence that plagues our streets through common  sense, effective safety measures.      'The Supreme Court has now endorsed that view, and while it  ruled that the D.C. gun ban went too far, Justice Scalia  himself acknowledged that this right is not absolute and  subject to reasonable regulations enacted by local communities  to keep their streets safe.      'Today's ruling, the first clear statement on this issue in  127 years, will provide much-needed guidance to local  jurisdictions across the country.      'As president, I will uphold the constitutional rights of  law-abiding gun-owners, hunters, and sportsmen.'      'Today's decision reinforces that if we act  responsibly, we can both protect the constitutional right to  bear arms and keep our communities and our children safe.'        PAUL HELMKE, PRESIDENT OF THE BRADY CAMPAIGN TO PREVENT GUN  VIOLENCE      'The ... decision ... will most likely embolden criminal  defendants, and ideological extremists, to file new legal  attacks on existing gun laws. With the help of the Brady  Center's legal team, those attacks can, and must, be  successfully resisted in the interest of public safety.      'After the ... ruling, as before, approximately 80  Americans will continue to die from guns every day. Our weak or  nonexistent gun laws contribute to the thousands of senseless  gun deaths and injuries in this country that occur each year.  We must continue to fight for sensible gun laws to help protect  our families and our communities.'           NATIONAL RIFLE ASSOCIATION VICE PRESIDENT WAYNE LAPIERRE      'This is a great moment in American history. It vindicates  individual Americans all over this country who have always  known that this is their freedom worth protecting.      'Our founding fathers wrote and intended the Second  Amendment to be an individual right. The Supreme Court has now  acknowledged it. The Second Amendment as an individual right  now becomes a re",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 15.588178634643555,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it presents a range of reactions to the U.S. Supreme Court gun ruling without exhibiting any evident bias in the reporting."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "FACTBOX-Reaction to U.S. Supreme Court gun ruling",
        "URL": "FACTBOX-Reaction to U.S. Supreme Court gun ruling.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    June 26 (Reuters) - The U.S. Supreme Court ruled on  Thursday, for the first time in the country's history, that  individual Americans have the right to own guns for personal  use, and struck down a strict gun control law in Washington.      Following is some reaction to the ruling:           WHITE HOUSE SPOKESMAN TONY FRATTO      'We're pleased that the Supreme Court affirmed that the  Second Amendment protects the right of Americans to keep and  bear arms.'           REPUBLICAN PRESIDENTIAL CANDIDATE JOHN MCCAIN      'I applaud this decision as well as the overturning of the  District of Columbia's ban on handguns and limitations on the  ability to use firearms for self-defense.      'Unlike Senator Obama, who refused to join me in signing a  bipartisan amicus brief, I was pleased to express my support  and call for the ruling issued today.'      'Unlike the elitist view that believes Americans cling to  guns out of bitterness, today's ruling recognizes that gun  ownership is a fundamental right -- sacred, just as the right  to free speech and assembly.      'This ruling does not mark the end of our struggle against  those who seek to limit the rights of law-abiding citizens. We  must always remain vigilant in defense of our freedoms.'        PAUL HELMKE, PRESIDENT OF THE BRADY CAMPAIGN TO PREVENT GUN  VIOLENCE      'The ... decision ... will most likely embolden criminal  defendants, and ideological extremists, to file new legal  attacks on existing gun laws. With the help of the Brady  Center's legal team, those attacks can, and must, be  successfully resisted in the interest of public safety.      'After the ... ruling, as before, approximately 80  Americans will continue to die from guns every day. Our weak or  nonexistent gun laws contribute to the thousands of senseless  gun deaths and injuries in this country that occur each year.  We must continue to fight for sensible gun laws to help protect  our families and our communities.'           NATIONAL RIFLE ASSOCIATION VICE PRESIDENT WAYNE LAPIERRE      'This is a great moment in American history. It vindicates  individual Americans all over this country who have always  known that this is their freedom worth protecting.      'Our founding fathers wrote and intended the Second  Amendment to be an individual right. The Supreme Court has now  acknowledged it. The Second Amendment as an individual right  now becomes a real permanent part of American Constitutional  law.'           NEW YORK CITY MAYOR MICHAEL BLOOMBERG      'Eighty people a day die at the hands of guns, we have got  to stop that.'      'The court clearly ruled that reasonable regulations are  permitted under that decision.'        MILES HALL, OWNER OF H&H GUN RANGE IN OKLAHOMA CITY:      'I honestly think that the outright bans are going to  disappear. I think they will all be challenged. Once the  Supreme Court has ruled there is an individual right to own a  gun, I think all those are going to disappear.'      'What we want is for law-abiding citizens to be able to  protect themselves. Period.'      (Reporting by Deborah Charles and Jeremy Pelofsky in  Washington, Ben Fenwick in Oklahoma City; Editing by David  Wiessler)   ((deborah.charles@reuters.com;+1 202 789 8579; Reuters  Messaging: deborah.charles.reuters.com@reuters.net))  Keywords: USA GUNS/COURT REACTION        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 15.562935829162598,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to be biased as it presents a range of reactions to the U.S. Supreme Court gun ruling without using language that indicates a particular bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "Do Gun Owners Fear an Obama Presidency_.txt",
        "URL": "Do Gun Owners Fear an Obama Presidency_.txt.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Fox_News_Channel_logo.svg/240px-Fox_News_Channel_logo.svg.png",
        "Text": "This is a rush transcript from \"America's Election HQ,\" October 30, 2008. This copy may not be in its final form and may be updated.\n\nBILL HEMMER, HOST: What does the election mean for gun owners in America? One group is not pulling for Barack Obama. The NRA, National Rifle Association, spent millions on ads against him. Some people are reportedly buying up guns in the event of an Obama presidency coming out of Tuesday's vote.\n\nChris Cox, chief lobbyist for the NRA. Chris, good evening to you.\n\nCHRIS COX, CHIEF LOBBYIST, NATIONAL RIFLE ASSOCIATION: Thanks for having me, Bill.\n\nHEMMER: What are these owners so worried about, you think?\n\n• Video: Watch Bill Hemmer's interview\n\nCOX: Well, they're worried about Barack Obama winning and they're worried if he wins, he will take their guns away. And the truth is, they have a reason to worry.\n\nHEMMER: Why?\n\nCOX: This guy — he supported the most radical gun control agenda that's ever been imagined. He voted to ban single shot and double-barrel shotguns. He's voted to ban almost all hunting ammunition. He supported a 500 percent tax increase on guns and ammunition. So this guy is bad news when it comes to the Second Amendment and if people are buying guns, it doesn't really surprise me.\n\nHEMMER: You're laying it on. He is saying that this piece of paper when he was in the Illinois legislature wasn't his handwriting. You are not buying that, are you?\n\nCOX: No, because the second questionnaire had his handwriting on it. You don't even have to go back that far. This year he said he supported Washington D.C.'s handgun ban and Washington's D.C.'s ban on self-defense in the home. And that's something that has gun owners really worried. This is a —\n\nHEMMER: I was on his Web site today and I was looking around for this issue. It's a bit hard to find. It's under additional issues under the category of sportsmen.\n\nBut this is what the campaign is telling us, \"Barack Obama,\" they say, \"believes the Second Amendment creates an individual right and he respects the constitutional right of Americans to bear arms. He will protect the rights of hunters and other law-abiding Americans who purchase, transport and use guns.\" That's a statement. Chris?\n\nCOX: Well, Bill, four years ago, we saw John Kerry do signing and nobody really believed he was somehow a supporter of hunting heritage. And Barack Obama's rhetoric is very different from his record. And what we're going to do is expose the guy who opposes self-defense with a firearm, opposes hunting, opposes legitimate firearms for personal protection.\n\nAnd it's important that Americans know that he is spending millions of dollars because he has zero credibility when it comes to the Second Amendment.\n\nHEMMER: Do you have an issue with John McCain? I went to his Web site, too. It's a little more prominent. It's under the category of Second Amendment. He wants an instant background check for all dealers, whether you're private or whether you're licensed. Do you have an issue with that?\n\nCOX: We have had disagreements with Sen. McCain. But if you compare Sen. McCain and Sen. Obama, there is a clear choice on the Second Amendment. McCain has voted against gun bans. He votes for self-defense and Barack Obama has been on the wrong side of every issue.\n\nHEMMER: All right. We've got to leave it there. We're out of time. Chris COX from the NRA, thank you for your time. To be continued.\n\nCOX: Thanks for having me.\n\nContent and Programming Copyright 2008 FOX News Network, LLC. ALL RIGHTS RESERVED. Transcription Copyright 2008 ASC LLC (www.ascllc.net), which takes sole responsibility for the accuracy of the transcription. ALL RIGHTS RESERVED. No license is granted to the user of this material except for the user's personal or internal use and, in such case, only one copy may be printed, nor shall user use any material for commercial purposes or in any fashion that may infringe upon FOX News Network, LLC'S and ASC LLC's copyrights or other proprietary rights or interests in the material. This is not a legal transcript for purposes of litigation",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0,
            0,
            0.9,
            0.9,
            0.9,
            0.9,
            0,
            0.6,
            0.6,
            0,
            0.8,
            0.8,
            0.8,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 14.625500679016113,
        "BiasReport": {
            "sentences": [
                {
                    "text": "Well, they're worried about Barack Obama winning and they're worried if he wins, he will take their guns away. And the truth is, they have a reason to worry.",
                    "bias_type": "Speculation Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence engages in speculation about the future actions of Barack Obama without concrete evidence, leading to the suggestion of a negative outcome based on conjecture."
                },
                {
                    "text": "This guy — he supported the most radical gun control agenda that's ever been imagined. He voted to ban single shot and double-barrel shotguns. He's voted to ban almost all hunting ammunition. He supported a 500 percent tax increase on guns and ammunition. So this guy is bad news when it comes to the Second Amendment and if people are buying guns, it doesn't really surprise me.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.9,
                    "bias_description": "The use of highly charged language such as 'the most radical' and 'bad news' to describe Barack Obama's gun control agenda implies a strong negative judgment and influences the reader's perception."
                },
                {
                    "text": "You're laying it on. He is saying that this piece of paper when he was in the Illinois legislature wasn't his handwriting. You are not buying that, are you?",
                    "bias_type": "Insinuative Questioning Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This question contains an implicit assumption that the audience should not believe Barack Obama's denial, leading them towards a preconceived notion of his dishonesty."
                },
                {
                    "text": "No, because the second questionnaire had his handwriting on it. You don't even have to go back that far. This year he said he supported Washington D.C.'s handgun ban and Washington's D.C.'s ban on self-defense in the home. And that's something that has gun owners really worried. This is a —",
                    "bias_type": "Projection Bias",
                    "bias_strength": 0.8,
                    "bias_description": "The assertion that 'this is something that has gun owners really worried' attributes feelings and concerns to a broad group without sufficient evidence, projecting the lobbyist's viewpoint onto all gun owners."
                }
            ],
            "overall_bias": {
                "conclusion": "The article is biased regarding the topic of gun control and the Second Amendment, with a general bias tendency towards portraying Barack Obama in a negative light regarding his stance on gun rights."
            }
        },
        "Scores": {
            "average_bias_strength": 0.7250000000000001,
            "percentage_of_biased_sentences": 0.20689655172413793,
            "overall_rating": 0.465948275862069
        },
        "combined_score": 0.0
    },
    {
        "Title": "WRAPUP 1-US top court finds individual right to own guns",
        "URL": "WRAPUP 1-US top court finds individual right to own guns.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    * Justices strike down Washington, D.C., gun ban      * New right is not unlimited      * First review of Second Amendment since 1939           By James Vicini      WASHINGTON, June 26 (Reuters) - For the first time in U.S.  history, the Supreme Court ruled on Thursday that individual  Americans have the right to own guns for personal use, and  struck down a strict gun control law in the U.S. capital.      The landmark 5-4 ruling marked the first time in nearly 70  years the country's high court has addressed whether the Second  Amendment of the U.S. Constitution protects an individual right  to keep and bear arms, rather than a right tied to service in a  state militia.      In the majority opinion, Justice Antonin Scalia said the  Second Amendment protected an individual right to possess a  firearm unconnected with service in a militia and to use that  arm for traditionally lawful purposes, such as self-defense  within the home.      Although an individual now has a constitutional right to  own guns, that new right is not unlimited, wrote Scalia, a  hunter.      He said the ruling should not be taken to cast doubt on  long-standing prohibitions on the possession of firearms by  felons and the mentally ill or on laws forbidding the carrying  of firearms in places like schools and government buildings or  laws imposing conditions on gun sales.      The Supreme Court's last review of the Second Amendment  came in a five-page discussion in an opinion issued in 1939  that failed to definitively resolve the constitutional issue.      In Thursday's opinion, the court struck down the country's  strictest gun control law adopted in Washington, D.C., 32 years  ago. It bans private possession of handguns and requires that  any rifles or shotguns kept at home be unloaded and dissembled  or bound by a trigger lock.           FIRST TIME GUN CONTROL LAW STRUCK DOWN      The ruling marked the first time that the Supreme Court has  struck down a gun control law for violating the Second  Amendment. The ruling could be the beginning of an era in which  anti-gun regulations are subject to legal challenges.      The justices split along conservative-liberal lines in the  ruling, one of the most important of the court's current term,  in deciding a legal battle over gun rights in America. The  ruling came on the last day of the court's 2007-08 term.      In dissent, Justice Stephen Breyer wrote, 'The decision  threatens to throw into doubt the constitutionality of gun laws  throughout the United States.'      President George W. Bush's two appointees on the court,  Chief Justice John Roberts and Justice Samuel Alito, both voted  with the majority in finding an individual right to keep  firearms.      The court adopted the gun rights position advocated by the  Bush administration. White House spokesman Tony Fratto said,      'We're pleased that the Supreme Court affirmed that the  Second Amendment protects the right of Americans to keep and  bear arms.'      Republican presidential candidate John McCain applauded the  ruling and criticized his likely Democratic opponent Barack  Obama for comments he had made.      'Unlike the elitist view that believes Americans cling to  guns out of bitterness, today's ruling recognizes that gun  ownership is a fundamental right -- sacred, just as the right  to free speech and assembly,' McCain said.      The ruling came the day after a worker at a plastics plant  in Henderson, Kentucky, used a handgun to shoot and kil",
        "Histogram": [
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0,
            0.6,
            0.6,
            0,
            0,
            0.5,
            0,
            0
        ],
        "Relevance": 13.782727241516113,
        "BiasReport": {
            "sentences": [
                {
                    "text": "The landmark 5-4 ruling marked the first time in nearly 70 years the country's high court has addressed whether the Second Amendment of the U.S. Constitution protects an individual right to keep and bear arms, rather than a right tied to service in a state militia.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the term 'landmark' and the emphasis on the rarity of the court's review may imply a positive judgment towards the ruling, suggesting its exceptional importance and implying a celebratory tone towards the expansion of gun rights."
                },
                {
                    "text": "In the majority opinion, Justice Antonin Scalia said the Second Amendment protected an individual right to possess a firearm unconnected with service in a militia and to use that arm for traditionally lawful purposes, such as self-defense within the home.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The specific framing of the majority opinion's assertion of individual gun rights, especially with the inclusion of 'traditionally lawful purposes' and 'self-defense within the home', could be seen as emphasizing the legitimacy and historical precedent of such rights, suggesting a positive bias towards the ruling."
                },
                {
                    "text": "The ruling marked the first time that the Supreme Court has struck down a gun control law for violating the Second Amendment. The ruling could be the beginning of an era in which anti-gun regulations are subject to legal challenges.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The language used to describe the ruling's significance, such as 'the beginning of an era' and the suggestion that it could lead to widespread legal challenges against gun regulations, implies a forward-looking, potentially transformative impact, which could be interpreted as a positive bias towards the ruling's consequences."
                },
                {
                    "text": "The justices split along conservative-liberal lines in the ruling, one of the most important of the court's current term, in deciding a legal battle over gun rights in America.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Describing the ruling as 'one of the most important' of the court's term and emphasizing the division along 'conservative-liberal lines' not only highlights its significance but also frames the issue in a politically charged context, suggesting a bias by implying that the decision's importance stems from its political implications rather than its legal or constitutional aspects."
                },
                {
                    "text": "In dissent, Justice Stephen Breyer wrote, 'The decision threatens to throw into doubt the constitutionality of gun laws throughout the United States.'",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the word 'threatens' and the broad assertion regarding the potential impact on gun laws nationwide by a dissenting justice could be seen as a way to dramatize the consequences of the ruling, suggesting a negative bias by highlighting the perceived dangers and uncertainties introduced by the decision."
                },
                {
                    "text": "President George W. Bush's two appointees on the court, Chief Justice John Roberts and Justice Samuel Alito, both voted with the majority in finding an individual right to keep firearms.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The specific mention of these justices as 'President George W. Bush's two appointees' before discussing their vote could imply a political bias, suggesting that their decision might be influenced by their appointment rather than their interpretation of the law or the Constitution."
                },
                {
                    "text": "Republican presidential candidate John McCain applauded the ruling and criticized his likely Democratic opponent Barack Obama for comments he had made.",
                    "bias_type": "Political Bias",
                    "bias_strength": 0.5,
                    "bias_description": "The inclusion of partisan political reactions, particularly the criticism of Barack Obama, introduces a political bias by framing the issue within the context of a partisan divide, suggesting that the ruling's significance lies in its political implications for the presidential candidates rather than its legal or constitutional aspects."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the Supreme Court's ruling on individual gun rights, particularly through the use of word choice and the framing of the issue in a politically charged context. The biases identified include a positive bias towards the ruling's significance and consequences, a negative bias towards the potential impact on gun laws, a political bias through the inclusion of partisan reactions, and a bias in discussing the justices' decisions in relation to their presidential appointment."
            }
        },
        "Scores": {
            "average_bias_strength": 0.5857142857142856,
            "percentage_of_biased_sentences": 0.15789473684210525,
            "overall_rating": 0.37180451127819547
        },
        "combined_score": 0.0
    },
    {
        "Title": "WRAPUP 2-Americans have right to guns under landmark ruling",
        "URL": "WRAPUP 2-Americans have right to guns under landmark ruling.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    * Justices strike down Washington, D.C., handgun ban      * New right is not unlimited      * First review of Second Amendment since 1939           By James Vicini      WASHINGTON, June 26 (Reuters) - Individual Americans have a  right to own guns, the Supreme Court ruled on Thursday for the  first time in history, striking down a strict gun control law  in the U.S. capital.      The landmark 5-4 ruling marked the first time in nearly 70  years the high court has addressed the Second Amendment of the  U.S. Constitution. It rejected the argument the right to keep  and bear arms was tied to service in a state militia.      Justice Antonin Scalia said for the majority the Second  Amendment protects an individual right to possess a firearm  unconnected with militia service and to use it for traditional  lawful purposes, such as self-defense in the home. However, he  said the new right was not unlimited.      The court struck down two parts of the country's strictest  gun control law adopted in Washington, D.C., 32 years ago --  the ban on private handgun possession and the requirement that  firearms kept at home be unloaded and disassembled or bound by  a trigger lock.      The ruling marked the first time the court has struck down  a gun control law for violating the Second Amendment.      The ruling won praise from the White House, Republican  presidential candidate John McCain and Wayne LaPierre of the  politically powerful National Rifle Association, who said,  'This is a great moment in American history.'      It drew fire from gun control groups, which warned of new  legal attacks on existing gun laws, and some Democrats in  Congress like Sen. Dianne Feinstein, who said the decision   'opens this nation to a dramatic lack of safety.'      The four liberal dissenting justices warned of the ruling's  consequences. 'The decision threatens to throw into doubt the  constitutionality of gun laws throughout the United States,'  Justice Stephen Breyer said.      Although an individual now has a constitutional right to  own guns, that new right is not unlimited, wrote Scalia, a  hunter.      He said the ruling should not be taken to cast doubt on  long-standing prohibitions on the possession of firearms by  felons and the mentally ill or on laws forbidding the carrying  of firearms in places like schools and government buildings or  laws imposing conditions on gun sales.      The Supreme Court's last review of the Second Amendment  came in a five-page discussion in an opinion issued in 1939  that failed to definitively resolve the constitutional issue.      In the 64-page opinion, Scalia said an individual right to  bear arms is supported by 'the historical narrative' both  before and after the Second Amendment's adoption.      'What is not debatable is that it is not the role of this  court to pronounce the Second Amendment extinct,' he said.      'Few laws in the history of our nation have come close to  the severe restriction of the district's handgun ban,' Scalia  said.           GUN POINTED AT BURGLAR WHILE CALLING POLICE      Scalia said a citizen may prefer may prefer a handgun for  home defense because 'it can be pointed at a burglar with one  hand while the other hand dials the police.'      The justices split along conservative-liberal lines in the  ruling, one of the most important of the court's current term,  in deciding a legal battle over gun rights in America. The  ruling came on the last day of the court's 2007-08 term.   ",
        "Histogram": [
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0.6,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0,
            0
        ],
        "Relevance": 13.631400108337402,
        "BiasReport": {
            "sentences": [
                {
                    "text": "The landmark 5-4 ruling marked the first time in nearly 70 years the high court has addressed the Second Amendment of the U.S. Constitution. It rejected the argument the right to keep and bear arms was tied to service in a state militia.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the term 'landmark' and the emphasis on the length of time since the last review of the Second Amendment may imply a judgment about the significance of the ruling, potentially influencing the reader's perception."
                },
                {
                    "text": "The ruling won praise from the White House, Republican presidential candidate John McCain and Wayne LaPierre of the politically powerful National Rifle Association, who said, 'This is a great moment in American history.'",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Describing the event as 'a great moment in American history' without counterbalancing viewpoints could suggest a positive judgment on the ruling, influencing the reader's perception."
                },
                {
                    "text": "It drew fire from gun control groups, which warned of new legal attacks on existing gun laws, and some Democrats in Congress like Sen. Dianne Feinstein, who said the decision 'opens this nation to a dramatic lack of safety.'",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the phrase 'drew fire' and the inclusion of Sen. Dianne Feinstein's dramatic warning about safety could imply a negative judgment on the ruling, potentially influencing the reader's perception."
                },
                {
                    "text": "The four liberal dissenting justices warned of the ruling's consequences. 'The decision threatens to throw into doubt the constitutionality of gun laws throughout the United States,' Justice Stephen Breyer said.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Highlighting the dissenting justices' concerns about the 'consequences' and the 'threat' to existing gun laws could suggest a negative outlook on the ruling, potentially influencing the reader's perception."
                },
                {
                    "text": "Although an individual now has a constitutional right to own guns, that new right is not unlimited, wrote Scalia, a hunter.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The emphasis on the limitation of the new right immediately after stating its recognition could imply a cautious or negative perspective on the expansion of gun rights, potentially influencing the reader's perception."
                },
                {
                    "text": "Scalia said a citizen may prefer may prefer a handgun for home defense because 'it can be pointed at a burglar with one hand while the other hand dials the police.'",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence, by highlighting the practicality of using a handgun for home defense, could subtly promote a pro-gun ownership perspective, potentially influencing the reader's perception."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the topic of gun rights, with a general tendency to present the ruling in a manner that could influence the reader's perception either positively or negatively, depending on the specific sentences analyzed."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.3,
            "overall_rating": 0.44999999999999996
        },
        "combined_score": 0.0
    },
    {
        "Title": "(Sebi announcement) Securities and Exchange Board of India (Mutual Funds) (Second Amendment) Regulations, 2008",
        "URL": "(Sebi announcement) Securities and Exchange Board of India (Mutual Funds) (Second Amendment) Regulations, 2008.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "Original source document can be found at: http://www.sebi.gov.in/acts/mfsecondamend.pdf                                                     THE GAZETTE OF INDIA                                                       EXTRAORDINARY                                                     PART -III- SECTION 4                                                 PUBLISHED BY AUTHORITY                                                  NEW DELHI, MAY 22, 2008                                     SECURITIES AND EXCHANGE BOARD OF INDIA                                                        NOTIFICATION                                                   Mumbai, the 22nd May, 2008                                        SECURITIES AND EXCHANGE BOARD OF INDIA                              (MUTUAL FUNDS) (SECOND AMENDMENT) REGULATIONS, 2008                        No. LAD-NRO/GN/2008/09/126202. -  In exercise of the powers conferred by section                     30 of the Securities and Exchange Board of India Act, 1992 (15 of 1992), the Board                     hereby makes the following Regulations to further amend the Securities and Exchange                     Board of India (Mutual Funds) Regulations, 1996, namely :-                            1.  These regulations may be called the Securities and Exchange Board of India                             (Mutual Funds) (Second Amendment) Regulations, 2008.                          2.  They shall come into force on the date of their publication in the Official Gazette.                         3.  In the Securities and Exchange Board of India (Mutual Funds) Regulations, 1996-                              (i)  in the Seventh Schedule, in clause 6, after the second proviso, the following                                proviso shall be inserted, namely:-                                'Provided further that sale of government security already contracted for                                purchase shall be permitted in accordance with the guidelines issued by the                                Reserve Bank of India in this regard.'                                                                                                   C. B. BHAVE                                                                                                CHAIRMAN                                                     SECURITIES AND EXCHANGE BOARD OF INDIA                                                                             [ADVT III/IV/69-ZB/2008/Exty.]                        Footnotes:                        (1)   The Securities and Exchange Board of India (Mutual Funds) Regulations, 1996,                            the Principal Regulations were published in the Gazette of India on December 9,                            1996 vide S.O. No. 856(E).                        (2)   The Securities and Exchange Board of India (Mutual Funds) Regulations, 1996                            were subsequently amended -                                 (a) on April 15, 1997 by the Securities and Exchange Board of India (Mutual                                Funds) (Amendment) Regulations, 1997 vide S.O. No.327(E).                             (b) on January 12, 1998 by the Securities and Exchange Board of India  (Mutual                                Funds) (Amendment) Regulations, 1998 vide S.O. No.32(E).                                 (c) on December 08, 1999 by the Securities and Exchange Board of India (Mutual                                Funds) (",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 13.616065979003906,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The provided document is a legal notification regarding the amendment of regulations by the Securities and Exchange Board of India. It contains technical and procedural information without any subjective content, opinions, or value judgments, and therefore does not exhibit bias."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "U.S. gun owners applaud Supreme Court ruling",
        "URL": "U.S. gun owners applaud Supreme Court ruling.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Ed Stoddard      FORT WORTH, Texas, June 26 (Reuters) - Gun-loving Americans  applauded their Supreme Court on Thursday after it ruled for  the first time in U.S. history that they had a right to own  firearms.      'I think it's great because Americans should have the  freedom to own guns and rifles, because America is a so-called  free country and that is one of our freedoms,' said 16-year-old  high school student and avid raccoon hunter Stella Richardson.      She and her mother were buying a new pistol holster for her  father at a Cabela's shop in Fort Worth, part of a chain  catering to U.S. hunters and gun enthusiasts.      The reaction to the decision was universally favorable  among those browsing in the firearms section of the store,  where hundreds of handguns gleam in glass display cases in  front of long rows of rifles and shotguns.      Individual Americans have a right to own guns, the Supreme  Court ruled for the first time in the country's history,  striking down a strict gun control law in Washington D.C.      The landmark 5-4 ruling marked the first time in nearly 70  years that the high court had addressed the Second Amendment of  the U.S. Constitution.      'I think the decision should have been nine to zero,' said  Don Polk, 60, as he browsed for a handgun.      'I think people up there in Washington should be able to  protect themselves the way that the rest of us have been  allowed to,' he said.      Buying a firearm is not a big problem in Texas where it is  even possible and fairly easy to obtain a permit to carry a  concealed handgun. A 'castle law' enables homeowners here to  shoot intruders if they feel threatened.      Bob Schultz, a Vietnam veteran and gun owner in a Dallas  suburb, spoke to Reuters in his home as he opened his .38  special to show that it was loaded -- as always.      'I wholeheartedly agree with this Supreme Court decision.  But I don't think it will deter the anti-gun lobby, they will  continue to crusade against weapons,' he said.      Besides two handguns, his main 'home defense' system is a  12-gauge pistol grip shotgun with a short barrel. At close  range that will put a big hole in an unwanted intruder.      At Cabela's, 71-year-old Bonnie Deberry browsed with her  husband for new handguns to add to their collection.      'I think you ought to be able to have one and carry them  openly. This country was built on guns,' she said.   (Editing by Anthony Boadle)   ((edward.stoddard@reuters.com; +1 817 421 4743))  Keywords: USA GUNS/COURT GUNSHOP        ",
        "Histogram": [
            0,
            0.6,
            0,
            0.6,
            0,
            0,
            0.6,
            0,
            0.6,
            0.6,
            0.5,
            0.6,
            0.6,
            0,
            0,
            0,
            0.6,
            0.6,
            0
        ],
        "Relevance": 13.522546768188477,
        "BiasReport": {
            "sentences": [
                {
                    "text": "'I think it's great because Americans should have the  freedom to own guns and rifles, because America is a so-called  free country and that is one of our freedoms,' said 16-year-old  high school student and avid raccoon hunter Stella Richardson.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the phrase 'so-called free country' and the framing of gun ownership as a fundamental freedom implies a judgment and suggests that countries claiming to be free may not actually be so, introducing a subtle bias through word choice."
                },
                {
                    "text": "The reaction to the decision was universally favorable  among those browsing in the firearms section of the store,  where hundreds of handguns gleam in glass display cases in  front of long rows of rifles and shotguns.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The description of the guns 'gleaming' in the display cases introduces a positive connotation, implying a sense of admiration or allure, which could bias the reader towards a favorable view of firearms."
                },
                {
                    "text": "'I think the decision should have been nine to zero,' said  Don Polk, 60, as he browsed for a handgun.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Expressing an opinion on how the decision 'should have been' implies a subjective judgment on the ideal outcome, blurring the line between fact and personal perspective and introducing bias through the inclusion of an individual's opinion as if it were a widely accepted standard."
                },
                {
                    "text": "Buying a firearm is not a big problem in Texas where it is  even possible and fairly easy to obtain a permit to carry a  concealed handgun. A 'castle law' enables homeowners here to  shoot intruders if they feel threatened.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "Describing the process of buying a firearm as 'not a big problem' and 'fairly easy' without providing context on the potential risks or regulations introduces a bias through the choice of words, downplaying any concerns or complexities related to gun ownership."
                },
                {
                    "text": "Bob Schultz, a Vietnam veteran and gun owner in a Dallas  suburb, spoke to Reuters in his home as he opened his .38  special to show that it was loaded -- as always.",
                    "bias_type": "Anecdotal Evidence Bias",
                    "bias_strength": 0.5,
                    "bias_description": "The use of an individual's personal habit of keeping a gun loaded at all times as an example to illustrate a broader point about gun ownership introduces anecdotal evidence, which may not be representative of the general population's practices or the overall impact of the Supreme Court ruling."
                },
                {
                    "text": "'I wholeheartedly agree with this Supreme Court decision.  But I don't think it will deter the anti-gun lobby, they will  continue to crusade against weapons,' he said.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The assertion that the anti-gun lobby will 'continue to crusade against weapons' is a subjective opinion presented as a matter of fact, suggesting a relentless and possibly irrational opposition to guns, which introduces bias by portraying one side in a negative, uncompromising light."
                },
                {
                    "text": "'I think you ought to be able to have one and carry them  openly. This country was built on guns,' she said.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The statement 'This country was built on guns' employs a historical narrative that emphasizes the role of guns in shaping the nation's identity, potentially oversimplifying complex historical realities and introducing bias through the use of emotionally charged and historically contentious language."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the topic of gun ownership, particularly in its portrayal of gun ownership as an unquestionable freedom and integral part of American identity. The biases identified include Word Choice Bias, Opinionated Bias, and Anecdotal Evidence Bias, all of which contribute to a general bias tendency towards presenting a positive and unchallenged view of gun ownership rights."
            }
        },
        "Scores": {
            "average_bias_strength": 0.5857142857142856,
            "percentage_of_biased_sentences": 0.3684210526315789,
            "overall_rating": 0.4770676691729323
        },
        "combined_score": 0.0
    },
    {
        "Title": "COLUMN-America's gun culture - fading slowly? Bernd Debusmann",
        "URL": "COLUMN-America's gun culture - fading slowly? Bernd Debusmann.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": " (Bernd Debusmann is a Reuters columnist. The opinions expressed  are his own)       By Bernd Debusmann      WASHINGTON, Jan 9 (Reuters) - Is America, land of shooting  massacres in schools and public places, slowly falling out of  love with guns?       The answer is yes, and it runs counter to popular  perceptions of the United States as a country where most  citizens are armed to the teeth and believe it is every  American's inalienable right to buy an AK 47-style assault rifle  with the minimum of bureaucratic paperwork.      But in fact, gun ownership in the United States has been  declining steadily over more than three decades, relegating gun  owners to minority status.       At the same time, support for stricter gun controls has been  growing steadily and those in favour make up a majority.      This is a little-reported phenomenon but the trend is shown  clearly by statistics compiled by the University of Chicago's  National Opinion Research Center (NORC), which has been tracking  gun ownership and attitudes on firearms since 1972, the  longest-running survey on the subject in the United States.       The number of households with guns dropped from a high of 54  percent in 1977 to 34.5 percent in 2006, according to NORC, and  the percentage of Americans who reported personally owning a gun  has shrunk to just under 22 percent.        So, by the rules of democratic play, one might assume that  the majority would have major influence on legislation. But  that's not how it works, thanks to the enormous influence of the  gun lobby.       The long-term decline monitored by the Chicago survey has  buoyed proponents of tighter gun controls. 'America's gun  culture is fading,' says Josh Sugarmann, who heads the  Washington-based Violence Policy Center.       According to Sugarmann, those keeping the culture alive and  those most vocal in resisting tighter regulations are white,  middle-aged men whose enthusiasm for firearms, hunting and  shooting is not shared by younger Americans.      Yet, at the moment it's difficult to imagine the U.S.  without its gun culture.       But then, who could have imagined France with a ban on  smoking in public places, Germany with speed limits on almost  half its autobahns, or a black man as a serious contender in  this year's presidential elections in the United States?      To what extent gun ownership will continue to shrink  depends, at least in part, on a decision by the U.S. Supreme  court expected this summer. The court will rule on one of the  most acrimonious disputes in the United States: do Americans  have the constitutional right to own and bear arms?            GUN RAMPAGES PART OF LIFE      At the heart of the long-running debate, argued with more  passion than almost any other, is the meaning of the U.S.  constitution's second amendment.       Written 219 years ago, it says: 'A well regulated Militia,  being necessary to the security of a free State, the right of  the people to keep and bear Arms, shall not be infringed.'      A string of lower court rulings over several decades held  that the amendment meant to guarantee the collective right of  state militias, not individual citizens. Such rulings have had  limited impact: gun regulations vary from state to state and in  most, weapons are easy to buy and legal to keep.      There are a few exceptions: handguns are illegal in Chicago  and in Washington, where a court ruled in December that its  total ban violated the constitution. That ",
        "Histogram": [
            0,
            0,
            0,
            0.6,
            0.6,
            0,
            0.6,
            0,
            0.9,
            0.9,
            0,
            0.9,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 13.37380313873291,
        "BiasReport": {
            "sentences": [
                {
                    "text": "The answer is yes, and it runs counter to popular perceptions of the United States as a country where most citizens are armed to the teeth and believe it is every American's inalienable right to buy an AK 47-style assault rifle with the minimum of bureaucratic paperwork.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of phrases like 'armed to the teeth' and 'every American's inalienable right' carries a negative connotation towards gun ownership, implying an excessive and unquestionable privilege that is not neutral."
                },
                {
                    "text": "But in fact, gun ownership in the United States has been declining steadily over more than three decades, relegating gun owners to minority status.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The phrase 'relegating gun owners to minority status' suggests a negative shift in the status of gun owners, implying a loss of significance or power, which could be seen as judgmental."
                },
                {
                    "text": "This is a little-reported phenomenon but the trend is shown clearly by statistics compiled by the University of Chicago's National Opinion Research Center (NORC), which has been tracking gun ownership and attitudes on firearms since 1972, the longest-running survey on the subject in the United States.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The assertion that this is a 'little-reported phenomenon' implies a neglect of important information, suggesting that the decline in gun ownership is underappreciated or deliberately overlooked, which could influence the reader's perception."
                },
                {
                    "text": "So, by the rules of democratic play, one might assume that the majority would have major influence on legislation. But that's not how it works, thanks to the enormous influence of the gun lobby.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This sentence presents a subjective opinion on the influence of the gun lobby as an unquestionable fact, suggesting that the democratic process is undermined by this influence without providing a balanced view or evidence."
                },
                {
                    "text": "'America's gun culture is fading,' says Josh Sugarmann, who heads the Washington-based Violence Policy Center.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.9,
                    "bias_description": "The statement presents a singular opinion as a definitive truth without acknowledging the diversity of perspectives on the issue, thereby promoting a biased view of the cultural shift regarding gun ownership."
                },
                {
                    "text": "According to Sugarmann, those keeping the culture alive and those most vocal in resisting tighter regulations are white, middle-aged men whose enthusiasm for firearms, hunting and shooting is not shared by younger Americans.",
                    "bias_type": "Discriminatory Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence generalizes a specific demographic group in a negative light, suggesting a resistance to change based on age and race, which can reinforce stereotypes and create a divisive narrative."
                },
                {
                    "text": "Yet, at the moment it's difficult to imagine the U.S. without its gun culture.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'difficult to imagine' implies a negative judgment towards the potential decline of gun culture, suggesting that such a change would be drastic or undesirable without presenting a balanced perspective."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the topic of gun culture in the United States, particularly in its portrayal of the decline in gun ownership and the influence of the gun lobby. The biases identified include Word Choice Bias, Opinionated Bias, and Discriminatory Bias, with a general tendency to present a negative view of gun ownership and resistance to tighter regulations."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6857142857142856,
            "percentage_of_biased_sentences": 0.13043478260869565,
            "overall_rating": 0.40807453416149064
        },
        "combined_score": 0.0
    },
    {
        "Title": "McCain takes aim at Obama over court gun ruling",
        "URL": "McCain takes aim at Obama over court gun ruling.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Steve Holland      CINCINNATI, June 26 (Reuters) - Republican presidential  candidate John McCain accused Democratic rival Barack Obama on  Thursday of reversing his position on a gun ban in the nation's  capital and said it was part of a pattern of flip-flopping by  the Illinois senator.      An Obama supporter responded by saying it was insincere for  McCain to make that charge because he himself had flip-flopped  'more times than a pancake.'      The Supreme Court ruled 5-4 on Thursday for the first time  that individual Americans have a right to own guns, striking  down a strict gun control law in Washington.      Obama in February had voiced support for the gun ban in  Washington. But after the Supreme Court voted to lift the ban,  Obama said he agreed with the court's decision that Americans  have a right to bear arms.      'I have said consistently that I believe the Second  Amendment is an individual right,' Obama told Fox Business  News, referring to the constitutional amendment that grants  Americans the right to bear arms.      'And that was the essential decision that the Supreme Court  came down on. And it also recognized that even though we have  an individual right to bear arms, that right can be limited by  sensible, reasonable gun laws,' he said.      McCain, speaking to reporters on his Straight Talk Express  bus in Cincinnati, saw a flip-flop on the part of his opponent  in the November election.       'All I can say is, it's one in a long series of reversals  of positions,' McCain said.      The Arizona senator also has faced charges of position  switches, most recently his decision last week to support  lifting a ban on U.S. offshore oil drilling.        'THE KING OF FLIP-FLOPS'      Rep. Debbie Wasserman Schultz, an Obama supporter, disputed  McCain on MSNBC, saying Obama had always been for individual  gun rights.      'For Sen. McCain, the king of the flip-flops, who has  flip-flopped more times than a pancake, it's really  disingenuous for him to be making accusations like that,' the  Florida lawmaker said.      McCain and his campaign surrogates cited Obama's decision  last week to decline public financing for his campaign after  saying he would take it, as well as his recent statement saying  he was willing to explore nuclear power as an option for  America's energy crisis after long opposing it.      McCain, in his Republican primary battle against former  Massachusetts Gov. Mitt Romney, had repeatedly characterized  Romney as a flip-flopper.      The strategy aims to paint the opponent as someone who  adjusts positions when it is politically convenient.      McCain is running behind Obama in national surveys of  voters and in polls taken in a number of battleground states,  including Ohio, which has been a key factor in the last two  presidential elections.      Many presidential candidates move to a more centrist  position after winning battles for their party's nomination  that often pull them to the left or right.      A McCain supporter, Kansas Republican Sen. Sam Brownback,  said he believed Obama was moving to the center.      'It does seem to reflect a willingness that as the campaign  changes from a primary to a general, willingness to change on  positions, to be more liberal in the primary, to moving more  conservative in the general election,' Brownback said.   (Editing by Xavier Briand)   (To read more about the U.S. political campaign, visit Reuters  'Tales from the Trail: 2008' online at ",
        "Histogram": [
            0,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0.9,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 13.12724781036377,
        "BiasReport": {
            "sentences": [
                {
                    "text": "An Obama supporter responded by saying it was insincere for McCain to make that charge because he himself had flip-flopped 'more times than a pancake.'",
                    "bias_type": "Ad Hominem Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence attacks McCain's character by using a humorous and derogatory comparison ('more times than a pancake') to suggest insincerity, rather than addressing the substance of his argument about Obama's position on the gun ban."
                },
                {
                    "text": "'For Sen. McCain, the king of the flip-flops, who has flip-flopped more times than a pancake, it's really disingenuous for him to be making accusations like that,' the Florida lawmaker said.",
                    "bias_type": "Ad Hominem Bias",
                    "bias_strength": 0.9,
                    "bias_description": "This statement not only uses the same ad hominem attack on McCain's character by labeling him 'the king of the flip-flops' but also intensifies the bias by using the word 'disingenuous' to question his sincerity, completely bypassing the discussion on the actual policy or position."
                }
            ],
            "overall_bias": {
                "conclusion": "The article is biased regarding the U.S. political campaign, specifically in the context of the gun ban discussion, showing a general bias tendency towards using ad hominem attacks to discredit opposing viewpoints rather than engaging in substantive policy debates."
            }
        },
        "Scores": {
            "average_bias_strength": 0.75,
            "percentage_of_biased_sentences": 0.09090909090909091,
            "overall_rating": 0.42045454545454547
        },
        "combined_score": 0.0
    },
    {
        "Title": "War May Redefine Gun Control.txt",
        "URL": "War May Redefine Gun Control.txt.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/67/Fox_News_Channel_logo.svg/240px-Fox_News_Channel_logo.svg.png",
        "Text": "Despite the high emotions that surround war — or perhaps because of them — people are focusing again on \"normal\" life. But what is normal has shifted in ways both obvious and subtle. Consider how war has affected just one issue: the debate over gun control.\n\nFor years, gun ownership advocates have agonized over how to make women comfortable around guns. As of 2000, 41.7 percent of men and 28.5 percent of women reported having a gun in their household, and 39.2 percent of men but only 10 percent of women personally owned a gun.\n\nReaching out to women and minorities has been a high priority of organizations like the National Rifle Association, not merely to swell their ranks but also to convert segments of society that have traditionally opposed the right to own a gun.\n\nNow, the outreach has become easier. As of 2002, over 210,000 women were on active duty within the military, over 150,000 were in the reserves. A steep increase in the number of women in the military means that an unprecedented number of Gen-Next women have overcome their mothers' aversion to guns.\n\nNon-military women also picked up guns. NRA spokeswoman Nance Pretto reported that, in the wake of Sept. 11, women's enrollment in instructional shooting classes increased fourfold from years before. And gun dealers reported a sharp increase in women purchasing weapons.\n\nThe sense of insecurity caused by Sept. 11 was heightened as police officers in the reserves left for active duty, depleting police departments. Some politicians began to actively encourage women to protect themselves by owning guns. When a serial killer was loose in Baton Rouge in the summer of 2002, Louisiana Gov. Mike Foster advised women \"you have a right to get a [concealed] gun permit. ... if you know how [to use a gun] and you have a situation with some fruitcake running around, like they've got right now, it sure can save you a lot of grief.\"\n\nFoster received the predictable backlash of outrage from gun control advocates who suddenly sounded sexist. Holley Galland Haymaker from the anti-gun group Louisiana Ceasefire argued: \"Maybe if you're a big, white guy who hunts all the time, it might do some good. For a woman who is surprise attacked, having a gun is only giving them [the attacker] another way to kill you.\"\n\nI will ignore the racist implications of this remark and simply ask, \"Why would a white guy who hunts be more competent with a gun than a woman who is trained to use it?\"\n\nTo judge from how strained their arguments have become, gun control advocates realize they are losing the debate. It would be difficult to escape this realization. Last Wednesday, the House of Representatives passed H.R. 1036 — the Protection of Lawful Commerce in Arms Act — which grants gun manufacturers immunity from lawsuits resulting from their products. The vote (04/09) was 285 to 140. The measure has now moved to the Senate where it is expected to pass.\n\nAs Rep. Mark Foley, R-Fla., argued, \"Manufacturers of legal products should not live under the threat of litigation simply because their product is misused ... [W]e don't sue Ginsu when someone is stabbed to death with their knife.\"\n\nAgain, the anti-gun arguments were shrill. A paper published by the Brady Center, entitled \"Smoking Guns: Exposing the Gun Industry's Complicity in the Illegal Gun Market,\" openly accused the firearms industry of \"actively and knowingly allowing guns to be sold into the illegal market.\" In short, gun manufacturers were publicly charged with criminal complicity.\n\nOther gun control advocates are pushing to have guns declared as \"weapons of mass destruction (WMD).\" For example, House Bill 1210 in Washington State defined a WMD as a \"device, object, or substance that a person intends to use to cause multiple human deaths.\" No specific weapons were mentioned but the Seattle Times opened its March 15 coverage of the bill with the sentence, \"An anti-terrorism bill has spurred debate among lawmakers: Is a gun a weapon of mass destruction?\" Possession would have been a class A felony had the bill passed with above-referenced language. Many in the pro-gun rights camp view the WMD argument as an indication of attacks to come.\n\nThe underlying facts of the gun debate remain much the same as before Sept. 11 and the war. The award-winning criminologist Prof. Gary Kleck states that firearms are used defensively 2.5 million times a year. 48 percent of those incidents involve women defending themselves; most of the time a shot is not fired. The conclusion: women benefit from gun ownership.\n\nWhat is changing, however, are the faces and attitudes of the debate. A growing number of women feel comfortable with guns and want them for self-defense. In response, anti-gun advocates are using arguments that seem increasingly implausible such as classifying guns as WMDs.\n\nGun ownership is just one of the issues over which we will stumble on the way back to normal life. And, as people drink coffee and read newspapers in the morning, they will discover that the war has influenced every aspect of public debate, including the words we use to describe and redefine our beliefs.\n\nWendy McElroy is the editor of ifeminists.com and a research fellow for The Independent Institute in Oakland, Calif. She is the author and editor of many books and articles, including the new book, Liberty for Women: Freedom and Feminism in the 21st Century (Ivan R. Dee/Independent Institute, 2002). She lives with her husband in Canada.\n\nRespond to the Writer",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            1.0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 12.641373634338379,
        "BiasReport": {
            "sentences": [
                {
                    "text": "I will ignore the racist implications of this remark and simply ask, \"Why would a white guy who hunts be more competent with a gun than a woman who is trained to use it?\"",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The sentence uses provocative language and introduces a racial and gender comparison that is unnecessary for the argument, implying judgment and potentially stirring controversy."
                },
                {
                    "text": "To judge from how strained their arguments have become, gun control advocates realize they are losing the debate.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence presents a subjective opinion about the state of the gun control debate as a fact, suggesting that the advocates' arguments are weak without providing evidence."
                },
                {
                    "text": "Again, the anti-gun arguments were shrill.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 1.0,
                    "bias_description": "The use of the word 'shrill' to describe the anti-gun arguments is a clear example of word choice bias, as it carries a negative connotation and implies judgment and dismissiveness."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the topic of gun control, particularly in its portrayal of the arguments and positions of gun control advocates. It employs word choice bias and opinionated bias to undermine the credibility of these advocates and their arguments, suggesting a general bias tendency against gun control measures."
            }
        },
        "Scores": {
            "average_bias_strength": 0.7333333333333334,
            "percentage_of_biased_sentences": 0.041666666666666664,
            "overall_rating": 0.3875
        },
        "combined_score": 0.0
    },
    {
        "Title": "ANALYSIS-Right to bear arms at heart of US high court case",
        "URL": "ANALYSIS-Right to bear arms at heart of US high court case.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": " (This is the first in a series of stories on guns in America  ahead of Supreme Court arguments on March 18)      By James Vicini      WASHINGTON, March 11 (Reuters) - For the first time in 70  years, the U.S. Supreme Court will take on the question of  whether individual Americans have the right to keep and bear  arms or whether it a collective right of the people for service  in a state militia.      That question is at the heart of a long, impassioned debate  about how much power the government has to keep people from  owning guns and it could soon be decided by the U.S. Supreme  Court in a case about one of the nation's strictest gun control  laws.      Set for arguments on March 18 and with a decision expected  by late June, the nation's highest court could resolve once and  for all the much-disputed meaning of the Second Amendment of  the U.S. Constitution.      Written 219 years ago, the amendment says, 'A well  regulated militia, being necessary to the security of a free  state, the right of the people to keep and bear arms, shall not  be infringed.'      Few constitutional law issues have triggered more scholarly  debate and historical research on whether the Constitution's  authors intended to guarantee an individual right or a  collective right tied to service in a state-regulated militia,  like today's National Guard.      The arguments follow a series of mass shootings in the past  year -- multiple killings on at least three college campuses,  two shopping centers and one Missouri town meeting. Gun deaths  average 80 a day in the United States, 34 of them homicides,  according to Centers for Disease Control data, and yet the gun  issue has barely registered in the U.S. presidential campaign.      If the court finds it is an individual right, gun control  advocates fear it could place in jeopardy not only the ban on  private handgun ownership in the U.S. capital at issue in the  case, but also other laws around the country regulating and  restricting private possession of firearms.      The Supreme Court's last review of the Second Amendment  came in a five-page discussion in an opinion issued nearly 70  years ago that failed to definitively resolve the  constitutional issue.      That could change when the justices consider whether a  32-year-old Washington, D.C., law banning private possession of  handguns violates the Second Amendment rights of individuals  unaffiliated with any state-regulated militia.           DIVISIVE ISSUE      Former top U.S. Justice Department officials including  former Attorney General Janet Reno, law professors, linguistic  experts and historians all argued the Second Amendment protects  the right of people only to keep arms for militia service.      On the other side, the Bush administration, the powerful  National Rifle Association, a majority of the U.S. Senate and a  majority of the House of Representatives argued an individual  has the right to possess arms.      The administration, under then-Attorney General John  Ashcroft, reversed the position the federal government had  taken for decades and said in 2001 the Second Amendment  protected an individual right to possess firearms for a lawful  private purpose.      Solicitor General Paul Clement, the administration's chief  advocate before the Supreme Court, filed a brief with the  justices that adopted many arguments made previously by legal  scholars for an individual right to keep arms.      He said placement of the Second Amendment with",
        "Histogram": [
            0,
            0.6,
            0,
            0,
            0,
            0.7,
            0.7,
            0.6,
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0
        ],
        "Relevance": 12.443634033203125,
        "BiasReport": {
            "sentences": [
                {
                    "text": "That question is at the heart of a long, impassioned debate about how much power the government has to keep people from owning guns and it could soon be decided by the U.S. Supreme Court in a case about one of the nation's strictest gun control laws.",
                    "bias_type": "Emotional Sensationalism Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'long, impassioned debate' and 'strictest gun control laws' evokes strong emotions and implies a negative view towards gun control measures, suggesting a bias towards the perspective of those opposed to strict gun control."
                },
                {
                    "text": "Few constitutional law issues have triggered more scholarly debate and historical research on whether the Constitution's authors intended to guarantee an individual right or a collective right tied to service in a state-regulated militia, like today's National Guard.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The choice of words such as 'triggered' and 'scholarly debate' implies a judgment that the issue is contentious and worthy of extensive research, suggesting a bias towards framing the debate as equally balanced when there may be a consensus."
                },
                {
                    "text": "The arguments follow a series of mass shootings in the past year -- multiple killings on at least three college campuses, two shopping centers and one Missouri town meeting. Gun deaths average 80 a day in the United States, 34 of them homicides, according to Centers for Disease Control data, and yet the gun issue has barely registered in the U.S. presidential campaign.",
                    "bias_type": "Causal Misunderstanding Bias",
                    "bias_strength": 0.7,
                    "bias_description": "This sentence implies a direct cause-and-effect relationship between the frequency of mass shootings and the lack of attention to the gun control issue in presidential campaigns, oversimplifying a complex issue and neglecting other factors that may influence campaign priorities."
                },
                {
                    "text": "If the court finds it is an individual right, gun control advocates fear it could place in jeopardy not only the ban on private handgun ownership in the U.S. capital at issue in the case, but also other laws around the country regulating and restricting private possession of firearms.",
                    "bias_type": "Speculation Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'gun control advocates fear' introduces speculation about the potential consequences of a court decision, suggesting negative outcomes without concrete evidence, and therefore biasing the reader towards a particular viewpoint on the issue."
                },
                {
                    "text": "Former top U.S. Justice Department officials including former Attorney General Janet Reno, law professors, linguistic experts and historians all argued the Second Amendment protects the right of people only to keep arms for militia service.",
                    "bias_type": "Appeal to Authority Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence appeals to the authority of 'former top U.S. Justice Department officials' and other experts to support a specific interpretation of the Second Amendment, implying that their opinions should be accepted without question, which can bias the reader towards their viewpoint."
                },
                {
                    "text": "On the other side, the Bush administration, the powerful National Rifle Association, a majority of the U.S. Senate and a majority of the House of Representatives argued an individual has the right to possess arms.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'powerful National Rifle Association' and 'argued' suggests a positive framing and legitimacy to the opposing viewpoint, potentially biasing the reader by implying that the strength or influence of the organizations and the number of supporters are indicative of the correctness of the argument."
                }
            ],
            "overall_bias": {
                "conclusion": "The article is biased regarding the topic of gun control, showing a general bias tendency towards framing the debate in a way that supports the rights of individuals to possess firearms, particularly in opposition to strict gun control measures. The biases identified include Emotional Sensationalism, Word Choice, Causal Misunderstanding, Speculation, and Appeal to Authority, all of which contribute to a presentation of the issue that may not be fully balanced or objective."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6166666666666667,
            "percentage_of_biased_sentences": 0.13333333333333333,
            "overall_rating": 0.375
        },
        "combined_score": 0.0
    },
    {
        "Title": "(Sebi announcement) Securities and Exchange Board of India  (Substantial Acquisition of Shares and Takeovers) (Second Amendment) Regulations, 2009",
        "URL": "(Sebi announcement) Securities and Exchange Board of India  (Substantial Acquisition of Shares and Takeovers) (Second Amendment) Regulations, 2009.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "Original source document can be found at: http://www.sebi.gov.in/acts/substantialamend09.pdf                                                     THE GAZETTE OF INDIA                                                       EXTRAORDINARY                                                     PART -III- SECTION 4                                                 PUBLISHED BY AUTHORITY                                              NEW DELHI, FEBRUARY   13, 2009                                     SECURITIES AND EXCHANGE BOARD OF INDIA                                                        NOTIFICATION                                               MUMBAI, the 13th February, 2009                                                Securities and Exchange Board of India                                             (Substantial Acquisition of Shares and Takeovers)                                              (Second Amendment) Regulations, 2009                        No. LAD/NRO/GN/2008-09/34/154082. In exercise of the powers conferred by Section                       30 of the Securities and Exchange Board of India Act, 1992 (15 of 1992), the Board                     hereby makes the following regulations to amend the Securities and Exchange Board of                     India (Substantial Acquisition of Shares and Takeovers) Regulations, 1997, namely:-                         1.  (i) These regulations may be called the Securities and Exchange Board of India                          (Substantial Acquisition of Shares and Takeovers) (Second Amendment)                          Regulations, 2009.                               (ii) These regulations shall come into force on the date of their publication in the                             Official Gazette.                         2.  In the Securities and Exchange Board of India (Substantial Acquisition of Shares                          and Takeovers) Regulations, 1997 -                          (i)     in regulation 25, after sub-regulation (2A) the following sub-regulation shall be                               inserted, namely: -                                '(2B) No public announcement for a competitive bid shall be made after an                               acquirer has already made the public  announcement pursuant to relaxation                               granted by the Board in terms of regulation 29A.'                          (ii)       after regulation 29, following regulation shall be inserted, namely:-                                'Relaxation from the strict compliance of provisions of Chapter III in                               certain cases.                               29A. The Board may, on an application made by a target company, relax any or                               more of the provisions of this Chapter, subject to such conditions as it may                               deem fit, if it is satisfied that -                                       (a)     the Central Government or  State Government or any other                                              regulatory authority has removed the board of directors of the                                              target company and has appointed other persons to hold office as                                                  directors thereof  under any law for the time being in force for                                              orderly conduct of the affairs of the target company;                                       (b)     suc",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 12.128073692321777,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The provided document is a regulatory notification by the Securities and Exchange Board of India, and it does not contain any biased sentences. The content is focused on the amendment regulations related to the acquisition of shares and takeovers, and it presents the information in a neutral and factual manner."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "(Sebi announcement) SEBI (Foreign Institutional Investors) (Second Amendment) Regulations, 2007",
        "URL": "(Sebi announcement) SEBI (Foreign Institutional Investors) (Second Amendment) Regulations, 2007.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "Original source document can be found at: http://www.sebi.gov.in/acts/fiisecondamend.html  --------------------------------------------------------------------------------    THE GAZETTE OF INDIA                                                                EXTRAORDINARY                                                                       PART -III- SECTION 4                                                                PUBLISHED BY AUTHORITY                                                              NEW DELHI , MONDAY, DECEMBER 31, 2007                                               SECURITIES AND EXCHANGE BOARD OF INDIA                                              NOTIFICATION                                                                        Mumbai, the   31st December, 2007                                                   SECURITIES AND EXCHANGE BOARD OF INDIA                                              (FOREIGN INSTITUTIONAL INVESTORS)                                                   (SECOND AMENDMENT) REGULATIONS, 2007                                                F. No. 11/LC/GM/2007/31/12/2007. -In exercise of the powers conferred by section    30 of the Securities and Exchange Board of India Act, 1992 (15 of 1992), the        Board hereby makes the following Regulations to further amend the Securities and    Exchange Board of India (Foreign Institutional Investors)Regulations, 1995,         namely :-                                                                           These Regulations may be called the Securities and Exchange Board of India          (Foreign Institutional Investors) (Second Amendment) Regulations, 2007. They        shall come into force on such date as the Board may specify by notification in      the Official Gazette. In the Securities and Exchange Board of India (Foreign        Institutional Investors) Regulations, 1995 -                                        (i)in regulation 15, -                                                              (a)in sub-regulation (3), for clause (a) and the proviso thereto, the following     shall be substituted, namely:-                                                      '(a) a foreign institutional investor or sub-account shall transact in the          Indian securities market only on the basis of taking and giving delivery of         securities purchased or sold:                                                       Provided that nothing contained in this clause shall apply to any transactions      in derivatives on a recognised stock exchange:                                      Provided further that a foreign institutional investor or sub-account may enter     into short selling transactions only in accordance with the framework specified     by the Board in this regard;'                                                       (b)for sub-regulation (8), the following sub-regulation shall be substituted,       namely:-                                                                            '(8) A foreign institutional investor or sub-account may lend or borrow             securities in accordance with the framework specified by the Board in this          regard.'                                                                            USHA NARAYANAN                                                                      EXECUTIVE DIRECTOR                                                                  [ADVT III/IV/69-ZB/2007/Exty.]                   ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 12.019193649291992,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The document is a regulatory notification by the Securities and Exchange Board of India regarding amendments to regulations for Foreign Institutional Investors. It does not contain any biased sentences as it primarily focuses on the legal and procedural aspects of the amendments."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    },
    {
        "Title": "China hunting park dreams of looser gun control",
        "URL": "China hunting park dreams of looser gun control.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": "    By Kitty Bu      YUQUAN, China, Jan 12 (Reuters) - In a frigid forest in  northeastern China, sub-zero temperatures and thick snow aren't  enough to dampen tourists' enthusiasm for firing a few rounds at  farm-raised animals let loose in the wild.      Yuquan International Hunting Field in Heilongjiang province  draws more than 100,000 domestic tourists a year, many travelling  thousands of miles to get their hands on a rifle or shotgun for  the first time in a country where gun ownership is strictly  controlled.      This is despite temperatures often straining to reach as warm  as minus 20 degrees Celsius in the daytime, and snow heavy on the  ground for six months of the year.      'Our country has very tight controls on gun ownership,' said  Wang Zengyu, Yuquan's manager.      The controls keep the tourists coming in, but also limit the  business's prospects, the former hotel manager said.      'If we need to buy arms, have our guns fixed or renewed, we  need to go to places that are designated by security authorities.  It would be illegal for us to go through other channels.'      Yuquan -- a 3,000-acre (1,200-hectare) reserve about 50 km  (30 miles) from Harbin, Heilongjiang's provincial capital -- is  hardly a sprawling wilderness, but it is the largest of China's  few designated hunting parks.      Once common across China's vast countryside, private gun  ownership has been effectively banned since the Communist Party  swept to power in 1949, stripping farmers and hunters of weapons.      Three decades of economic reforms, however, have seen private  ownership gain pace, from cashed-up enthusiasts willing to  negotiate the red tape to legally obtain a firearm, to black  market guns fashioned crudely for sale by impoverished villagers.      The quarry at Yuquan is limited to farm-raised rabbits,  pheasants and pigeons, while the generally male-dominated  shooting parties share a maximum two guns an outing.      The restrictions grate on some of Yuquan's visitors.      'I think they need to improve their service,' sniffed Chen  Shaowei, who was once a crack shooter with the People's  Liberation Army.      'We need more guides and guns. At the very least, two people  should share one gun ... There are more than 20 of us today, but  all of us are sharing two guns,' Chen said.      With permits to keep only 20 guns on site -- a mixture of  double-barrelled shotguns and low-calibre rifles -- Wang, the  owner, agrees.      'I hope we can have access to more types of guns ... If we  can use other kinds, customers can shoot more types of animals.  It would be more fun for them,' Wang said.      A fledgling but growing animal rights movement in China may  also crimp Wang's business fortunes and curtail would-be hunters'  enthusiasm.      In 2006, forestry officials shelved a plan to auction off  licences to hunt game in China's hinterlands after an outcry from  local media and Internet users.      A hunting reserve in China's northern Shanxi province  advertised prominently in Beijing's subway tunnels in recent  months has also drawn fire in local papers.      China's lamentable animal rights record, including  over-crowded zoos and bears farmed for bile for use in  traditional Chinese medicine, has long been condemned by wildlife  groups.      Officially, China remains ambivalent about pushing forward  animal protection, and has flagged lifting a 1993 ban on the  trade of tiger bones and parts under pressure from local  businesses.  ",
        "Histogram": [
            0,
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0.6,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0.6,
            0,
            0,
            0,
            0
        ],
        "Relevance": 11.998329162597656,
        "BiasReport": {
            "sentences": [
                {
                    "text": "'Our country has very tight controls on gun ownership,' said Wang Zengyu, Yuquan's manager.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the phrase 'very tight controls' implies a negative connotation towards the gun control policy, suggesting it is overly restrictive without providing a balanced view."
                },
                {
                    "text": "The controls keep the tourists coming in, but also limit the business's prospects, the former hotel manager said.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence presents the manager's opinion on the impact of gun control as a fact, blurring the line between objective reporting and personal perspective."
                },
                {
                    "text": "The restrictions grate on some of Yuquan's visitors.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of the word 'grate' suggests that the visitors' dissatisfaction with the restrictions is a significant issue, implying judgment on the gun control policy."
                },
                {
                    "text": "'I think they need to improve their service,' sniffed Chen Shaowei, who was once a crack shooter with the People's Liberation Army.",
                    "bias_type": "Word Choice Bias",
                    "bias_strength": 0.6,
                    "bias_description": "The use of 'sniffed' to describe Chen Shaowei's comment conveys a dismissive tone, subtly undermining the seriousness of his opinion on the need for improved service."
                },
                {
                    "text": "A fledgling but growing animal rights movement in China may also crimp Wang's business fortunes and curtail would-be hunters' enthusiasm.",
                    "bias_type": "Opinionated Bias",
                    "bias_strength": 0.6,
                    "bias_description": "This sentence frames the animal rights movement's impact on the hunting business in a negative light, suggesting that it is an unwelcome development without presenting a balanced perspective."
                }
            ],
            "overall_bias": {
                "conclusion": "The article exhibits bias regarding the topic of gun control and its impact on hunting in China, with a general tendency to portray the restrictions and their effects in a negative light without offering a balanced view."
            }
        },
        "Scores": {
            "average_bias_strength": 0.6,
            "percentage_of_biased_sentences": 0.08,
            "overall_rating": 0.33999999999999997
        },
        "combined_score": 0.0
    },
    {
        "Title": "UPDATE 1-US top court finds individual right to own guns",
        "URL": "UPDATE 1-US top court finds individual right to own guns.txt",
        "Logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8d/Reuters_Logo.svg/320px-Reuters_Logo.svg.png",
        "Text": " (adds details)      WASHINGTON, June 26 (Reuters) - The Supreme Court ruled on  Thursday, for the first time in U.S. history, that individual  Americans have the right to own guns for personal use, and  struck down a strict gun control law in the nation's capital.      The landmark 5-4 ruling marked the first time in nearly 70  years the high court has addressed whether the Second Amendment  of the U.S. Constitution protects an individual right to keep  and bear arms, rather than a right tied to service in a state  militia.      Writing the court's majority opinion, Justice Antonin  Scalia said the Second Amendment protected an individual right  to possess a firearm unconnected with service in a militia and  to use that arm for traditionally lawful purposes, such as  self-defense within the home.      Although an individual now has a constitutional right to  own guns, that new right is not unlimited, wrote Scalia, a  hunter.      The ruling came the day after a worker at a plastics plant  in Henderson, Kentucky, used a handgun to shoot and kill five  people inside the factory before killing himself, the latest in  a series of deadly shooting sprees across the country.      The Supreme Court's last review of the Second Amendment  came in a five-page discussion in an opinion issued in 1939  that failed to definitively resolve the constitutional issue.      The court struck down the nation's strictest gun control  law adopted in Washington D.C., 32 years ago. It bans private  possession of handguns and requires that any rifles or shotguns  kept at home be unloaded and dissembled or bound by a trigger  lock.      The justices split along conservative-liberal lines in the  ruling, one of the most important of the court's current term,  in deciding a legal battle over gun rights in America. The  ruling came on the last day of the court's 2007-08 term.      President George W. Bush's two appointees on the court,  Chief Justice John Roberts and Justice Samuel Alito, both voted  with the majority in finding an individual right to keep  firearms.      In dissent, Justice Stephen Breyer wrote, 'The decision  threatens to throw into doubt the constitutionality of gun laws  throughout the United States.'    (Reporting by James Vicini, Editing by Deborah Charles)   ((jim.vicini@thomsonreuters.com; 202-898-8397; Reuters  Messaging: jim.vicini.reuters.com@reuters.net))  Keywords: USA GUNS/COURT        ",
        "Histogram": [
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0,
            0
        ],
        "Relevance": 11.838364601135254,
        "BiasReport": {
            "sentences": [],
            "overall_bias": {
                "conclusion": "The article does not seem to exhibit bias. It provides a factual report on the Supreme Court's ruling regarding the individual right to own guns, presenting the details of the case and the justices' positions without introducing subjective or misleading information."
            }
        },
        "Scores": {
            "average_bias_strength": 0,
            "percentage_of_biased_sentences": 0,
            "overall_rating": 0
        },
        "combined_score": 0.0
    }
]